

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
Функция ВерсияОбработки() Экспорт
	
	Возврат "1.0.0";
	
КонецФункции

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаданныеОбработки = Метаданные();
		
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Наименование",		МетаданныеОбработки.Синоним);
	ПараметрыРегистрации.Вставить("Информация",			МетаданныеОбработки.Комментарий);
	ПараметрыРегистрации.Вставить("Версия",				ВерсияОбработки());
	ПараметрыРегистрации.Вставить("Вид",				"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",	Ложь);
	
	ТекущаяВерсияБСП = ТекущаяВерсияБСП();
	
	Если ЗначениеЗаполнено(ТекущаяВерсияБСП) Тогда
		ПараметрыРегистрации.Вставить("ВерсияБСП", ТекущаяВерсияБСП);
	КонецЕсли;
	
	Попытка
		ДополнитьПараметрыРегистрацииРазрешениямиВнешнейОбработки(ПараметрыРегистрации);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		ЗаписьЖурналаРегистрации("Диадок.БСП.ДобавитьРазрешения",,,, ТекстОшибки);
	КонецПопытки;
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
					НаименованиеКомандыВыполненияРегламентныхДействий(),
					ИдентификаторКомандыВыполненияРегламентныхДействий(),
					"ВызовСерверногоМетода");
		
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды) Экспорт
	
	ОбработкаКонтурДиадок = Обработки.КонтурЭДО.Создать();
	
	ОбработкаКонтурДиадок.ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды);
	
КонецПроцедуры

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ДополнитьПараметрыРегистрацииРазрешениямиВнешнейОбработки(ПараметрыРегистрации)

	Перем ВерсияБСП;
	
	Если Не ПараметрыРегистрации.Свойство("ВерсияБСП", ВерсияБСП)
		Или Не ЗначениеЗаполнено(ВерсияБСП) Тогда
		Возврат;
	КонецЕсли;
	
	Если СравнитьВерсии("2.2.2", ВерсияБСП) > 0 Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначения = Вычислить("ОбщегоНазначения");
	МодульРаботаВБезопасномРежиме = МодульОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Разрешения = Новый Массив;
	
	ОписаниеРазрешения = "Чтение и запись файлов с данными электронных документов";
	НаЧтение = Истина;
	НаЗапись = Истина;
	Разрешение = МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеКаталогаВременныхФайлов(
		НаЧтение,
		НаЗапись,
		ОписаниеРазрешения
	);
	
	Разрешения.Добавить(Разрешение);
	
	ОписаниеРазрешения = "Чтение данных для подготовки электронных документов";
	Разрешение = МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеПривилегированногоРежима(ОписаниеРазрешения);
	Разрешения.Добавить(Разрешение);
	
	ПараметрыРегистрации.Вставить("Разрешения", Разрешения);
	
КонецПроцедуры

Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Результат = 0;
	
	Пока НЕ ПустаяСтрока(СтрокаВерсии1) ИЛИ НЕ ПустаяСтрока(СтрокаВерсии2) Цикл
		
		Поз = Найти(СтрокаВерсии1, ".");
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(СтрокаВерсии1, Поз - 1));
			СтрокаВерсии1 = Сред(СтрокаВерсии1, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(СтрокаВерсии1), 0, Число(СтрокаВерсии1));
			СтрокаВерсии1 = "";
		КонецЕсли;
		
		Поз = Найти(СтрокаВерсии2, ".");
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(СтрокаВерсии2, Поз - 1));
			СтрокаВерсии2 = Сред(СтрокаВерсии2, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(СтрокаВерсии2), 0, Число(СтрокаВерсии2));
			СтрокаВерсии2 = "";
		КонецЕсли;
		
		Результат = НомерПервойВерсии - НомерВторойВерсии;
		
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКомандыВыполненияРегламентныхДействий()
	
	Возврат "Выполнение регламентных операций";
	
КонецФункции

Функция ИдентификаторКомандыВыполненияРегламентныхДействий()
	
	Возврат "ЭДО_ВыполнитьРегламентныеДействия";
	
КонецФункции

Функция ТекущаяВерсияБСП()
	
	Результат = "";
	
	Попытка
		
		Результат = Вычислить("СтандартныеПодсистемыСервер.ВерсияБиблиотеки()");
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
		ЗаписьЖурналаРегистрации("Диадок.БСП.ПолучитьВерсию",,,, ТекстОшибки);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

