Перем ТиповойМодульДиадока;
Перем РежимУправляемыхФорм;
Перем ОсновнойМодуль Экспорт;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира


//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Obrabotat'Sobytiye.html

	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме" Тогда
		
		Возврат ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);

		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "СопоставитьНоменклатуруПоставщика" Тогда
		
		Возврат СопоставитьНоменклатуруПоставщика(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
		
		
	///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
				
	ИначеЕсли ИмяСобытия = "ОпределитьТипЗначенияОбъекта" Тогда
		
		Возврат ОпределитьТипЗначенияОбъекта(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхПакетов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
	
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПриОткрытииФормы" Тогда
		
		Возврат ПриОткрытииФормы(Параметры);

	ИначеЕсли ИмяСобытия = "ПриПолученииДанныхТабличнойЧасти" Тогда
		
		Возврат ПриПолученииДанныхТабличнойЧасти(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов пакетов
Функция ПолучитьТаблицуИспользуемыхПакетов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'TablitsuIspol'zuyemykhPaketov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, СоставПакета, КатегорияПакета, НаименованиеКатегории, Шаблон");
	
	КатегорииПакетов = КатегорииПакетов();
	
	ОсновнойПакет			= КатегорииПакетов.ОсновнойПакет;
	КорректировочныйПакет	= КатегорииПакетов.КорректировочныйПакет;
	СчетФактураНаАванс		= КатегорииПакетов.СчетФактураНаАванс;
	СчетНаОплату			= КатегорииПакетов.СчетНаОплату;
	АктCверки				= КатегорииПакетов.АктCверки;
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД",								"ID_УПД",											ОсновнойПакет);
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ОсновнойПакет",		"СФ + ТОРГ12/Акт",					"ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура",	ОсновнойПакет);
	//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_раздельно",		"УПД СЧФ + УПД ДОП",				"ID_УПД_СЧФ, ID_УПД_ДОП",							ОсновнойПакет);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД",								"ID_УКД",											КорректировочныйПакет);
	//ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_раздельно",		"УКД КСЧФ + УКД ДИС",				"ID_УКД_КСЧФ, ID_УКД_ДИС",							КорректировочныйПакет);
	//ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ",								"ID_КСФ",											КорректировочныйПакет);
	//
	//ДобавитьСтрокуТЗ(ТЗ, "ID_СФ_НаАванс",			"СФ (на аванс)",					"ID_СчетФактура",									СчетФактураНаАванс);
	//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_НаАванс",			"УПД СЧФ (на аванс)",				"ID_УПД_СЧФ",										СчетФактураНаАванс);
	//
	//ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет",								"ID_Счет",											СчетНаОплату);
	//ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованный",	"Счет (формализованный)",			"ID_СчетФормализованный",							СчетНаОплату);
	//
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки",						"ID_АктСверки",										АктCверки);
	//
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)",				"ID_ИУПД");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_раздельно",		"УПД СЧФ + УПД ДОП (исправление)",	"ID_ИУПД_СЧФ, ID_УПД_ДОП");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)",					"ID_ИСФ");
	//
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)",				"ID_ИУКД");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_раздельно",		"УКД КСЧФ + УКД ДИС (исправление)",	"ID_ИУКД_КСЧФ, ID_ИУКД_ДИС");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)",				"ID_ИКСФ");
	//
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_НаАванс",			"УПД (исправление на аванс)",		"ID_ИУПД_СЧФ");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ_НаАванс",			"СФ (исправление на аванс)",		"ID_ИСФ");
	//
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12_Акт_БезНДС",	"ТОРГ12/Акт (без НДС)",				"ID_АктФормализованный, ID_ТОРГ12");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_БезНДС",			"УПД ДОП (без НДС)",				"ID_УПД_ДОП");
	//ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_БезНДС",			"УПД ДОП (исправление без НДС)",	"ID_ИУПД_ДОП");
	
	ЗаполнитьНаименованияКатерийПакетов(ТЗ);

	Возврат ТЗ;
	
КонецФункции

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'TablitsuIspol'zuyemykhVidovDokumentov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd820");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd820");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd820");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)", 				"InvoiceRevision", 						"utd820",	Неопределено,	"ID_СчетФактура");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd820",	"СЧФДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd820",	"СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd820",	"ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)", 				"UniversalTransferDocumentRevision",	"utd820",	"СЧФДОП",		"ID_УПД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_СЧФ",				"УПД СЧФ (исправление)", 			"UniversalTransferDocumentRevision",	"utd820",	"СЧФ",			"ID_УПД_СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_ДОП",				"УПД ДОП (исправление)", 			"UniversalTransferDocumentRevision",	"utd820",	"ДОП",			"ID_УПД_ДОП");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ", 								"InvoiceCorrection", 					"ucd736");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)", 				"InvoiceCorrectionRevision", 			"ucd736",		Неопределено,	"ID_КСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД", 								"UniversalCorrectionDocument",			"ucd736",		"КСЧФДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_КСЧФ",				"УКД КСЧФ", 						"UniversalCorrectionDocument",			"ucd736",		"КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_ДИС",				"УКД ДИС", 							"UniversalCorrectionDocument",			"ucd736",		"ДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)", 				"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФДИС",		"ID_УКД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_КСЧФ",			"УКД КСЧФ (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФ",			"ID_УКД_КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_ДИС",				"УКД ДИС (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"ДИС",			"ID_УКД_ДИС");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет", 							"ProformaInvoice", 						"");
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованный",	"Счет (формализованный)", 			"ProformaInvoice", 						"xmlproformainvoice");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct", 					"");

	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";
	
	КатегорииПакетов = КатегорииПакетов();

	НужнаВТДокументыБезНДС = Ложь;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ВидПакетаID		= ОписаниеВидаПакета.ID;
		КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
		
		Если 		ВидПакетаID = "ID_ОсновнойПакет" 
				ИЛИ ВидПакетаID = "ID_УПД"
				ИЛИ ВидПакетаID = "ID_УПД_раздельно" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Ложь);
			
		ИначеЕсли 	ВидПакетаID = "ID_УКД" 
				ИЛИ ВидПакетаID = "ID_УКД_раздельно"
				ИЛИ ВидПакетаID = "ID_КСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Ложь);
			
		ИначеЕсли	ВидПакетаID = "ID_УПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_СФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Ложь);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД" 
				ИЛИ ВидПакетаID = "ID_ИУПД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУКД" 
				ИЛИ ВидПакетаID = "ID_ИУКД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИКСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_ИСФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" 
				ИЛИ ВидПакетаID = "ID_УПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_ИУПД_БезНДС" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
			
			НужнаВТДокументыБезНДС = Истина;
			
		ИначеЕсли	ВидПакетаID = "ID_Счет" 
				ИЛИ ВидПакетаID = "ID_СчетФормализованный" Тогда
		
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
			
        ИначеЕсли	ВидПакетаID = "ID_АктСверки" Тогда
						
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
					|УПОРЯДОЧИТЬ ПО
					|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы, НужнаВТДокументыБезНДС);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Podgotovit'Paket.html
	
	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	Документ1С				= СтрокаСписка.Документ;
	
	// Первичные документы
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
		Для Каждого СтрокаТЧ Из Документ1С.ДокументыОснования Цикл
			ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, СтрокаТЧ.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
		Для Каждого СтрокаТЧ Из Документ1С.ДокументыОснования Цикл
			ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, СтрокаТЧ.ДокументОснование);
		КонецЦикла;
		
	// Первичные документы без НДС
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С);

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_ДОП");
		
	// Исправления первичных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
		Для Каждого СтрокаТЧ Из Документ1С.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, СтрокаТЧ.ДокументОснование, "ID_УПД_ДОП");
		КонецЦикла;	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Корректировочные документы
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_КСЧФ");
		
		Для Каждого СтрокаТЧ Из Документ1С.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, СтрокаТЧ.ДокументОснование, "ID_УКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_КСФ");
		
	// Исправления корректировочных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД_КСЧФ");
		
		Для Каждого СтрокаТЧ Из Документ1С.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, СтрокаТЧ.ДокументОснование, "ID_ИУКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИКСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИКСФ");
		
	// СФ на аванс
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
	// Исправления СФ на аванс
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
		
	// Прочие документы
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверки" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверки");		
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_Счет" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Счет");	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СчетФормализованный" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФормализованный");
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Podgotovit'ElektronnyyDokument.html
	
	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый		 = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры		 = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника			 = Параметры.ДанныеСотрудника;
	
	ДанныеОрганизации = ОсновнойМодуль.Организации_ЗаполненныеРеквизиты(, Результат.BoxID);
	
	УказыватьОтсутствиеОснованияУПД	= ДанныеОрганизации.УказыватьОтсутствиеОснованияУПД;
	
	Документ1С					= Результат.Документ1С;
	ДокументыОснования			= Результат.ДокументыОснования;
	ВидДокументаНаименование	= ВидДокументаРазвернутый.Наименование;
	
	ID							= ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO			= ВидДокументаРазвернутый.ТипКонтента;	
	TypeNamedId					= ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion				= ВидДокументаРазвернутый.FormatVersion;
	FunctionName				= ВидДокументаРазвернутый.FunctionName;
	
	Если ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("UtdSellerContent")
		ИЛИ ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("Utd820SellerContent")
		ИЛИ ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("UcdSellerContent") Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		ПараметрыИзПМ = ДополнительныеПараметры; 
		//Если ТипЗнч(ПараметрыИзПМ) = Тип("Структура") Тогда
			
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД"	, УказыватьОтсутствиеОснованияУПД);
		ДополнительныеПараметры.Вставить("ПараметрыСогласования"			, Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника"					, ДанныеСотрудника); // Графа 10 (РабОргПрод)
		ДополнительныеПараметры.Вставить("ФИОПодписанта"					, " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД"						, ФункцияУПД);
		ДополнительныеПараметры.Вставить("FormatVersion"					, FormatVersion);
		ДополнительныеПараметры.Вставить("ИспользоватьСервисКонтурМаркировка"					, Истина);
		ДополнительныеПараметры.Вставить("ПолучатьИзКМДляУКДТолькоРазницу", истина);
		ТиповойМодуль = ТиповойМодульДиадока();
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(ТиповойМодуль, РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		
		Если ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("UtdSellerContent")
			ИЛИ ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("Utd820SellerContent") Тогда
			
			
			Если Документ1С.ДокументОснование.Контрагент.ИНН = "5029222485" Тогда
				
				АдресМассив = РазбитьСтроку(Документ1С.ДокументОснование.АдресДоставки, "А.П.Р");
				
				Для каждого ГрузополучИнф из Content.Consignees Цикл
					
					ГрузополучИнф.Name = "ООО"+ " "+ Символ(34)+"А.П.Р"+Символ(34);
					ГрузополучИнф.Address.AddressText.AddressText = Сред(АдресМассив[1],3,СтрДлина(АдресМассив[1]));
					ГрузополучИнф.Address.AddressText.CountryCode = "643";
					ГрузополучИнф.Address.AddressText.Country = "РОССИЯ";
					ГрузополучИнф.Address.Type = "AddressText";
					
				КонецЦикла; 
				
			КонецЕсли;
			
			Если Документ1С.Контрагент.ИНН = "5027213485"
				И ЗначениеЗаполнено(Документ1С.ДокументОснование.ДоговорКонтрагента) Тогда 
				
				TransferBase = Content.TransferInfo.TransferBases[0];
				
				Заполнить_TransferBase970(TransferBase, Документ1С.ДокументОснование.ДоговорКонтрагента);
				
			КонецЕсли;
			
			Для каждого Стр из Content.Table.Items Цикл
				Если Стр.CustomDeclarations.Количество() = 1 Тогда 
					
					Если Стр.CustomDeclarations[0].CountryCode="--" ИЛИ Стр.CustomDeclarations[0].CountryCode="-"
						ИЛИ НЕ ЗначениеЗаполнено(Стр.CustomDeclarations[0].CountryCode) Тогда
						Стр.CustomDeclarations.Очистить();
						Content.ОшибкиВДанных.Очистить();
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			Если Документ1С.Дата > '20260401' Тогда
				Для каждого Стр из Content.Table.Items Цикл
					Если Стр.СлужебнаяИнформация.Номенклатура.КодТНВЭД.МаркированныйТовар Тогда
						Модуль = ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
						ДокументУчета = Модуль.НайтиДокументУчетаПоДокументу1С(Документ1С.ДокументОснование); 
						СтатусМаркировки = Модуль.ОсновнойСтатусДокументаУчета(ДокументУчета);
						Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
							ВызватьИсключение "Маркированный ТОВАР"; 
						КОнецЕсли;
					КОнецЕсли;
					
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		Если ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("UcdSellerContent") Тогда
			Если Документ1С.Дата > '20260401' Тогда
				Для каждого Стр из Content.InvoiceCorrectionTable.Items Цикл
					Если Стр.СлужебнаяИнформация.Номенклатура.КодТНВЭД.МаркированныйТовар Тогда
						//РезултатПроверки = ВзаимодействиеКонтурМаркировка.НайтиДокументУчетаПоДокументу1С(Документ1С.ДокументОснование);
						Модуль = ВзаимодействиеКонтурМаркировка.МодульКонтурМаркировка();
						ДокументУчета = Модуль.НайтиДокументУчетаПоДокументу1С(Документ1С.ДокументОснование); 
						СтатусМаркировки = Модуль.ОсновнойСтатусДокументаУчета(ДокументУчета);
						Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
							ВызватьИсключение "Маркированный ТОВАР"; 
						КОнецЕсли;
					КОнецЕсли;
					
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_СчетФормализованный" Тогда
		
		ДополнительныеПараметры = Неопределено;
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(ТиповойМодульДиадока(), РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверки" ИЛИ ID = "ID_Счет" Тогда
		
		Если ID = "ID_АктСверки" Тогда
			ИмяПечатнойФормы = "АктСверки";
		Иначе 
			ИмяПечатнойФормы = "СчетНаОплату";
		КонецЕсли;
		
		РуководительОрганизации = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		РуководительОрганизацииФИО = РуководительОрганизации.Фамилия + " " + РуководительОрганизации.Имя + " " + РуководительОрганизации.Отчество;
		РуководительОрганизацииФИО = ?(ЗначениеЗаполнено(РуководительОрганизацииФИО), РуководительОрганизацииФИО, "_");
		
		ДополнительныеПараметры = Новый Структура("ПараметрыСогласования, ФИОПодписанта", Неопределено, РуководительОрганизацииФИО);
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(ТиповойМодульДиадока(), РежимУправляемыхФорм, Документ1С, ИмяПечатнойФормы, ДополнительныеПараметры);
		
		Результат.Метаданные.DocumentDate	= Документ1С.Дата;
		Результат.Метаданные.DocumentNumber	= СокрЛП(Документ1С.Номер);
		Результат.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
		
		Если TypeNamedId = "ProformaInvoice" Тогда
			Результат.Метаданные.TotalSum = ДанныеПечатнойФормы.Сумма;
			Результат.Метаданные.TotalVat = ДанныеПечатнойФормы.СуммаНДС;
		КонецЕсли;
		
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура Заполнить_TransferBase970(Контент, Договор)
	
	УстановитьЗначениеXDTO(Контент, "DocumentName",						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Наименование"));
	УстановитьЗначениеXDTO(Контент, "DocumentNumber",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Номер"));
	УстановитьЗначениеXDTO(Контент, "DocumentDate",						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Дата"));

КонецПроцедуры

Процедура УстановитьЗначениеXDTO(Элемент, ИмяРеквизита, ЗначениеРеквизита, ЭтоСсылка = Ложь)

	Если ЗначениеРеквизита=Неопределено
		Или ЗначениеРеквизита=NULL Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		//здесь можно добавить проверки на заполненность, вывод сообщений и т.д.
		
		Если ЭтоСсылка Тогда
			Элемент[ИмяРеквизита] = ЗначениеВСтрокуВнутр(ЗначениеРеквизита);
		Иначе	
			Элемент[ИмяРеквизита] = ЗначениеРеквизита;
		КонецЕсли;
		
		//Элемент.Установить(ИмяРеквизита,ЗначениеРеквизита);
		
	Исключение
		Сообщить("Исключение при заполнении реквизита """+ИмяРеквизита+""":
		|"+ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры


Функция РазбитьСтроку(ИсходнаяСтрока,Разделитель)
	Рез = Новый Массив;
	Строки = СтрЗаменить(ИсходнаяСтрока,Разделитель,Символы.ПС);
	Для Ном = 1 По СтрЧислоСтрок(Строки) Цикл
		Рез.Добавить(СтрПолучитьСтроку(Строки,Ном));
	КонецЦикла;
	Возврат Рез;
КонецФункции

Функция ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры)
	
	ЗаполнитьРеквизитыДокумента(Параметры);
	
	Документ				= Параметры.Документ;
	РеквизитыДокумента		= Документ.Реквизиты;
	ВнешняяПечатнаяФорма	= Параметры.ВнешняяПечатнаяФорма;
	ИдентификаторКоманды	= Параметры.ИдентификаторКоманды;
	
	ДанныеПечатнойФормы = СформироватьВнешнююПечатнуюФорму(Документ.ДокументУчета, ВнешняяПечатнаяФорма, ИдентификаторКоманды);
	
	Документ.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	Документ.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
	Документ.Метаданные.DocumentDate	= РеквизитыДокумента.Дата;
	Документ.Метаданные.DocumentNumber	= РеквизитыДокумента.Номер;
	
	Если Документ.Метаданные.Свойство("TotalSum") Тогда
		Документ.Метаданные.TotalSum = РеквизитыДокумента.Сумма;
	КонецЕсли;
	
	Если Документ.Метаданные.Свойство("TotalVat") Тогда
		Документ.Метаданные.TotalVat = РеквизитыДокумента.СуммаНДС;
	КонецЕсли;
	
	ХранилищеКонтента = Документ.Документооборот.ХранилищеКонтента;
	ХранилищеКонтента.Данные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
	ХранилищеКонтента.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	СлужебнаяИнформация = Документ.СлужебнаяИнформация;
	СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = Истина;
	
	УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/PoslePodgotovkiPaketa.html

	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета	= Параметры.Документ.ДокументУчета;
	Реквизиты		= Параметры.Документ.Реквизиты;
	
	РеквизитыДокументаУчета = Новый Структура("Номер, Дата, СуммаДокумента");
	
	ЗаполнитьЗначенияСвойств(РеквизитыДокументаУчета, ДокументУчета);
	
	Реквизиты.Номер	= СокрЛП(РеквизитыДокументаУчета.Номер);
	Реквизиты.Дата	= РеквизитыДокументаУчета.Дата;
	Реквизиты.Сумма	= РеквизитыДокументаУчета.СуммаДокумента;
	
	Возврат Истина;
	
КонецФункции


///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////


// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Nayti_Sopostavleniye_Dokumenta.html

	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента		= Документ.Тип.ТипДокумента;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Результат;					
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента",	Документ.Реквизиты.Номер);
	
	Если ТипДокумента = "XmlTorg12" 
		ИЛИ ТипДокумента = "XmlAcceptanceCertificate" 
		ИЛИ (ТипДокумента = "UniversalTransferDocument" И ФункцияДокумента <> "Invoice") Тогда				
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = "Invoice" 
		ИЛИ (ТипДокумента = "UniversalTransferDocument" И ФункцияДокумента = "Invoice") Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ТипДокумента = "UniversalCorrectionDocument" И ФункцияДокумента <> "Invoice" Тогда				
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "КорректировкаПоступления");
		
	ИначеЕсли ТипДокумента = "UniversalCorrectionDocument" И ФункцияДокумента = "Invoice" Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ТипДокумента = "ProformaInvoice" Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетНаОплатуПоставщика");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	ТиповойМодуль = ТиповойМодульДиадока();
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		ТиповойМодуль,
		РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	Ошибки = Новый Массив;
	
	ПроверитьФункциюДокумента(Параметры, Ошибки);
	ПроверитьЗаполнитьИдентификаторОперации(Параметры, Ошибки);
	ПроверитьЗаполнитьДокументОснование(Параметры, Ошибки);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	ТиповойМодуль = ТиповойМодульДиадока();
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	Ошибки = ЗначениеВМассив(Результат.ОписаниеОшибки);
	
	ПроверитьЗаполнениеДокумента(НовыйОбъект, Ошибки);
	
	Если Не ЗначениеЗаполнено(Ошибки) Тогда 
		
		Если Параметры.СоздаватьСчетаФактуры
			И ТребуетсяСоздатьСчетФактуру(НовыйОбъект) Тогда
			
			СоздатьСчетФактуру(НовыйОбъект, Параметры.Документ);
			
		КонецЕсли; 
		
	Иначе
		
		Результат.ОсновнойОбъект = Неопределено;
		Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Ошибки, Символы.ПС);
		
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТиповойМодуль = ТиповойМодульДиадока();
	ТаблицаНоменклатурыДляСопоставления = ПараметрыПМ.ТаблицаСопоставления;
	
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления, ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет запись сопоставленной пользователем номенклатуры поставщика
Функция СопоставитьНоменклатуруПоставщика(ТаблицаНоменклатурыДляСопоставления)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Sopostavit'_Nomenklaturu_Postavshchika.html
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТиповойМодуль = ТиповойМодульДиадока();
	
	ОсновнойМодуль.ТиповойМодуль_СопоставлениеНоменклатуры(ТиповойМодуль, ТаблицаНоменклатурыДляСопоставления);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Provesti_Analiz_Dokumenta.html

	Результат = Параметры.РезультатАнализа; // шаблон результата анализа приходит в этом параметре - надо только заполнить его поля
	
	ДокументДД	= Параметры.ДокументДД;
	ПакетДД		= Параметры.ПакетДД;
	
	Ошибки		= Новый Массив;
	Документ1С	= Неопределено;
	
	СтруктураДанных = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД, ПакетДД);
	
	ТипДокумента 	= НРег(СтруктураДанных.ТипДокумента);
	ТипКонтента 	= НРег(СтруктураДанных.ТипКонтента);
	ФункцияДокумента= НРег(СтруктураДанных.ФункцияДокумента);	
	
	Контрагент	= СтруктураДанных.Контрагент;
	Организация	= СтруктураДанных.Организация;
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда			
		Сообщить("Не указано соответствие контрагента для входящего документа: " + ДокументДД);
		Возврат Неопределено; //пропускаем анализ: ждем сопоставления контрагента			
	КонецЕсли;
	
	
	// Выполним сопоставление документа
	МассивДокументов1С = НайтиСопоставлениеДокумента(Параметры);
	
	Если ТипЗнч(МассивДокументов1С) = Тип("Массив") И МассивДокументов1С.Количество() = 1 Тогда
		Документ1С = МассивДокументов1С[0];
	КонецЕсли;
	
    // НАКЛАДНЫЕ
	Если ТипДокумента = "xmltorg12" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда		
		
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найдена накладная №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));
		Иначе			
			ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Ошибки);					
		КонецЕсли;		
		
	// СЧЕТА-ФАКТУРЫ
	ИначеЕсли ТипДокумента = "invoice" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда		
						
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найден счет-фактура №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));			
		КонецЕсли;
		
		ТипКонтентаУПД = (ТипКонтента = "utd" ИЛИ ТипКонтента = "utd820");
		
		Если ТипДокумента = "invoice" И НЕ ТипКонтентаУПД Тогда
			Ошибки.Добавить("Счет-фактура в старом формате.");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("ДокументДляСопоставления", Документ1С);
	Результат.Вставить("Ошибки", Ошибки);	
	
	Если Ошибки.Количество() > 0 Тогда
		Результат.Вставить("ДействиеВ1С", "Выполнить анализ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)

	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Analiza_Paketa.html

	Пакет			= Параметры.Пакет;	
	ДокументыПакета	= Параметры.ДокументыПакета;
	
	ДокументыПакета.Колонки.Добавить("ДанныеДокумента");
	
	СуммаНакладной 					= Неопределено;
	СуммаСчетаФактуры 				= Неопределено;
	ЕстьНесопоставленныеДокументы 	= Ложь;	
	ЕстьКритичнаяОшибкаПакета 		= Ложь;
	
	Ошибки = Новый Массив;
	
	// 1. Анализ всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ТекДокумент.Ссылка, Пакет);
		ТекДокумент.ДанныеДокумента = ДанныеДокумента;
		
		ДокументДД 		= ТекДокумент.Ссылка;		
		ТипДокумента 	= НРег(ДанныеДокумента.ТипДокумента);
		ФункцияДокумента= НРег(ДанныеДокумента.ФункцияДокумента);	
		
		//ошибки, выявленные при выполнении события ПровестиАнализДокумента, распространяем на весь пакет
		Если ЗначениеЗаполнено(ДанныеДокумента.ТекстОшибки) Тогда
			Ошибки.Добавить(ДанныеДокумента.ТекстОшибки);
		КонецЕсли;
		
		Если ТипДокумента = "xmltorg12" 
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда
		    СуммаНакладной = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
		
		Если ТипДокумента = "invoice"
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда
			СуммаСчетаФактуры = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
						
		Если (ТипДокумента = "xmltorg12" ИЛИ ТипДокумента = "invoice" ИЛИ ТипДокумента = "universaltransferdocument")
			И НЕ ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
			ЕстьНесопоставленныеДокументы = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// 2. Интерпретация ошибок
	
	Если СуммаНакладной = Неопределено Тогда
		Ошибки.Добавить("Нет накладной.");
	КонецЕсли;
	
	Если СуммаСчетаФактуры = Неопределено Тогда
		Ошибки.Добавить("Нет счета-фактуры.");
	КонецЕсли;
	
	Если СуммаНакладной <> Неопределено И СуммаСчетаФактуры <> Неопределено И СуммаНакладной <> СуммаСчетаФактуры Тогда
		Ошибки.Добавить("Не совпадают суммы счета-фактуры и первичного документа.");
		//ЕстьКритичнаяОшибкаПакета = Истина; //иногда в СФ могут не включать позиции без НДС, тогда несовпадение сумм приемлемо
	КонецЕсли;
		
	ТекстВсехОшибокПакета = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Ошибки, Символы.ПС);
	
	ЕстьКритичнаяОшибкаПакета = (ЕстьКритичнаяОшибкаПакета 
								ИЛИ Найти(ТекстВсехОшибокПакета, "ДУБЛИКАТ") <> 0
								ИЛИ Найти(ТекстВсехОшибокПакета, "Счет-фактура в старом формате") <> 0);
	
	//ОшибокНет = (СокрЛП(ТекстВсехОшибокПакета) = ""); //самый жесткий вариант выполнения анализа пакета
	ОшибокНет = НЕ ЕстьКритичнаяОшибкаПакета;           //менее жесткий вариант выполнения анализа пакета
	
	
	// 3. Формирование контента ответа всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ТекДокумент.ДанныеДокумента;
		
		ДокументДД	= ТекДокумент.Ссылка;		
		Документ1С	= ДанныеДокумента.ДокументВ1С;
		ТекстОшибки	= ДанныеДокумента.ТекстОшибки;
		
		НеИзменятьДействиеВДД = ЗначениеЗаполнено(ДанныеДокумента.ТребуемоеДействиеВДД)
								И ДанныеДокумента.ТребуемоеДействиеВДД <> "Подписать";
		
		Если НеИзменятьДействиеВДД ИЛИ Не ЗначениеЗаполнено(Документ1С) Тогда
			Продолжить;
		КонецЕсли;
						
		РезультатАнализа = ОсновнойМодуль.ЭДО_НовыйРезультатАнализаВходящегоДокумента();
		
		РезультатАнализа.Ошибки = ТекстОшибки; // сохраняем ошибки, относящиеся только к текущему документу
		//РезультатАнализа.Ошибки = ТекстВсехОшибокПакета; // сохраняем ошибки всего пакета для каждого документа из пакета
		
		СписокДействийТекДокумента = ОсновнойМодуль.ЭДО_ВариантыОтветныхДействийПоДокументу(ДокументДД, ОшибокНет);		
		РезультатАнализа.ДействиеВДД = ?(СписокДействийТекДокумента.Количество()=0, "", СписокДействийТекДокумента[0].Значение);
				
		Если ЗначениеЗаполнено(РезультатАнализа.ДействиеВДД) Тогда						
			РезультатАнализа.Вставить("КонтентОтвета", ПолучитьКонтентОтвета(ДокументДД, Документ1С, РезультатАнализа.ДействиеВДД, ТекстВсехОшибокПакета));			
		КонецЕсли;
		
		РезультатАнализа.Вставить("ДокументДляСопоставления", Документ1С);
		ОсновнойМодуль.СохранитьРезультатАнализа(ДокументДД, РезультатАнализа);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Vypolnit'_Trebuyemoye_Deystviye.html

	ДокументДД 	= Параметры.ДокументДД;
	ПакетДД 	= Параметры.ПакетДД;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Параметры.Документ.Тип.ФункцияДокумента) Тогда
		ПредставлениеДокумента = ОсновнойМодуль.ЭДО_ПолучитьПредставлениеДокумента(ДокументДД);
		ТекстИсключения = "Не удалось выполнить действие над документом: " + ПредставлениеДокумента;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	
	Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
		
		Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
		Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
		
	КонецЕсли;		
	
	Возврат Истина;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 		= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента	= РеквизитыДокумента.ФункцияДокумента;
	Организация			= РеквизитыДокумента.Организация;
	Контрагент			= РеквизитыДокумента.Контрагент;
	
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
	
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", Организация, Контрагент);
	
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслугВНТТ",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратТоваровОтПокупателя",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт ИЛИ ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслугВНТТ", Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеДопРасходов",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионераОПродажах",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", Организация, Контрагент);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаПоступление"));
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАванс"));
			
			ОтборСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора); 
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
			
			ОтборКоррСФ = Новый Структура("Организация, Контрагент", Организация, Контрагент);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.Корректировочный"));
			
			ОтборКоррСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочнаяНакладная Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступления", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "АктСверкиВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетНаОплатуПоставщика", Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/proc/pm/Obrabotka_Vkhodyashchikh_Paketov.html
	
	Результат = Новый Структура;
	
	//Результат.Вставить("Ссылка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		НоменклатураКод = Элемент.Код;
		НоменклатураАртикул = Элемент.Артикул;
		НоменклатураНаименование = Элемент.Наименование;
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			НоменклатураНаименование,
			НоменклатураКод,
			НоменклатураАртикул
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции



///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	    //  ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(Параметры.Логин, Параметры.Пароль); 
		
		  ОсновнойМодуль.ЭДО_АвторизоватьсяПодСертификатомНаСервере1С();
          КонтекстСеанса = ОсновнойМодуль.ЭДО_КонтекстСеансаКлиентСервер();

      	ЗаписьЖурналаРегистрации("Диадок.АвторизацияПодСертификатом", УровеньЖурналаРегистрации.Информация,,, КонтекстСеанса.Количество());	

	
	//    АвторизоватьсяПодСертификатом();
        // 1. Авторизация под сертификатами сервера 1С
//ОсновнойМодуль.ЭДО_АвторизоватьсяПодСертификатомНаСервере1С();

//// 2. Параметры для получения списка пакетов на отправку
//ТаблицаВидовПакетов    = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьСписокЭлементов("ВидыПакетов");
//МассивВидовПакетов     = ТаблицаВидовПакетов.ВыгрузитьКолонку("Ссылка");

//ПараметрыОбновленияСписка = Новый Структура;
//ПараметрыОбновленияСписка.Вставить("Режим", "ОтправкаПакетов");
//ПараметрыОбновленияСписка.Вставить("НачалоПериода", ДобавитьМесяц(ТекущаяДата(), -1));
//ПараметрыОбновленияСписка.Вставить("КонецПериода", КонецДня(ТекущаяДата()));
//ПараметрыОбновленияСписка.Вставить("МассивВыбранныхВидов", МассивВидовПакетов);

////3. Отправка пакетов по организациям, в которых авторизовались под сертом сервера 1С
//Для Каждого Элемент Из КонтекстСеанса Цикл
//	
//	СтрокаКонтекста = Элемент.Значение;
//	Организация = СтрокаКонтекста.ОрганизацияДиадок.СвязанныйСправочник1;
//	
//	ПараметрыОбновленияСписка.Вставить("ОтборПоОрганизации", Организация);
//	
//	ОсновнойМодуль.ЭДО_Модуль_ОбновитьСписокДокументов(ПараметрыОбновленияСписка);  
//	
//	Для Каждого СтрокаТЧ Из ОсновнойМодуль.СписокДокументов Цикл
//		/// ОсновнойМодуль.ЭДО_ПодготовитьИОтправитьПакет(СтрокаТЧ);
//	КонецЦикла;    
//	
//КонецЦикла;
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Vypolnit'_Reglamentnyye_Deystviya.html

	//Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
	//	Сообщить("Не указана служебная учетная запись для выполнения регламентных действий.");
	//	Возврат Ложь;
	//КонецЕсли;
	//
	//// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	//
	//ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	//ОсновнойМодуль.ЭДО_АвторизоватьсяПодСертификатомНаСервере1С(); 
	// Параметрыс = Новый Структура;
	//Параметрыс.Вставить("НачалоПериода" ,НачалоДня(ТекущаяДата()-90000));
	//Параметрыс.Вставить("КонецПериода", НачалоДня(ТекущаяДата()-1));  
	//Параметрыс.Вставить("Режим", "ПолученныеДокументы");
	// ОсновнойМодуль.ЭДО_Модуль_ОбновитьСписокДокументов(Параметрыс);
	//
	//// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	//
	//КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	//Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
	//	
	//	ОписаниеОрганизации = Новый Структура;
	//	ОписаниеОрганизации.Вставить("BoxID",			 СтрокаОрганизации.BoxID);
	//	ОписаниеОрганизации.Вставить("Наименование",	 СтрокаОрганизации.Наименование);
	//	ОписаниеОрганизации.Вставить("Ссылка",			 СтрокаОрганизации.Ссылка);
	//	
	//	//ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
	//	
	//КонецЦикла;
	//ЗаписьЖурналаРегистрации("ДиадокРегламент",УровеньЖурналаРегистрации.Примечание,,,"ПроверкаРегламента");
	//
	//// ВЫПОЛНЕНИЕ MessagePatchToPost 
	//
	////Режим = ""; // Режим исполнения: ПередатьНаСогласование / ПередатьНаПодпись / ПередатьПоМаршруту / Согласование / ОтказВСогласовании
	////
	////ПараметрыMessagePatchToPost = Новый Структура;
	////ПараметрыMessagePatchToPost.Вставить("Действие",					Режим);        // вариант режима MessagePatchToPost
	////ПараметрыMessagePatchToPost.Вставить("ИдентификаторСотрудника",		Неопределено); // внутренний ID Диадока
	////ПараметрыMessagePatchToPost.Вставить("ИдентификаторПодразделения",	Неопределено); // внутренний ID Диадока
	////ПараметрыMessagePatchToPost.Вставить("ИдентификаторМаршрута",		Неопределено); // внутренний ID Диадока
	////ПараметрыMessagePatchToPost.Вставить("Комментарий",					"");           // произвольный текст 	
	////
	////// Произвольная коллекция документов Диадока, которые необходимо пропатчить (необходимо собрать по нужному алгоритму).
	////// Элементы этой коллекции должны содержать ключ "ДокументДД".
	////ТаблицаДокументов = Новый ТаблицаЗначений;	
	////
	////Если ЗначениеЗаполнено(Режим) Тогда
	////	ОсновнойМодуль.ЭДО_ОтправитьMessagePatchToPostДляВыбранныхСтрокСпискаДокументов(ТаблицаДокументов, ПараметрыMessagePatchToPost);
	////КонецЕсли;	
	////
	//// ПРИМЕРЫ ПОЛУЧЕНИЯ ID ПОДРАЗДЕЛЕНИЙ, ПОЛЬЗОВАТЕЛЕЙ, МАРШРУТОВ СОГЛАСОВАНИЯ:
	////boxId = ДокументДД.BoxId; // ID ящика, для которого получаем данные
	////ПодразделенияДиадок		 = ОсновнойМодуль.ЭДО_ПодразделенияОрганизацииВДиадоке(boxId);
	////ПользователиДиадок		 = ОсновнойМодуль.ЭДО_СписокПользователейДиадока(boxId);
	////МаршрутыСогласованияДиадок = ОсновнойМодуль.ЭДО_СписокМаршрутовСогласованияВДиадоке(boxId);
	//
	//// ПРИМЕР ПЕРЕМЕЩЕНИЯ ДОКУМЕНТОВ ПАКЕТА В ПОДРАЗДЕЛЕНИЕ:
	////МассивДокументов = Новый Массив;
	////Для Каждого СтрокаТЗ Из ТаблицаДокументов Цикл
	////	МассивДокументов.Добавить(Новый Структура("ДокументДД", СтрокаТЗ.ДокументДД));
	////КонецЦикла;
	////ОсновнойМодуль.ЭДО_ПереместитьМассивДокументовВПодразделение(BoxId, ToDepartmentId, МассивДокументов);
	//
	//// ПРИМЕР ПОДПИСАНИЯ И ОТПРАВКИ СЕРТИФИКАТОМ УСТАНОВЛЕННЫМ НА СЕРВЕРЕ 1С
	//// ОГРАНИЧЕНИЯ: сервер под Windows; закрытый ключ сертификата установлен под учеткой агента сервера 1С с сохраненным пин-кодом
	////
	////// 1. Авторизация под сертификатами сервера 1С
	//ОсновнойМодуль.ЭДО_АвторизоватьсяПодСертификатомНаСервере1С();  
	//КонтекстСеанса = ОсновнойМодуль.ЭДО_КонтекстСеансаКлиентСервер();
	////
	////// 2. Параметры для получения списка пакетов на отправку
	//ТаблицаВидовПакетов	 = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьСписокЭлементов("ВидыПакетов");
	//МассивВидовПакетов	 = ТаблицаВидовПакетов.ВыгрузитьКолонку("Ссылка");
	////
	////ПараметрыОбновленияСписка = Новый Структура;
	////ПараметрыОбновленияСписка.Вставить("Режим",					"ОтправкаПакетов");
	////ПараметрыОбновленияСписка.Вставить("НачалоПериода",			ДобавитьМесяц(ТекущаяДата(), -1));
	////ПараметрыОбновленияСписка.Вставить("КонецПериода",			КонецДня(ТекущаяДата()));
	////ПараметрыОбновленияСписка.Вставить("МассивВыбранныхВидов",	МассивВидовПакетов);
	////
	//////3. Отправка пакетов по организациям, в которых авторизовались под сертом сервера 1С
	////Для Каждого Элемент Из КонтекстСеанса Цикл
	////	
	////	СтрокаКонтекста	 = Элемент.Значение;
	////	Организация		 = СтрокаКонтекста.ОрганизацияДиадок.СвязанныйСправочник1;
	////	
	////	ПараметрыОбновленияСписка.Вставить("ОтборПоОрганизации", Организация);
	////	
	////	ОсновнойМодуль.ЭДО_Модуль_ОбновитьСписокДокументов(ПараметрыОбновленияСписка);
	////	
	////	//1 вариант: последовательная отправка
	////	Для Каждого СтрокаТЧ Из ОсновнойМодуль.СписокДокументов Цикл
	////		ОсновнойМодуль.ЭДО_ПодготовитьИОтправитьПакет(СтрокаТЧ);
	////	КонецЦикла;
	////	
	////	//2 вариант: фоновая отправка
	////	ОсновнойМодуль.ЭДО_ПодготовитьИОтправитьПакетыВФоне(ОсновнойМодуль.СписокДокументов);
	////	
	////КонецЦикла;	
	//
	////ПРИМЕР ПОДПИСАНИЯ И ОТПРАВКИ СОХРАНЕННОГО ОТВЕТА НА ВХОДЯЩИЙ ДОКУМЕНТ: ОсновнойМодуль.ЭДО_ПодготовитьИОтправитьОтветНаДокумент(ДокументДД, ПакетДД)
	//
	////ПРИМЕР СИНХРОНИЗАЦИИ КОНТРАГЕНТОВ ПОД УЧЕТНОЙ ЗАПИСЬЮ
	////ОсновнойМодуль.ЭДО_ЗаполнитьКонтекстСеансаДляСлужебнойУчетнойЗаписи();
	////ОсновнойМодуль.ВыполнитьСинхронизациюКонтрагентовОрганизаций();
	//
	////ПРИМЕР ДОБАВЛЕНИЯ СОГЛАСУЮЩЕЙ ПОДПИСИ К ДОКУМЕНТУ
	////ОсновнойМодуль.ЭДО_ОтправитьСогласующуюПодпись(ДокументДД, ОтпечатокСертификата);
	
	Возврат Истина;
	
КонецФункции


Процедура АвторизоватьсяПодСертификатом()
	
	
	Авторизация = ОсновнойМодуль.ЭДО_АвторизоватьсяПодСертификатомНаСервере1С();
	ЗаписатьВЖурналРегистрацииИнформацию("Диадок.АвторизацияПодСертификатом",,Авторизация);

КонецПроцедуры
 Процедура ЗаписатьВЖурналРегистрацииИнформацию(ИмяСобытия, Значение = Неопределено, Комментарий = Неопределено)
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,, Значение, Комментарий);	
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'_Nastroyki_Dopolnitel'nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Obnovleniya_Spiska_Dokumentov.html

	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваровУслуг) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваровУслуг
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Zapolnit'_Spisok_Dopolnitel'nykh_Knopok.html

	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Nazhatiye_Dopolnitel'noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение используемых справочников Организации и Контрагенты
Функция ОпределитьТипЗначенияОбъекта(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Opredelit'_Tip_Znacheniya_Obyekta.html
	
	Если Параметры.Синоним = "Организации" Тогда
		Результат = "СправочникСсылка.Организации";
	ИначеЕсли Параметры.Синоним = "Контрагенты" Тогда	
		Результат = "СправочникСсылка.Контрагенты";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|	И РеализацияТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслуг.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Дата >= &ДатаНачала
	|	И ПоступлениеТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			 = Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	 = Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПриОткрытииФормы(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Pri_Otkrytii_Formy.html
	
	Форма		= Параметры.Форма;
	ИмяФормы	= Параметры.ИмяФормы;
	
	// Пример для снятия флажков у всех видов пакетов на отправку
	
	//Если ИмяФормы = "ОсновнаяФорма" Тогда
	//
	//	ДеревоФильтров = Форма.ДеревоФильтров;
	//	
	//	СтрокаОтправкаПакетов = ДеревоФильтров.Строки.Найти("ОтправкаПакетов");
	//	
	//	Если СтрокаОтправкаПакетов <> Неопределено Тогда
	//		
	//		Для Каждого СтрокаВидыПакетов Из СтрокаОтправкаПакетов.Строки Цикл
	//			СтрокаВидыПакетов.Пометка = Ложь;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПриПолученииДанныхТабличнойЧасти(Параметры) Экспорт 
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Pri_Poluchenii_Dannykh_Tablichnoy_Chasti.html
	
	Форма			 = Параметры.Форма;
	ИмяФормы		 = Параметры.ИмяФормы;
	Элемент			 = Параметры.Элемент;
	ОформленияСтрок	 = Параметры.ОформленияСтрок;
	
	//Для Каждого Эл Из Параметры.ОформленияСтрок Цикл
	//	
	//	Если Эл.ДанныеСтроки.НомерСтроки % 2 = 0 Тогда
	//		Эл.Ячейки.Документ.ЦветФона	= WebЦвета.Аквамарин;
	//		Эл.ЦветФона					= WebЦвета.Древесный;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ


//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Функция РезультатФункцииОшибка(ОшибкаИлиМассив)
	
	Если ТипЗнч(ОшибкаИлиМассив) = Тип("Массив") Тогда
		КоллекцияОшибок = ОшибкаИлиМассив;
	Иначе
		КоллекцияОшибок = Новый Массив;
		КоллекцияОшибок.Добавить(ОшибкаИлиМассив);
	КонецЕсли;
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(КоллекцияОшибок);
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.НоменклатураКонтрагентов;
	
	// Ограничения типам реквизитов для текущей конфигурации
	ВладелецТип = МетаданныеРегистра.Измерения.Контрагент.Тип;
	
	НоменклатураТип = МетаданныеРегистра.Измерения.Номенклатура.Тип;
	ХарактеристикаТип = МетаданныеРегистра.Измерения.ХарактеристикаНоменклатуры.Тип;
	
	НаименованиеТип = МетаданныеРегистра.Ресурсы.НаименованиеНоменклатурыКонтрагента.Тип;
	КодТип = МетаданныеРегистра.Ресурсы.Идентификатор.Тип;
	АртикулТип = МетаданныеРегистра.Ресурсы.АртикулНоменклатурыКонтрагента.Тип;
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип,, ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип,, ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	Результат.Колонки.Добавить("Характеристика"         , ХарактеристикаТип);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, Наименование, Код = "", Артикул = "")
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент	 = Контрагент;
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.Код			 = Код;
	НоваяСтрока.Артикул		 = Артикул;
	
КонецПроцедуры

Функция ПолучитьРеквизитыПодписантаПоОрганизации1С(Организация, Дата)
	
	Результат = Новый Структура("Фамилия, Имя, Отчество, Должность", "", "", "", "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК ФизЛицо,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность.Наименование КАК Должность,
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.ФизЛицо ЕСТЬ NULL 
	|			ТОГДА ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо.Наименование
	|		ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК СокрФИО
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
	|			&Дата,
	|			СтруктурнаяЕдиница = &Организация
	|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.Руководитель)) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо ССЫЛКА Справочник.ФизическиеЛица) КАК ФИОФизЛицСрезПоследних
	|		ПО ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо");
	
	// немного универсальности
	Если Метаданные.Перечисления.Найти("ОтветственныеЛицаОрганизаций") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Перечисление.ОтветственныеЛицаОрганизации", "Перечисление.ОтветственныеЛицаОрганизаций");
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Найти("ФИОФизическихЛиц") <> Неопределено Тогда
		// для БП 3.0
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ФИОФизЛиц",	"ФИОФизическихЛиц");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ФизЛицо",		"ФизическоеЛицо");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.Фамилия 	= Выборка.Фамилия;
		Результат.Имя 		= Выборка.Имя;
		Результат.Отчество 	= Выборка.Отчество;
		Результат.Должность = Выборка.Должность;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОперацияПоступлениеТоваровУслуг()
	Возврат "ПоступлениеТоваровУслуг";
КонецФункции

Функция ОперацияКорректировкаПоступления()
	Возврат "КорректировкаПоступления";
КонецФункции

Функция ОперацияСчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = ОперацияПоступлениеТоваровУслуг();
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоСоглашениеОбИзмененииСтоимости(ТипЭД) Тогда
		
		Результат = ОперацияКорректировкаПоступления();
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипЭД)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипЭД) Тогда
		
		Результат = ОперацияСчетФактураПолученный();
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнитьДокументОснование(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование = Неопределено;
	Если ПараметрыСобытия.ДополнительныеПараметры.Свойство("ДокументОснование", ДокументОснование)
		И ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ИдентификаторОперации = ПараметрыСобытия.ИдентификаторОперации;
	
	Если ИдентификаторОперации = ОперацияКорректировкаПоступления() Тогда
		
		ДокументОснование = НайтиОснованиеДляСозданияКорректировкиПоступления(Документ, Ошибки);
		
	КонецЕсли;
	
	ПараметрыСобытия.ДополнительныеПараметры.Вставить("ДокументОснование", ДокументОснование);
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки)
		Или ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ТипЭД = Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
	Если Не ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		
		Если Не Документ.Тип.Формализованный Тогда
			Ошибки.Добавить("Документ неформализованный.");
		КонецЕсли;
		
		Ошибки.Добавить("Для этого формата или типа документа нельзя создать документ.");
		Ошибки.Добавить("Сопоставьте документ вручную из карточки документа.");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьФункциюДокумента(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ТипЭД = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ТипЭД.ФункцияДокумента) Тогда
		ТекстОшибки = "Не задана операция для создания учетного документа!";
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	МетаданныеОснованийСФ = Новый Массив;
	МетаданныеОснованийСФ.Добавить(Метаданные.Документы.ПоступлениеТоваровУслуг);
	МетаданныеОснованийСФ.Добавить(Метаданные.Документы.ПоступлениеДопРасходов);
	МетаданныеОснованийСФ.Добавить(Метаданные.Документы.КорректировкаПоступления);
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Результат = (МетаданныеОснованийСФ.Найти(ОбъектМетаданных) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Ищем в пакете документ счета-фактуры: если есть, то сразу создаем его в 1С.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Основание для создания счета-фактуры полученного.
//  Документ - Структура - электронный документ (см. Контракт_Документ).
//
Процедура СоздатьСчетФактуру(ДокументОбъект, Документ)
	
	ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
	
	Если Не ЗначениеЗаполнено(ЭлектронныйСФ)
		Или ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;

	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	ДокументСФ.Заполнить(ДокументОбъект.Ссылка);
	ДокументСФ.ДатаВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	ДокументСФ.НомерВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Номер;
	ДокументСФ.Дата = ТекущаяДата();
	ДокументСФ.КодСпособаПолучения = 2;
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	ДокументСФ.Записать();
	
	Если Не ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск счета-фактуры, полученного в одном пакете с указанным электронным документом.
//
// Параметры:
//  Документ - Структура - электронный документ (см. Контракт_Документ).
// 
// Возвращаемое значение:
//  Структура - электронный счет-фактура (см. Контракт_Документ).
//  Неопределено - если в пакете с указанным документом не найден счет-фактура.
//
Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) 
				Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Находит учетный документ, на основании которого нужно создать корректировку поступления.
//
// Параметры:
//  Документ - Структура - электронный УКД или КСФ (см. Контракт_Документ).
//  Ошибки - Массив из Строка- (возвращаемый параметр) Описания ошибок подбора документа-основания.
// 
// Возвращаемое значение:
//  ЛюабяСсылка - ссылка на документ-основание корректировки поступления.
//
Функция НайтиОснованиеДляСозданияКорректировкиПоступления(Документ, Ошибки)
	
	ДвоичныеДанные = Документ.Документооборот.ХранилищеКонтента.Данные;
	ДеревоКонтента = ОсновнойМодуль.XML_В_XDTO(ДвоичныеДанные);
	НомерДатаСФ = ДеревоКонтента.Документ.СвКСчФ.СчФ;
	
	ДокументОснование = Неопределено;
	
	Если ЭтоКорректировкаПоНесколькимОснованиям(НомерДатаСФ) Тогда
		
		Ошибки.Добавить("Создание корректировки по нескольким документам-оснований недоступно.");
		Ошибки.Добавить("Вы можете вручную создать документ в 1С и сопоставить его с текущим документом.");
		
	Иначе
		
		ДокументОснование = НайтиОснованиеКорректировки(Документ, НомерДатаСФ, Ошибки);
		ПроверитьОснованиеКорректировки(ДокументОснование, Ошибки);
		
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

Функция ЭтоКорректировкаПоНесколькимОснованиям(НомерДатаСФ)
	
	Результат = (ТипЗнч(НомерДатаСФ) = Тип("СписокXDTO"));
	Возврат Результат;
	
КонецФункции

Функция НайтиОснованиеКорректировки(Документ, НомерДатаСФ, Ошибки)
	
	ДокументОснование = Неопределено;
	
	НомерОснования = НомерДатаСФ.НомерСчФ;
	ДатаОснования  = ОсновнойМодуль.ДатаXML_в_Дата1С(НомерДатаСФ.ДатаСчФ);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	ДатаОснования);
	ПараметрыОтбора.Вставить("НомерДокумента",	НомерОснования);
	
	Если Документ.Тип.ФункцияДокумента = "InvoiceAndBasic" Тогда
		
		ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
		Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 
			И ДокументыОснования1С[0].ДокументыОснования.Количество() = 1 Тогда
			ДокументОснование = ДокументыОснования1С[0].ДокументыОснования[0].ДокументОснование;
		КонецЕсли;
		
	ИначеЕсли Документ.Тип.ФункцияДокумента = "Basic" Тогда

		ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если ДокументыОснования1С = Неопределено Тогда
			ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
		Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
			ДокументОснование = ДокументыОснования1С[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		ТекстОшибки = "Для корректировки не найден документ-основание №%НомерДокумента% от %ДатаДокумента%.";
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерДокумента%", НомерОснования);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаДокумента%", ДатаОснования);
		
		ТекстРешения = "Создайте счет-фактуру для документа-основания и повторите создание документа.";
		
		Ошибки.Добавить(ТекстОшибки);
		Ошибки.Добавить(ТекстРешения);
		
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

Процедура ПроверитьОснованиеКорректировки(ДокументОснование, Ошибки)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуемыеРеквизиты = Новый Структура;
	ТребуемыеРеквизиты.Вставить("Договор", "ДоговорКонтрагента");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ТребуемыеРеквизиты);
	
	ПредставлениеДокумента = Строка(ДокументОснование);
	
	Если Не ЗначениеЗаполнено(ЗначенияРеквизитов.Договор) Тогда
		
		ТекстОшибки = "На основании документа %Документ% нельзя создать корректировку поступления, т.к. не указан договор.";
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ПредставлениеДокумента);
		
		Ошибки.Добавить(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДокументы1С(ПараметрыОтбора, ВидДокумента1С)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ВидДокумента1С = "ПоступлениеТоваровУслуг" Тогда				
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
		|	И ПоступлениеТоваровУслуг.Организация = &Организация
		|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерДокумента";
	
	ИначеЕсли ВидДокумента1С = "ПоступлениеДопРасходов" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеДопРасходов.Ссылка
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	НЕ ПоступлениеДопРасходов.ПометкаУдаления
		|	И ПоступлениеДопРасходов.Организация = &Организация
		|	И ПоступлениеДопРасходов.Контрагент = &Контрагент
		|	И ПоступлениеДопРасходов.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеДопРасходов.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "КорректировкаПоступления" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаПоступления.Ссылка
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|ГДЕ
		|	НЕ КорректировкаПоступления.ПометкаУдаления
		|	И КорректировкаПоступления.Организация = &Организация
		|	И КорректировкаПоступления.Контрагент = &Контрагент
		|	И КорректировкаПоступления.ДатаВходящегоДокумента = &ДатаДокумента
		|	И КорректировкаПоступления.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетФактураПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация = &Организация
		|	И СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетФактураПолученный.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетНаОплатуПоставщика" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплатуПоставщика.Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	НЕ СчетНаОплатуПоставщика.ПометкаУдаления
		|	И СчетНаОплатуПоставщика.Организация = &Организация
		|	И СчетНаОплатуПоставщика.Контрагент = &Контрагент
		|	И СчетНаОплатуПоставщика.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетНаОплатуПоставщика.НомерВходящегоДокумента = &НомерДокумента";		
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД_УКД = ФункцияДокумента = "СЧФДОП" ИЛИ ФункцияДокумента = "КСЧФДИС"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД_УКД И ЭтоСФ Тогда
		
		Для Каждого СтрокаОснование Из ДокументУчета.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(СтрокаОснование.ДокументОснование, ДобавляемыйКомментарий);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПроверитьЗаполнениеДокумента(ДокументОбъект, Ошибки)
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокуДокументовОснованияСЧФ(ДокументОбъект);
	ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки);
	
КонецПроцедуры

Процедура ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки)
	
	ПроверяемыеТаблицы = Новый Структура;
	ПроверяемыеТаблицы.Вставить("Товары", Неопределено);
	ПроверяемыеТаблицы.Вставить("Услуги", Неопределено);
	
	ЗаполнитьЗначенияСвойств(ПроверяемыеТаблицы, ДокументОбъект);
	
	Для Каждого ЭлементСтруктуры Из ПроверяемыеТаблицы Цикл
		
		ПроверяемаяТаблица = ЭлементСтруктуры.Значение;
		
		Если ПроверяемаяТаблица = Неопределено
			Или ЗначениеЗаполнено(Ошибки) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТовар Из ПроверяемаяТаблица Цикл
			
			Номенклатура = СтрокаТовар.Номенклатура;
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				
				ТекстОшибки = НСтр(
						"ru = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.';
						|en = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.'"
					);
				
				Ошибки.Добавить(ТекстОшибки);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуДокументовОснованияСЧФ(ДокументОбъект);
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СчетФактураПолученный")
		И Не ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) 
		И ДокументОбъект.ДокументыОснования.Количество() = 0 Тогда
		
		ДокументОбъект.ДокументыОснования.Добавить(); 
		
	КонецЕсли;
	
КонецПроцедуры

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ


//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	
Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Процедура ПриглашениеОтладки()
	
	// Может пригодиться при отладке в режиме управляемых форм, когда точки остановки в открытом модуле не срабатывают.
	// Достаточно вставить вызов данной процедуры в нужном месте и включить остановку по ошибке.
	
	Попытка
		ВызватьИсключение "catch me if you can";
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ТиповойМодульДиадока()
	
	РежимОтладки = Ложь;
	//РежимОтладки = Истина; // Для отладки стандартного модуля интеграции УФ, необходимо выгрузить его в КаталогМодуля
	
	Если ТиповойМодульДиадока = Неопределено Тогда
		
		ДвоичныеДанные = ОсновнойМодуль.ЭДО_Служебные_ПолучитьМакет("ТиповойМодульДиадок" + ?(РежимУправляемыхФорм, "УФ", "") + "_epf");
		
		Если РежимОтладки Тогда
			
			КаталогМодуля  = "C:\WORK\Розетка\ПМ\temp\";
			
			ИмяФайла = КаталогМодуля + "ТиповойМодульДиадок" + ?(РежимУправляемыхФорм, "УФ", "") + ".epf";
			
			ДвоичныеДанные.Записать(ИмяФайла);
			
			ТиповойМодульДиадока = ОсновнойМодуль.ИнициализацияТиповогоМодуля(ИмяФайла, РежимУправляемыхФорм, РежимОтладки, КаталогМодуля);
			
		Иначе
			
			ТиповойМодульДиадока = ОсновнойМодуль.ИнициализацияТиповогоМодуля(ДвоичныеДанные, РежимУправляемыхФорм);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТиповойМодульДиадока;
	
КонецФункции

Функция ЗначениеВМассив(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность="")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Функция КатегорииПакетов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"ОсновнойПакет");
	Результат.Вставить("КорректировочныйПакет", "КорректировочныйПакет");
	Результат.Вставить("СчетФактураНаАванс", 	"СчетФактураНаАванс");
	Результат.Вставить("СчетНаОплату", 			"СчетНаОплату");
	Результат.Вставить("АктCверки", 			"АктCверки");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКатегории()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"Первичные документы");
	Результат.Вставить("КорректировочныйПакет", "Корректировочные документы");
	Результат.Вставить("СчетФактураНаАванс", 	"Счет-фактура на аванс");
	Результат.Вставить("СчетНаОплату", 			"Счет на оплату");
	Результат.Вставить("АктCверки", 			"Акт сверки");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНаименованияКатерийПакетов(ТЗ)
	
	НаименованиеКатегории = НаименованиеКатегории();
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.КатегорияПакета) Тогда
			СтрокаТЗ.НаименованиеКатегории = НаименованиеКатегории[СтрокаТЗ.КатегорияПакета];
		КонецЕсли;
		
	КонецЦикла;
	
Конецпроцедуры

Функция МожноСформироватьПередаточныйДокумент(Документ1С)
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
	
	ТипДокумента = ТипЗнч(Документ1С);
	
	Результат = (ИсключаемыеТипы.Найти(ТипДокумента) = Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
	
КонецПроцедуры

Процедура ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументПроверки = Документ1С;
	
	ЕстьТовары = ДокументПроверки.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено
				 И (ДокументПроверки.Товары.Количество() > 0);
	
	ЭтоОтчетКомитенту = ТипЗнч(Документ1С) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");
	
	Если ЕстьТовары И Не ЭтоОтчетКомитенту Тогда		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ТОРГ12");
	Иначе
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктФормализованный");
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Результат)
		
	// Ищем ТОРГ-12 или УПД, относящийся к другому (не к текущему) пакету, и находящийся в статусе "Требуется подпись" или "Подписан".
	// Еще искомый документ должен быть уже проверен и признан "хорошим" (возможно, его еще не подписали, но уже проверили)
	// Если такой есть, то по текущему документу будем отказывать в подписи, т.к. это дубль
	
	ТипыДокументов = Новый Массив;
	
	ТипыДокументов.Добавить("XmlTorg12");
	ТипыДокументов.Добавить("UniversalTransferDocument");
	
	Статусы  = Новый Массив;
	Статусы.Добавить("Подписан");
	Статусы.Добавить("Требуется подпись");
	
	Если ОсновнойМодуль.ЭДО_Использовать1СЭДО() Тогда 
		//TODO добавить проверку дублей для 1С-ЭДО
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.Ссылка,
		|	Диадок_Документы.АнализПроведен КАК АнализПроведен,
		|	Диадок_Документы.ТекстОшибки КАК ОшибкиПроверкиТекст
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Ссылка <> &ТекущийДокументДД
		|	И Диадок_Документы.LetterId <> &LetterId
		|	И Диадок_Документы.Документ = &Документ1С
		|	И (Диадок_Документы.Направление = ""Inbound"" или Диадок_Документы.Направление = ""Входящее"" )  //переходный период перед релизом 1.0.0
		|	И Диадок_Документы.ТипДокумента В(&ТипДокумента)
		|	И Диадок_Документы.АнализПроведен
		|	И Диадок_Документы.Статус В(&Статусы)
		|	И Выразить(Диадок_Документы.ТекстОшибки как строка(1)) = """"     //  ТекстОшибки сейчас неограниченная строка. Выразить работает в сторону уменьшения длины, но не увеличения
		//|	И Диадок_Документы.ДатаЗагрузки <= &ДатаЗагрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диадок_Документы.ДатаЗагрузки";
		
		Запрос.УстановитьПараметр("ТекущийДокументДД",	ДокументДД);
		Запрос.УстановитьПараметр("Документ1С",			Документ1С);
		Запрос.УстановитьПараметр("ТипДокумента",		ТипыДокументов);
		Запрос.УстановитьПараметр("Статусы",			Статусы);		
		Запрос.УстановитьПараметр("LetterId",			ДокументДД.LetterId);
		Запрос.УстановитьПараметр("ДатаЗагрузки",		ДокументДД.ДатаЗагрузки);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество()>0 И ЗначениеЗаполнено(Выборка[0].Ссылка) Тогда
			Док = Выборка[0].Ссылка;
			Результат.Добавить("ДУБЛИКАТ: накладная уже была учтена в электронном виде (дата " +формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy")
			+", номер "+Док.НомерДокумента+", загружен из Диадок "+Док.ДатаЗагрузки +")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКонтентОтвета(ДокументДД, Документ1С, ДействиеВДД, ТекстВсехОшибок)
	
	Content = ОсновнойМодуль.ЭДО_ПолучитьПустойКонтентОтветаДляДокумента(ДокументДД, ДействиеВДД);
	
	Если нрег(Content.Тип().Имя) = "torg12buyercontent" Тогда
		
		Content.ShipmentReceiptDate = Документ1С.Дата;
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Receiver, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, получившее груз
		ЗаполнитьПодпись(Content.Accepter, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, принявшее груз

	ИначеЕсли нрег(Content.Тип().Имя) = "utdbuyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.Creator				= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП "+Документ1С.Организация.КПП;
		Content.CreatorBase			= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";
		
	ИначеЕсли нрег(Content.Тип().Имя) = "utd820buyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.DocumentCreator		= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП "+Документ1С.Организация.КПП;
		Content.DocumentCreatorBase	= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";	
		
	ИначеЕсли нрег(Content.Тип().Имя) = "acceptancecertificatebuyercontent" Тогда
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Official, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, подписывающее со стороны заказчика
		
	ИначеЕсли нрег(Content.Тип().Имя) = "correctionrequestcontent"	// запрос на уточнение по СФ
		Или нрег(Content.Тип().Имя) = "formalizedrejectioncontent"  // отказ по формализованному
		Или нрег(Content.Тип().Имя) = "rejectioncontent" Тогда		// отказ по неформализованному
				
		Content.Comment = ТекстВсехОшибок;
		
	КонецЕсли;	
	
	Возврат Content;
	
КонецФункции

Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + ТекстЗапроса_ОбъединитьВсе());

КонецФункции

Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, ВидСчетаФактуры, Исправление)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат =
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК Документ,
	|	СчетФактура.Номер КАК НомерДокумента,
	|	СчетФактура.Дата КАК ДатаДокумента,
	|	СчетФактура.Контрагент КАК Контрагент,
	|	СчетФактура.Организация КАК Организация,
	|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И СчетФактура.Проведен
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И НЕ СчетФактура.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка,
	|	СчетФактура.Номер,
	|	СчетФактура.Дата,
	|	СчетФактура.Контрагент,
	|	СчетФактура.Организация,
	|	СчетФактура.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И НЕ СчетФактура.ПометкаУдаления
	|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И НЕ СчетФактура.Исправление";
	
	Если Исправление Тогда
		
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		Иначе
			ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
										   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = """ + ВидИсправляемогоПакета + """");
		
		Результат = СтрЗаменить(Результат, "НЕ СчетФактура.Исправление", "СчетФактура.Исправление");
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	Результат = СтрЗаменить(Результат, "НаРеализацию",	ВидСчетаФактуры);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета, Исправление);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	   		    	        	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;

	Результат =
	"ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|			И (ВТ_ДокументыБезНДС.Исправление)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
	|	И ВТ_ДокументыБезНДС.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДокументыБезНДС.Документ,
	|	ВТ_ДокументыБезНДС.НомерДокумента,
	|	ВТ_ДокументыБезНДС.ДатаДокумента,
	|	ВТ_ДокументыБезНДС.Контрагент,
	|	ВТ_ДокументыБезНДС.Организация,
	|	ВТ_ДокументыБезНДС.СуммаДокумента,
	|	&ВидПакетаID
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|			И (ВТ_ДокументыБезНДС.Исправление)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
	|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";	
	    	
	Если Найти(ВидПакетаID, "ID_И") = 0 Тогда
		Результат = СтрЗаменить(Результат, "И (ВТ_ДокументыБезНДС.Исправление)", "И (НЕ ВТ_ДокументыБезНДС.Исправление)");
	КонецЕсли;

	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный	 = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
										   
	Результат = СтрЗаменить(Результат, "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
									   "ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
										   
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
	|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
	|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
	|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
	|	СчетНаОплатуПокупателю.Организация КАК Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат = 
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
	|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
	|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	0 КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
	|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
	|			И (ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления";

	Результат = СтрЗаменить(Результат, "&ВидПакетаID",	"""" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета, Исправление = Ложь)
	
	КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID		= ОписаниеВидаПакета.ID;
	
	ПодстрокаПоиска = "ОтправленныеДокументы.КатегорияПакета = &КатегорияПакета";
	
	Если ОсновнойМодуль.ИспользоватьПодсистемуДиадока()
		И НЕ Исправление Тогда
		
		Если ЗначениеЗаполнено(КатегорияПакета) Тогда
			ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """";
		Иначе
			ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID;
		КонецЕсли;
		
	Иначе
		ПодстрокаЗамены = "ИСТИНА";
	КонецЕсли;

	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Если ОсновнойМодуль.ИспользоватьПодсистемуДиадока() Тогда
		Результат =  ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку_Диадок();
	Иначе
		Результат = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку_1С();
	КонецЕсли;
	
	Возврат Результат;
			
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку_Диадок()
	
	Результат = 
	"ВЫБРАТЬ
	|	ВидыПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВидыПакетов.ID КАК ВидПакетаID,
	|	ВидыПакетов.ПоУмолчанию КАК ПоУмолчанию
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетов
	|ИЗ
	|	&ТаблицаВидовПакетов КАК ВидыПакетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшВидовПакетов.КатегорияПакета,
	|	ВТ_КэшВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетовПоУмолчанию
	|ИЗ
	|	ВТ_КэшВидовПакетов КАК ВТ_КэшВидовПакетов
	|ГДЕ
	|	ВТ_КэшВидовПакетов.ПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Ссылка КАК ВидПакета,
	|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Значение КАК ВидПакетаID,
	|	ВТ_КэшВидовПакетов.КатегорияПакета
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетовИзСправочника
	|ИЗ
	|	Справочник.Диадок_ДополнительныеСправочники.ДополнительныеРеквизиты КАК Диадок_ДополнительныеСправочникиДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшВидовПакетов КАК ВТ_КэшВидовПакетов
	|		ПО Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Значение = ВТ_КэшВидовПакетов.ВидПакетаID
	|ГДЕ
	|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Ссылка.ИмяСправочника = ""ВидыПакетов""
	|	И Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.ИмяРеквизита = ""ID""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_НастройкиКонтрагентов.Организация,
	|	Диадок_НастройкиКонтрагентов.Контрагент
	|ПОМЕСТИТЬ ВТ_МоиКонтрагентыЭДО
	|ИЗ
	|	РегистрСведений.Диадок_НастройкиКонтрагентов КАК Диадок_НастройкиКонтрагентов
	|ГДЕ
	|	Диадок_НастройкиКонтрагентов.ИмяСвойства = ""Статус""
	|	И Диадок_НастройкиКонтрагентов.Значение = ""IsMyCounteragent""
	|	И Диадок_НастройкиКонтрагентов.Организация.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
	|	И Диадок_НастройкиКонтрагентов.Контрагент.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация КАК Организация,
	|	ВТ_МоиКонтрагенты.Контрагент КАК Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник1 КАК СвязанныйСправочник
	|ПОМЕСТИТЬ ВТ_СопоставленныеОрганизации
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Организация = Диадок_ЮрФизЛица.Ссылка
	|		И Диадок_ЮрФизЛица.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник2
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Организация = Диадок_ЮрФизЛица.Ссылка
	|		И Диадок_ЮрФизЛица.СвязанныйСправочник2 <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник3
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Организация = Диадок_ЮрФизЛица.Ссылка
	|		И Диадок_ЮрФизЛица.СвязанныйСправочник3 <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	ВЫРАЗИТЬ(Диадок_ЮрФизЛицаДополнительныеРеквизиты.Значение КАК Справочник.Организации)
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица.ДополнительныеРеквизиты КАК Диадок_ЮрФизЛицаДополнительныеРеквизиты
	|		ПО ВТ_МоиКонтрагенты.Организация = Диадок_ЮрФизЛицаДополнительныеРеквизиты.Ссылка
	|		И Диадок_ЮрФизЛицаДополнительныеРеквизиты.ИмяРеквизита ПОДОБНО &ШаблонИмениРеквизита_СвязанныйСправочник
	|		И Диадок_ЮрФизЛицаДополнительныеРеквизиты.Значение <> НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация КАК Организация,
	|	ВТ_МоиКонтрагенты.Контрагент КАК Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник1 КАК СвязанныйСправочник
	|ПОМЕСТИТЬ ВТ_СопоставленныеКонтрагенты
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Контрагент = Диадок_ЮрФизЛица.Ссылка
	|		И Диадок_ЮрФизЛица.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник2
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Контрагент = Диадок_ЮрФизЛица.Ссылка
	|		И Диадок_ЮрФизЛица.СвязанныйСправочник2 <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	Диадок_ЮрФизЛица.СвязанныйСправочник3
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	|		ПО ВТ_МоиКонтрагенты.Контрагент = Диадок_ЮрФизЛица.Ссылка
	|		И Диадок_ЮрФизЛица.СвязанныйСправочник3 <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент,
	|	ВЫРАЗИТЬ(Диадок_ЮрФизЛицаДополнительныеРеквизиты.Значение КАК Справочник.Контрагенты)
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица.ДополнительныеРеквизиты КАК Диадок_ЮрФизЛицаДополнительныеРеквизиты
	|		ПО ВТ_МоиКонтрагенты.Контрагент = Диадок_ЮрФизЛицаДополнительныеРеквизиты.Ссылка
	|		И Диадок_ЮрФизЛицаДополнительныеРеквизиты.ИмяРеквизита ПОДОБНО &ШаблонИмениРеквизита_СвязанныйСправочник
	|		И Диадок_ЮрФизЛицаДополнительныеРеквизиты.Значение <> НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СопоставленныеОрганизации.СвязанныйСправочник КАК Организация1С,
	|	ВТ_СопоставленныеКонтрагенты.СвязанныйСправочник КАК Контрагент1С,
	|	ВТ_МоиКонтрагенты.Организация,
	|	ВТ_МоиКонтрагенты.Контрагент
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентов
	|ИЗ
	|	ВТ_МоиКонтрагентыЭДО КАК ВТ_МоиКонтрагенты
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СопоставленныеОрганизации КАК ВТ_СопоставленныеОрганизации
	|	ПО (ВТ_МоиКонтрагенты.Организация = ВТ_СопоставленныеОрганизации.Организация
	|		И ВТ_МоиКонтрагенты.Контрагент = ВТ_СопоставленныеОрганизации.Контрагент)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СопоставленныеКонтрагенты КАК ВТ_СопоставленныеКонтрагенты
	|	ПО (ВТ_МоиКонтрагенты.Контрагент = ВТ_СопоставленныеКонтрагенты.Контрагент
	|		И ВТ_МоиКонтрагенты.Организация = ВТ_СопоставленныеКонтрагенты.Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшКонтрагентов.Организация1С КАК Организация1С,
	|	ВТ_КэшКонтрагентов.Контрагент1С КАК Контрагент1С,
	|	ВТ_КэшКонтрагентов.Организация,
	|	ВТ_КэшКонтрагентов.Контрагент,
	|	ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшВидовПакетовПоУмолчанию.ВидПакетаID КАК ПоУмолчаниюВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоКатегориям
	|ИЗ
	|	ВТ_КэшКонтрагентов КАК ВТ_КэшКонтрагентов,
	|	ВТ_КэшВидовПакетовПоУмолчанию КАК ВТ_КэшВидовПакетовПоУмолчанию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Диадок_ЮрФизЛица_ДопРеквизиты.Ссылка.СвязанныйСправочник1 КАК Организация1С,
	|	ВЫРАЗИТЬ(Диадок_ЮрФизЛица_ДопРеквизиты.Значение КАК БУЛЕВО) КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_КэшНастроекОтправкиНепроведенных
	|ИЗ
	|	Справочник.Диадок_ЮрФизЛица.ДополнительныеРеквизиты КАК Диадок_ЮрФизЛица_ДопРеквизиты
	|ГДЕ
	|	Диадок_ЮрФизЛица_ДопРеквизиты.Ссылка.ИмяСправочника = ""Организации""
	|	И Диадок_ЮрФизЛица_ДопРеквизиты.Ссылка.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
	|	И Диадок_ЮрФизЛица_ДопРеквизиты.ИмяРеквизита = ""ОтправлятьНепроведенныеДокументы""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_НастройкиКонтрагентов.Организация КАК Организация,
	|	Диадок_НастройкиКонтрагентов.Контрагент КАК Контрагент,
	|	Диадок_НастройкиКонтрагентов.ИмяСвойства КАК КатегорияПакета,
	|	Диадок_НастройкиКонтрагентов.Значение КАК ВидПакета,
	|	ЕСТЬNULL(ВТ_КэшВидовПакетовИзСправочника.ВидПакетаID, НЕОПРЕДЕЛЕНО) КАК ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов
	|ИЗ
	|	ВТ_КэшВидовПакетовПоУмолчанию КАК ВТ_КэшВидовПакетовПоУмолчанию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Диадок_НастройкиКонтрагентов КАК Диадок_НастройкиКонтрагентов
	|		ПО ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакета = Диадок_НастройкиКонтрагентов.ИмяСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшВидовПакетовИзСправочника КАК ВТ_КэшВидовПакетовИзСправочника
	|		ПО (Диадок_НастройкиКонтрагентов.Значение = ВТ_КэшВидовПакетовИзСправочника.ВидПакета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.Организация КАК Организация,
	|	ВТ_КэшНастроекВидовПакетов.Контрагент КАК Контрагент,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет1
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.Организация <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|	И ВТ_КэшНастроекВидовПакетов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.Контрагент КАК Контрагент,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет2
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.Организация = ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|	И ВТ_КэшНастроекВидовПакетов.Контрагент <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.Организация КАК Организация,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет3
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.Организация <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|	И ВТ_КэшНастроекВидовПакетов.Контрагент = ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшКонтрагентовПоКатегориям.Организация1С КАК Организация1С,
	|	ВТ_КэшКонтрагентовПоКатегориям.Контрагент1С КАК Контрагент1С,
	|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ВТ_КэшНастроекВидовПакетов_Приоритет1.ВидПакетаID, ВТ_КэшНастроекВидовПакетов_Приоритет2.ВидПакетаID), ВТ_КэшНастроекВидовПакетов_Приоритет3.ВидПакетаID), ВТ_КэшКонтрагентовПоКатегориям.ПоУмолчаниюВидПакетаID) КАК ВидПакетаID,
	|	ВТ_КэшКонтрагентовПоКатегориям.Организация,
	|	ВТ_КэшКонтрагентовПоКатегориям.Контрагент,
	|	ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета,
	|	ВТ_КэшКонтрагентовПоКатегориям.ПоУмолчаниюВидПакетаID,
	|	ЕСТЬNULL(ВТ_КэшНастроекОтправкиНепроведенных.ОтправлятьНепроведенные, ЛОЖЬ) КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоВидамПакетов
	|ИЗ
	|	ВТ_КэшКонтрагентовПоКатегориям КАК ВТ_КэшКонтрагентовПоКатегориям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет1 КАК ВТ_КэшНастроекВидовПакетов_Приоритет1
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация = ВТ_КэшНастроекВидовПакетов_Приоритет1.Организация
	|			И ВТ_КэшКонтрагентовПоКатегориям.Контрагент = ВТ_КэшНастроекВидовПакетов_Приоритет1.Контрагент
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет1.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет2 КАК ВТ_КэшНастроекВидовПакетов_Приоритет2
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Контрагент = ВТ_КэшНастроекВидовПакетов_Приоритет2.Контрагент
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет2.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет3 КАК ВТ_КэшНастроекВидовПакетов_Приоритет3
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация = ВТ_КэшНастроекВидовПакетов_Приоритет3.Организация
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет3.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекОтправкиНепроведенных КАК ВТ_КэшНастроекОтправкиНепроведенных
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация1С = ВТ_КэшНастроекОтправкиНепроведенных.Организация1С
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Диадок_ПакетыДокументов.Ссылка,
	|	Диадок_ПакетыДокументов.Документ КАК Документ,
	|	Диадок_ПакетыДокументов.ВидПакета КАК ВидПакета,
	|	ВТ_КэшВидовПакетов.ВидПакетаID КАК ВидПакетаID,
	|	ВТ_КэшВидовПакетов.КатегорияПакета КАК КатегорияПакета
	|ПОМЕСТИТЬ ВТ_ОтправленныеДокументы
	|ИЗ
	|	Справочник.Диадок_ПакетыДокументов КАК Диадок_ПакетыДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшВидовПакетовИзСправочника КАК ВТ_КэшВидовПакетов
	|		ПО Диадок_ПакетыДокументов.ВидПакета = ВТ_КэшВидовПакетов.ВидПакета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	КатегорияПакета,
	|	ВидПакета";
	
	Возврат Результат;
			
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку_1С()
	
	Результат = 
	"ВЫБРАТЬ
	|	ВидыПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВидыПакетов.КатегорияПакетаСсылка КАК КатегорияПакетаСсылка,
	|	ВидыПакетов.ID КАК ВидПакетаID,
	|	ВидыПакетов.ПоУмолчанию КАК ПоУмолчанию
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетов
	|ИЗ
	|	&ТаблицаВидовПакетов КАК ВидыПакетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшВидовПакетов.КатегорияПакета,
	|	ВТ_КэшВидовПакетов.КатегорияПакетаСсылка,
	|	ВТ_КэшВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшВидовПакетовПоУмолчанию
	|ИЗ
	|	ВТ_КэшВидовПакетов КАК ВТ_КэшВидовПакетов
	|ГДЕ
	|	ВТ_КэшВидовПакетов.ПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКонтрагентов.Организация1С КАК Организация1С,
	|	ТаблицаКонтрагентов.Контрагент1С КАК Контрагент1С
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентов
	|ИЗ
	|	&ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшКонтрагентов.Организация1С КАК Организация1С,
	|	ВТ_КэшКонтрагентов.Контрагент1С КАК Контрагент1С,
	|	ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшВидовПакетовПоУмолчанию.ВидПакетаID КАК ПоУмолчаниюВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоКатегориям
	|ИЗ
	|	ВТ_КэшКонтрагентов КАК ВТ_КэшКонтрагентов,
	|	ВТ_КэшВидовПакетовПоУмолчанию КАК ВТ_КэшВидовПакетовПоУмолчанию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Организация1С,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияСвойствОбъектов.Значение) = ТИП(СТРОКА)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗначенияСвойствОбъектов.Значение = ""Да""
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК БУЛЕВО)
	|	КОНЕЦ КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_КэшНастроекОтправкиНепроведенных
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ЗначенияСвойствОбъектов.Объект) = ТИП(Справочник.Организации)
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство_ОтправлятьНепроведенныеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК ЮрЛицо,
	|	ЗначенияСвойствОбъектов.Значение КАК ВидПакетаID,
	|	ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакета КАК КатегорияПакета
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов
	|ИЗ
	|	ВТ_КэшВидовПакетовПоУмолчанию КАК ВТ_КэшВидовПакетовПоУмолчанию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ВТ_КэшВидовПакетовПоУмолчанию.КатегорияПакетаСсылка = ЗначенияСвойствОбъектов.Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.ЮрЛицо КАК Контрагент1С,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет1
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.ЮрЛицо ССЫЛКА Справочник.Контрагенты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент1С,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшНастроекВидовПакетов.ЮрЛицо КАК Организация1С,
	|	ВТ_КэшНастроекВидовПакетов.КатегорияПакета КАК КатегорияПакета,
	|	ВТ_КэшНастроекВидовПакетов.ВидПакетаID
	|ПОМЕСТИТЬ ВТ_КэшНастроекВидовПакетов_Приоритет2
	|ИЗ
	|	ВТ_КэшНастроекВидовПакетов КАК ВТ_КэшНастроекВидовПакетов
	|ГДЕ
	|	ВТ_КэшНастроекВидовПакетов.ЮрЛицо ССЫЛКА Справочник.Организации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	КатегорияПакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КэшКонтрагентовПоКатегориям.Организация1С КАК Организация1С,
	|	ВТ_КэшКонтрагентовПоКатегориям.Контрагент1С КАК Контрагент1С,
	|	ЕСТЬNULL(ЕСТЬNULL(ВТ_КэшНастроекВидовПакетов_Приоритет1.ВидПакетаID, ВТ_КэшНастроекВидовПакетов_Приоритет2.ВидПакетаID), ВТ_КэшКонтрагентовПоКатегориям.ПоУмолчаниюВидПакетаID) КАК ВидПакетаID,
	|	ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета,
	|	ВТ_КэшКонтрагентовПоКатегориям.ПоУмолчаниюВидПакетаID,
	|	ЕСТЬNULL(ВТ_КэшНастроекОтправкиНепроведенных.ОтправлятьНепроведенные, ЛОЖЬ) КАК ОтправлятьНепроведенные
	|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоВидамПакетов
	|ИЗ
	|	ВТ_КэшКонтрагентовПоКатегориям КАК ВТ_КэшКонтрагентовПоКатегориям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет1 КАК ВТ_КэшНастроекВидовПакетов_Приоритет1
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Контрагент1С = ВТ_КэшНастроекВидовПакетов_Приоритет1.Контрагент1С
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет1.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовПакетов_Приоритет2 КАК ВТ_КэшНастроекВидовПакетов_Приоритет2
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация1С = ВТ_КэшНастроекВидовПакетов_Приоритет2.Организация1С
	|			И ВТ_КэшКонтрагентовПоКатегориям.КатегорияПакета = ВТ_КэшНастроекВидовПакетов_Приоритет2.КатегорияПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекОтправкиНепроведенных КАК ВТ_КэшНастроекОтправкиНепроведенных
	|		ПО ВТ_КэшКонтрагентовПоКатегориям.Организация1С = ВТ_КэшНастроекОтправкиНепроведенных.Организация1С
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация1С,
	|	Контрагент1С
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Документ
	|ПОМЕСТИТЬ ВТ_ОтправленныеДокументы
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство В(&СвойстваИдентификаторовДокументов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ";
	
	Возврат Результат;
			
КонецФункции

Функция ТекстЗапроса_ВТДокументыБезНДС()
	
	Результат = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.Исправление
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.Исправление
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодходящиеДокументы.Документ,
	|	ВТ_ПодходящиеДокументы.Исправление,
	|	ВТ_ПодходящиеДокументы.Документ.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Документ.Номер КАК НомерДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Документ.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Документ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_ПодходящиеДокументы.Документ = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL"; 
	
	Возврат Результат;
			
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса, НужнаВТДокументыБезНДС)

	Если НужнаВТДокументыБезНДС Тогда
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ВТДокументыБезНДС();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	Запросы = Новый Массив;
	 
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АктОбОказанииПроизводственныхУслуг", "Услуги");

	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Товары");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Услуги");
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияУслугПоПереработке", "Продукция");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияУслугПоПереработке", "Услуги");
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ВозвратТоваровПоставщику", "Товары");
	
	УсловиеКорректировки = " И ТабличнаяЧасть.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)";
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", УсловиеКорректировки, "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Услуги", УсловиеКорректировки, "Истина");
	
	Результат = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие = "", Исправление = "Ложь")
	
	ТЧ	= "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;

	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК Исправление
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|ГДЕ
	|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
                
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
			
КонецПроцедуры

Функция ДанныеВременнойТаблицыДляСпискаПакетовНаОтправку(ИмяВременнойТаблицы, ПараметрыЗапроса)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
	Запрос.Текст = ТекстЗапроса + "; ВЫБРАТЬ * ИЗ " + ИмяВременнойТаблицы; 
	
	Для Каждого Элемент Из ПараметрыЗапроса Цикл
		Запрос.Параметры.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ФункцияДокументаДляXML(TypeNamedId, FunctionName)

	Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
		Результат = "СЧФ";
	ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
		Результат = "ДОП";
	ИначеЕсли TypeNamedId = "InvoiceCorrection" ИЛИ TypeNamedId = "InvoiceCorrectionRevision" Тогда
		Результат = "КСЧФ";
	Иначе
		Результат = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(Документ,	ВнешняяПечатнаяФорма, ИдентификаторКомандыПечатнойФормы=Неопределено, ДопПараметры=Неопределено)
	
	ИсточникМакета = Новый Структура("СсылкаНаВнешнююОбработку, НомерСтроки", ВнешняяПечатнаяФорма, 1);	
	ТабличныйДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Документ, ИсточникМакета);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();	
	ИмяФайла = ВнешняяПечатнаяФорма.Наименование + " № " + Документ.Номер + " от " + Формат(Документ.Дата,"ДФ=dd.MM.yyyy") + ".pdf";
	
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
	Возврат Новый Структура("ИмяВременногоФайла, ИмяФайла", ИмяВременногоФайла, ИмяФайла);
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначенийСКолонками(Колонки, ОписаниеТипов = Неопределено)

	Результат = Новый ТаблицаЗначений;
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, Колонки, ОписаниеТипов);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТЗ(Таблица, Значение0 = Неопределено, 
									Значение1 = Неопределено, 
									Значение2 = Неопределено, 
									Значение3 = Неопределено, 
									Значение4 = Неопределено,
									Значение5 = Неопределено)
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

Процедура ДобавитьЗначениеВСписок(Список, Значение, Представление)
	
	Если Список.НайтиПоЗначению(Значение) = Неопределено Тогда
		Список.Добавить(Значение, Представление);
	КонецЕсли;
	
КонецПроцедуры

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

РежимУправляемыхФорм = Ложь; // Определяет версию типового модуля: ОФ / УФ

