Перем ТиповойМодульДиадока;
Перем РежимУправляемыхФорм;
Перем ОсновнойМодуль Экспорт;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира


//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Obrabotat'Sobytiye.html

	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);

		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);
		
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
				
	ИначеЕсли ИмяСобытия = "ОпределитьТипЗначенияОбъекта" Тогда
		
		Возврат ОпределитьТипЗначенияОбъекта(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхПакетов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "СопоставитьНоменклатуруПоставщика" Тогда
		
		Возврат СопоставитьНоменклатуруПоставщика(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
	
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПриОткрытииФормы" Тогда
		
		Возврат ПриОткрытииФормы(Параметры);

	ИначеЕсли ИмяСобытия = "ПриПолученииДанныхТабличнойЧасти" Тогда
		
		Возврат ПриПолученииДанныхТабличнойЧасти(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов пакетов
Функция ПолучитьТаблицуИспользуемыхПакетов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'TablitsuIspol'zuyemykhPaketov.html
	//ВызватьИсключение("");
	ТЗ  = Новый ТаблицаЗначений;
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(ТЗ, "ID, Наименование, УПД, Шаблон");
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_ОсновнойПакет",	"СФ");
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_КСФ",			"КСФ");
		
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УПД",			"УПД", Истина);
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УКД",			"УКД");
	
	//ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_СчетФормализованный", "Счет (формализованный)");
	
	Возврат ТЗ;
	
КонецФункции

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)                                                                                             
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'TablitsuIspol'zuyemykhVidovDokumentov.html

	ТЗ  = Новый ТаблицаЗначений;
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(ТЗ, "ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI");
	
	// 820@	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_СчетФактура",			"СФ", 				"Invoice", 							"utd820");
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_КСФ",					"КСФ", 				"InvoiceCorrection", 				"ucd736");
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УПД", 					"УПД", 				"UniversalTransferDocument", 		"utd820",	"СЧФДОП");		
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(ТЗ, "ID_УКД",					"УКД", 				"UniversalCorrectionDocument", 		"ucd736",	"КСЧФДИС");

	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html

	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ВидПакетаРазвернутый = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		Если НЕ ВидПакетаРазвернутый.Свойство("ID") Тогда
			Сообщить("Отсутствует ID для пакета: " + ВидПакетаРазвернутый.Наименование);
			Продолжить;
		КонецЕсли;
		
		Если ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) +
			
			"ВЫБРАТЬ
			|	СчетФактураВыданный.Ссылка КАК Документ,
			|	СчетФактураВыданный.Номер КАК НомерДокумента,
			|	СчетФактураВыданный.Дата КАК ДатаДокумента,
			|	СчетФактураВыданный.Контрагент КАК Контрагент,
			|	СчетФактураВыданный.Организация КАК Организация,
			|	СчетФактураВыданный.СуммаДокумента КАК СуммаДокумента,
			|	""ID_ОсновнойПакет"" КАК ВидПакетаID
			|ИЗ
			|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамУПД КАК ВТ_КэшКонтрагентовПоВидамУПД
			|		ПО СчетФактураВыданный.Организация = ВТ_КэшКонтрагентовПоВидамУПД.Организация1С
			|			И СчетФактураВыданный.Контрагент = ВТ_КэшКонтрагентовПоВидамУПД.Контрагент1С
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
			|		ПО СчетФактураВыданный.Ссылка = ОтправленныеДокументы.Документ
			|			И (ОтправленныеДокументы.ВидПакета = &ВидПакетаID_ID_ОсновнойПакет)
			|ГДЕ
			|	ОтправленныеДокументы.Ссылка ЕСТЬ NULL
			|	И СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И СчетФактураВыданный.Проведен
			|	И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
			|	И СчетФактураВыданный.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
			|	И НЕ СчетФактураВыданный.Исправление";
			//|	И &МеткаОсновногоПакета
							
		ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) +
			
			"ВЫБРАТЬ
			|	СчетФактураВыданный.Ссылка КАК Документ,
			|	СчетФактураВыданный.Номер КАК НомерДокумента,
			|	СчетФактураВыданный.Дата КАК ДатаДокумента,
			|	СчетФактураВыданный.Контрагент КАК Контрагент,
			|	СчетФактураВыданный.Организация КАК Организация,
			|	СчетФактураВыданный.СуммаДокумента КАК СуммаДокумента,
			|	""ID_УПД"" КАК ВидПакетаID
			|ИЗ
			|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамУПД КАК ВТ_КэшКонтрагентовПоВидамУПД
			|		ПО СчетФактураВыданный.Организация = ВТ_КэшКонтрагентовПоВидамУПД.Организация1С
			|			И СчетФактураВыданный.Контрагент = ВТ_КэшКонтрагентовПоВидамУПД.Контрагент1С
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
			|		ПО СчетФактураВыданный.Ссылка = ОтправленныеДокументы.Документ
			|			И (ОтправленныеДокументы.ВидПакета = &ВидПакетаID_ID_УПД)
			|ГДЕ
			|	ОтправленныеДокументы.Ссылка ЕСТЬ NULL
			|	И СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И СчетФактураВыданный.Проведен
			|	И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
			|	И СчетФактураВыданный.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
			|	И НЕ СчетФактураВыданный.Исправление
			|	И ВТ_КэшКонтрагентовПоВидамУПД.ОсновнойПакет = &ВидПакетаID_ID_УПД";
										
        ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) +
			
			"ВЫБРАТЬ
			|	СчетФактураВыданный.Ссылка КАК Документ,
			|	СчетФактураВыданный.Номер КАК НомерДокумента,
			|	СчетФактураВыданный.Дата КАК ДатаДокумента,
			|	СчетФактураВыданный.Контрагент КАК Контрагент,
			|	СчетФактураВыданный.Организация КАК Организация,
			|	СчетФактураВыданный.СуммаДокумента КАК СуммаДокумента,
			|	""ID_УКД"" КАК ВидПакетаID
			|ИЗ
			|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамУПД КАК ВТ_КэшКонтрагентовПоВидамУПД
			|		ПО СчетФактураВыданный.Организация = ВТ_КэшКонтрагентовПоВидамУПД.Организация1С
			|			И СчетФактураВыданный.Контрагент = ВТ_КэшКонтрагентовПоВидамУПД.Контрагент1С
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
			|		ПО СчетФактураВыданный.Ссылка = ОтправленныеДокументы.Документ
			|			И (ОтправленныеДокументы.ВидПакета = &ВидПакетаID_ID_УКД)
			|ГДЕ
			|	ОтправленныеДокументы.Ссылка ЕСТЬ NULL
			|	И СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И СчетФактураВыданный.Проведен
			|	И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
			|	И СчетФактураВыданный.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)";
			
		 ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) +
			
			"ВЫБРАТЬ
			|	СчетФактураВыданный.Ссылка КАК Документ,
			|	СчетФактураВыданный.Номер КАК НомерДокумента,
			|	СчетФактураВыданный.Дата КАК ДатаДокумента,
			|	СчетФактураВыданный.Контрагент КАК Контрагент,
			|	СчетФактураВыданный.Организация КАК Организация,
			|	СчетФактураВыданный.СуммаДокумента КАК СуммаДокумента,
			|	""ID_КСФ"" КАК ВидПакетаID
			|ИЗ
			|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамУПД КАК ВТ_КэшКонтрагентовПоВидамУПД
			|		ПО СчетФактураВыданный.Организация = ВТ_КэшКонтрагентовПоВидамУПД.Организация1С
			|			И СчетФактураВыданный.Контрагент = ВТ_КэшКонтрагентовПоВидамУПД.Контрагент1С
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
			|		ПО СчетФактураВыданный.Ссылка = ОтправленныеДокументы.Документ
			|			И (ОтправленныеДокументы.ВидПакета = &ВидПакетаID_ID_КСФ)
			|ГДЕ
			|	ОтправленныеДокументы.Ссылка ЕСТЬ NULL
			|	И СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И СчетФактураВыданный.Проведен
			|	И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
			|	И СчетФактураВыданный.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)";

		КонецЕсли;
		
		Если ОсновнойМодуль.ИспользоватьПодсистемуДиадока() Тогда			
			
			Результат = СтрЗаменить(Результат, "ВТ_ОтправленныеДокументы", "Справочник.Диадок_ПакетыДокументов");
			
			Если ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда // является основным пакетом по умолчанию
				Результат = СтрЗаменить(Результат, "&МеткаОсновногоПакета", "ЕСТЬNULL(ВТ_КэшКонтрагентовПоВидамУПД.ОсновнойПакет, &ВидПакетаID_ID_ОсновнойПакет) = &ВидПакетаID_ID_ОсновнойПакет");
			КонецЕсли;
			
		Иначе
			
			Если ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда // является основным пакетом по умолчанию
				Результат = СтрЗаменить(Результат, "&МеткаОсновногоПакета", "ВЫБОР КОГДА ВТ_КэшКонтрагентовПоВидамУПД.ОсновнойПакет = """" ИЛИ ВТ_КэшКонтрагентовПоВидамУПД.ОсновнойПакет = &ВидПакетаID_ID_ОсновнойПакет ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		
		Результат = ПолучитьТекстЗапросаВременныхТаблицДляСпискаПакетовНаОтправку() + "
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|" + Результат + "
					|УПОРЯДОЧИТЬ ПО
					|	ДатаДокумента, НомерДокумента";
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Podgotovit'Paket.html

	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, СтрокаСписка.Документ, "ID_УПД");
				
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, СтрокаСписка.Документ, "ID_УКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, СтрокаСписка.Документ, "ID_КСФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, СтрокаСписка.Документ, "ID_СчетФактура");
				
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Podgotovit'ElektronnyyDokument.html

	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника		= Параметры.ДанныеСотрудника;
	
	Документ1С					= Результат.Документ1С;
	ДокументыОснования			= Результат.ДокументыОснования;
	ВидДокументаНаименование	= ВидДокументаРазвернутый.Наименование;
	
	ID							= ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO			= ВидДокументаРазвернутый.ТипКонтента;	
	TypeNamedId					= ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion				= ВидДокументаРазвернутый.FormatVersion;
	FunctionName				= ВидДокументаРазвернутый.FunctionName;
	
	Если ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("UtdSellerContent")
		ИЛИ ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("Utd820SellerContent")
		ИЛИ ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("UcdSellerContent") Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
			ФункцияУПД = "СЧФ";
		ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
			ФункцияУПД = "ДОП";
		Иначе
			ФункцияУПД = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД", Ложь); // Истина, чтобы отключить проверку заполнения даты основания
		ДополнительныеПараметры.Вставить("ПараметрыСогласования", Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника", ДанныеСотрудника); // Графа 10 (РабОргПрод)
		ДополнительныеПараметры.Вставить("ФИОПодписанта", " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД", ФункцияУПД);
		
		ТиповойМодуль = ТиповойМодульДиадока();
		
		Если ID = "ID_КСФ" Тогда
			Заполнить_UcdSellerContent(Результат.Content, Документ1С, ВидДокументаНаименование);
		Иначе
			Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(ТиповойМодуль, РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
			
			Если ВРЕГ(ТипКонтента_XDTO) = ВРЕГ("UcdSellerContent") Тогда
				
			Иначе
				Content.DocumentShipments[0].Number = "п/п 1-" + Content.Table.Items.Количество()+ "№" + Content.DocumentNumber;
				
				Если Документ1С.Контрагент.ИНН = "5027213485" Тогда  
				
					Content.TransferInfo.TransferBases[0].DocumentName   = Документ1С.ДокументОснование.ДоговорКонтрагента.Наименование; 
					Content.TransferInfo.TransferBases[0].DocumentNumber = Документ1С.ДокументОснование.ДоговорКонтрагента.Номер; 		
					Content.TransferInfo.TransferBases[0].DocumentDate   = Формат(Документ1С.ДокументОснование.ДоговорКонтрагента.Дата, "ДЛФ=Д");
					Content.TransferInfo.TransferBases[0].DocumentInfo   = "";
							   		
				КонецЕсли;
			КонецЕсли;
			
			ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/PoslePodgotovkiPaketa.html

	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета	= Параметры.Документ.ДокументУчета;
	Реквизиты		= Параметры.Документ.Реквизиты;
	
	РеквизитыДокументаУчета = Новый Структура("Номер, Дата, СуммаДокумента");
	
	ЗаполнитьЗначенияСвойств(РеквизитыДокументаУчета, ДокументУчета);
	
	Реквизиты.Номер	= РеквизитыДокументаУчета.Номер;
	Реквизиты.Дата	= РеквизитыДокументаУчета.Дата;
	Реквизиты.Сумма	= РеквизитыДокументаУчета.СуммаДокумента;
	
	Возврат Истина;
	
КонецФункции


//Сбор документа//////////////////////////////

//utd820

Процедура Заполнить_UtdSellerContent(Контент, Документ1С, ФункцияУПД) 
	
	Если ФункцияУПД = "СЧФДОП" Тогда
		УстановитьЗначениеXDTO(Контент, "Function",	"InvoiceAndBasic");
	    ДокОсн = Документ1С.ДокументОснование;
	ИначеЕсли ФункцияУПД = "СЧФ" Тогда
		УстановитьЗначениеXDTO(Контент, "Function",	"Invoice");
		ДокОсн = Документ1С.ДокументОснование;
	Иначе
		УстановитьЗначениеXDTO(Контент, "Function",	"Basic");
		ДокОсн = Документ1С;
	КонецЕсли;

	УстановитьЗначениеXDTO(Контент, "DocumentDate",      		Документ1С.Дата); 
	УстановитьЗначениеXDTO(Контент, "DocumentNumber",     		СокрЛП(Документ1С.Номер));
	УстановитьЗначениеXDTO(Контент, "Currency",     			ДокОсн.ВалютаДокумента.Код);
//	УстановитьЗначениеXDTO(Контент, "CurrencyRate",				Документ1С.КурсВалюты);
	УстановитьЗначениеXDTO(Контент, "DocumentCreator",			ДокОсн.Организация.НаименованиеПолное);
	УстановитьЗначениеXDTO(Контент, "GovermentContractInfo",	Неопределено);

	
	НовЭлемент = НовыйЭлементСпискаXDTO(Контент.Sellers);
	Заполнить_ExtendedOrganizationInfo	(НовЭлемент, 	ДокОсн.Организация, 	Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Продавец");
	
	НовЭлемент = НовыйЭлементСпискаXDTO(Контент.Buyers);
	Заполнить_ExtendedOrganizationInfo	(НовЭлемент, 	ДокОсн.Контрагент, 		Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, "Покупатель");
	
	НовЭлемент = НовыйЭлементСпискаXDTO(Контент.Shippers);
	Заполнить_Shipper(НовЭлемент, 	ДокОсн.Организация, ДокОсн.Грузоотправитель, "Грузоотправитель");
	
	Если ЗначениеЗаполнено(ДокОсн.Грузополучатель) Тогда
		НовЭлемент = НовыйЭлементСпискаXDTO(Контент.Consignees);
		Заполнить_ExtendedOrganizationInfo	(НовЭлемент, ДокОсн.Грузополучатель, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, "Грузополучатель");
	КонецЕсли;	
		
	Заполнить_InvoiceTable			(Контент.Table,				ДокОсн, ФункцияУПД);
	Заполнить_TransferInfo			(Контент.TransferInfo,  	ДокОсн);
	//Заполнить_AdditionalInfoId  	(Контент.AdditionalInfoId, 	ДокОсн);
	
	Для Сч = 1 По 0 Цикл
		НовЭлемент = НовыйЭлементСпискаXDTO(Контент.PaymentDocuments);
		Заполнить_PaymentDocumentInfo(НовЭлемент, Неопределено);
	КонецЦикла;
 
КонецПроцедуры

Процедура Заполнить_ExtendedOrganizationInfo(Контент, Организация, ВидАдреса, Признак) 
	// Документация: http://1c-docs.diadoc.ru/ru/latest/ExtendedOrganizationInfo.html
	
	УстановитьЗначениеXDTO(Контент, "BoxId",    			Неопределено);
	УстановитьЗначениеXDTO(Контент, "Name",					СокрЛП(Организация.НаименованиеПолное));
	УстановитьЗначениеXDTO(Контент, "Inn",      			Сокрлп(Организация.ИНН));
	УстановитьЗначениеXDTO(Контент, "FnsParticipantId",  	Неопределено);
	Если СтрДлина(Контент.Inn) = 10 Тогда
		УстановитьЗначениеXDTO(Контент, "Type",      "LegalEntity");
		УстановитьЗначениеXDTO(Контент, "Kpp",       Организация.КПП);
	Иначе  
		УстановитьЗначениеXDTO(Контент, "Type",      "IndividualEntity");
		УстановитьЗначениеXDTO(Контент, "Kpp",       Неопределено);
	КонецЕсли;
	УстановитьЗначениеXDTO(Контент, "Okopf",     Неопределено);
	УстановитьЗначениеXDTO(Контент, "Okpo",      Неопределено);
	УстановитьЗначениеXDTO(Контент, "Okpd",      Неопределено);
	УстановитьЗначениеXDTO(Контент, "Phone",     Неопределено);
	УстановитьЗначениеXDTO(Контент, "Email",     Неопределено);
		
	Попытка		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА БанковскиеСчетаКонтрагентов.Банк.КоррСчет <> """"
		|			ТОГДА БанковскиеСчетаКонтрагентов.Банк.КоррСчет
		|		ИНАЧЕ БанковскиеСчетаКонтрагентов.КоррСчетБанка
		|	КОНЕЦ КАК БанкКоррСчет,
		|	ВЫБОР
		|		КОГДА БанковскиеСчетаКонтрагентов.Банк.Наименование <> """"
		|			ТОГДА БанковскиеСчетаКонтрагентов.Банк.Наименование
		|		ИНАЧЕ БанковскиеСчетаКонтрагентов.НаименованиеБанка
		|	КОНЕЦ КАК БанкНаименование,
		|	ВЫБОР
		|		КОГДА БанковскиеСчетаКонтрагентов.Банк.Код <> """"
		|			ТОГДА БанковскиеСчетаКонтрагентов.Банк.Код
		|		ИНАЧЕ БанковскиеСчетаКонтрагентов.БИКБанка
		|	КОНЕЦ КАК БанкКод,
		|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
		|ГДЕ
		|	БанковскиеСчетаКонтрагентов.Владелец = &Владелец
		|	И БанковскиеСчетаКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА БанковскиеСчетаОрганизаций.Банк.КоррСчет <> """"
		|			ТОГДА БанковскиеСчетаОрганизаций.Банк.КоррСчет
		|		ИНАЧЕ БанковскиеСчетаОрганизаций.КоррСчетБанка
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БанковскиеСчетаОрганизаций.Банк.Наименование <> """"
		|			ТОГДА БанковскиеСчетаОрганизаций.Банк.Наименование
		|		ИНАЧЕ БанковскиеСчетаОрганизаций.НаименованиеБанка
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БанковскиеСчетаОрганизаций.Банк.Код <> """"
		|			ТОГДА БанковскиеСчетаОрганизаций.Банк.Код
		|		ИНАЧЕ БанковскиеСчетаОрганизаций.БИКБанка
		|	КОНЕЦ,
		|	БанковскиеСчетаОрганизаций.НомерСчета
		|ИЗ
		|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		|ГДЕ
		|	БанковскиеСчетаОрганизаций.Владелец = &Владелец
		|	И БанковскиеСчетаОрганизаций.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Владелец", Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			УстановитьЗначениеXDTO(Контент, "CorrespondentAccount",		СокрЛП(ВыборкаДетальныеЗаписи.БанкКоррСчет));
			УстановитьЗначениеXDTO(Контент, "BankAccountNumber",		СокрЛП(ВыборкаДетальныеЗаписи.НомерСчета));
			УстановитьЗначениеXDTO(Контент, "BankName",					СокрЛП(ВыборкаДетальныеЗаписи.БанкНаименование));
			УстановитьЗначениеXDTO(Контент, "BankId",					СокрЛП(ВыборкаДетальныеЗаписи.БанкКод));
		КонецЕсли;		
	Исключение		
		УстановитьЗначениеXDTO(Контент, "CorrespondentAccount",		СокрЛП(Организация.ОсновнойБанковскийСчет.Банк.КоррСчет));
		УстановитьЗначениеXDTO(Контент, "BankAccountNumber",		СокрЛП(Организация.ОсновнойБанковскийСчет.НомерСчета));
		УстановитьЗначениеXDTO(Контент, "BankName",					СокрЛП(Организация.ОсновнойБанковскийСчет.Банк.Наименование));
		УстановитьЗначениеXDTO(Контент, "BankId",					СокрЛП(Организация.ОсновнойБанковскийСчет.Банк.Код));		
	КонецПопытки;
		
	УстановитьЗначениеXDTO(Контент, "Department",    							Неопределено);
	УстановитьЗначениеXDTO(Контент, "AdditionalInfo",   						Неопределено);
	УстановитьЗначениеXDTO(Контент, "OrganizationOrPersonInfo", 				Неопределено);
	УстановитьЗначениеXDTO(Контент, "IndividualEntityRegistrationCertificate",	Неопределено);
	УстановитьЗначениеXDTO(Контент, "Ссылка",     								Организация, Истина);
	
	Заполнить_AddressInfo(Контент.Address, Организация,	ВидАдреса);
	
КонецПроцедуры  

Процедура Заполнить_Shipper(Контент, Продавец, Грузоотправитель, Признак) 
	// Документация: http://1c-docs.diadoc.ru/ru/latest/Shipper.html
	
	Если Грузоотправитель = Продавец ИЛИ НЕ ЗначениеЗаполнено(Грузоотправитель)  Тогда		
		УстановитьЗначениеXDTO(Контент, "SameAsSeller",    Истина);		
	Иначе		
		УстановитьЗначениеXDTO(Контент, "SameAsSeller",    Ложь);
		Заполнить_ExtendedOrganizationInfo(Контент.OrganizationInfo, Грузоотправитель, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, Признак);		
	КонецЕсли;
	
КонецПроцедуры

Процедура Заполнить_AddressInfo(Контент, Организация, ВидАдреса)  
		
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(1000)) КАК Представление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка = &Организация
		|	И КонтрагентыКонтактнаяИнформация.Вид = &ВидАдреса
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ОрганизацииКонтактнаяИнформация.Представление КАК СТРОКА(1000)) КАК Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Организация
		|	И ОрганизацииКонтактнаяИнформация.Вид = &ВидАдреса";			
		
		Запрос.УстановитьПараметр("ВидАдреса",		ВидАдреса);
		Запрос.УстановитьПараметр("Организация",	Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда		
			УстановитьЗначениеXDTO(Контент, "AddressText",				ВыборкаДетальныеЗаписи.Представление);
			УстановитьЗначениеXDTO(Контент, "IsForeign",			   	Истина);
			УстановитьЗначениеXDTO(Контент, "CountryCode",			   	643);
		КонецЕсли;
		
	Исключение
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(1000)) КАК Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Организация
		|	И КонтактнаяИнформация.Вид = &ВидАдреса";			
		
		Запрос.УстановитьПараметр("ВидАдреса",		ВидАдреса);
		Запрос.УстановитьПараметр("Организация",	Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда		
			УстановитьЗначениеXDTO(Контент, "AddressText",				ВыборкаДетальныеЗаписи.Представление);
			УстановитьЗначениеXDTO(Контент, "IsForeign",			   	Истина);
			УстановитьЗначениеXDTO(Контент, "CountryCode",			   	643);
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура Заполнить_InvoiceTable(Контент, ДокОсн, ФункцияДокумента)
	
	Для каждого Услуга из ДокОсн.Услуги Цикл 
		
		СтрокаТЧ = Новый Структура;
		
		СтрокаТЧ.Вставить("Артикул", 			СокрЛП(Услуга.Номенклатура.Артикул));
		СтрокаТЧ.Вставить("Наименование", 		СокрЛП(Услуга.Номенклатура.НаименованиеПолное));
		Попытка
			СтрокаТЧ.Вставить("ЕдиницаИзмерения", 	Услуга.Номенклатура.ЕдиницаИзмерения);
		Исключение
			СтрокаТЧ.Вставить("ЕдиницаИзмерения", 	Услуга.Номенклатура.БазоваяЕдиницаИзмерения);
		КонецПопытки;
		СтрокаТЧ.Вставить("Количество", 		Услуга.Количество); //Если ФункцияДокумента = "СЧФДОП" ИЛИ  
		СтрокаТЧ.Вставить("Цена", 				Услуга.Цена);
		СтрокаТЧ.Вставить("НалоговаяСтавка", 	ПривестиСтавкуНДС(Услуга.СтавкаНДС));
		СтрокаТЧ.Вставить("СуммаНалога", 		Услуга.СуммаНДС);
		Если ДокОсн.СуммаВключаетНДС Тогда
			СтрокаТЧ.Вставить("СуммаБезНалога", 	Услуга.Сумма - Услуга.СуммаНДС);
			СтрокаТЧ.Вставить("СуммаСНалогом", 		Услуга.Сумма);
		Иначе
			СтрокаТЧ.Вставить("СуммаБезНалога", 	Услуга.Сумма);
			СтрокаТЧ.Вставить("СуммаСНалогом", 		Услуга.Сумма + Услуга.СуммаНДС);
		КонецЕсли;
		Если Услуга.Номенклатура.Услуга Тогда
			СтрокаТЧ.Вставить("ТоварУслуга", 		"Service");
		Иначе
			СтрокаТЧ.Вставить("ТоварУслуга", 		"Property");
		КонецЕсли;
		
		НовЭлемент = НовыйЭлементСпискаXDTO(Контент.Items);
		Заполнить_Item(НовЭлемент, СтрокаТЧ, ФункцияДокумента);
	
	КонецЦикла;
	
	Для каждого Товар из ДокОсн.Товары Цикл 
		
		СтрокаТЧ = Новый Структура;
		
		СтрокаТЧ.Вставить("Артикул", 			СокрЛП(Товар.Номенклатура.Артикул));
		СтрокаТЧ.Вставить("Наименование", 		СокрЛП(Товар.Номенклатура.НаименованиеПолное));
		Попытка
			СтрокаТЧ.Вставить("ЕдиницаИзмерения", 	Товар.Номенклатура.ЕдиницаИзмерения);
		Исключение
			СтрокаТЧ.Вставить("ЕдиницаИзмерения", 	Товар.Номенклатура.БазоваяЕдиницаИзмерения);
		КонецПопытки;
		СтрокаТЧ.Вставить("Количество", 		Товар.Количество);
		СтрокаТЧ.Вставить("Цена", 				Товар.Цена);
		СтрокаТЧ.Вставить("НалоговаяСтавка", 	ПривестиСтавкуНДС(Товар.СтавкаНДС));
		СтрокаТЧ.Вставить("СуммаНалога", 		Товар.СуммаНДС);
		Если ДокОсн.СуммаВключаетНДС Тогда
			СтрокаТЧ.Вставить("СуммаБезНалога", 	Товар.Сумма - Товар.СуммаНДС);
			СтрокаТЧ.Вставить("СуммаСНалогом", 		Товар.Сумма);
		Иначе
			СтрокаТЧ.Вставить("СуммаБезНалога", 	Товар.Сумма);
			СтрокаТЧ.Вставить("СуммаСНалогом", 		Товар.Сумма + Товар.СуммаНДС);
		КонецЕсли;
		Если Товар.Номенклатура.Товар Тогда
			СтрокаТЧ.Вставить("Товар/Услуга", 		"Service");
		Иначе
			СтрокаТЧ.Вставить("Товар/Услуга", 		"Property");
		КонецЕсли;
		
		НовЭлемент = НовыйЭлементСпискаXDTO(Контент.Items);
		Заполнить_Item(НовЭлемент, СтрокаТЧ, ФункцияДокумента);
	
	КонецЦикла;
	
	TotalWithVatExcluded = 0;
	Vat = 0;
	Total = 0;
		
	Для каждого Стр из Контент.Items Цикл
		
		TotalWithVatExcluded = TotalWithVatExcluded + Стр.SubtotalWithVatExcluded;
		Vat = Vat + Стр.Vat;
		Total = Total + Стр.Subtotal;
		
	КонецЦикла;	
	
	УстановитьЗначениеXDTO(Контент, "TotalWithVatExcluded",		TotalWithVatExcluded);
	Если Vat = 0 И Контент.Items[0].TaxRate = "без НДС" Тогда
		УстановитьЗначениеXDTO(Контент, "Vat",						Неопределено);
	Иначе	
		УстановитьЗначениеXDTO(Контент, "Vat",						Vat);
	КонецЕсли;
	УстановитьЗначениеXDTO(Контент, "Total",					Total);
	УстановитьЗначениеXDTO(Контент, "TotalNet",					Неопределено);
	
КонецПроцедуры

Процедура Заполнить_Item(Контент, СтрокаТЧ, ФункцияДокумента)
			
	УстановитьЗначениеXDTO(Контент, "Product",					СтрокаТЧ.Наименование);
	УстановитьЗначениеXDTO(Контент, "Unit",						СокрЛП(СтрокаТЧ.ЕдиницаИзмерения.Код));
	УстановитьЗначениеXDTO(Контент, "UnitName",					СокрЛП(СтрокаТЧ.ЕдиницаИзмерения.Наименование));
	УстановитьЗначениеXDTO(Контент, "Quantity",					СтрокаТЧ.Количество);
	УстановитьЗначениеXDTO(Контент, "Price",					СтрокаТЧ.Цена);
	УстановитьЗначениеXDTO(Контент, "Excise",					Неопределено);
	УстановитьЗначениеXDTO(Контент, "TaxRate",					СтрокаТЧ.НалоговаяСтавка);
	УстановитьЗначениеXDTO(Контент, "ItemVendorCode",			СтрокаТЧ.Артикул);
	УстановитьЗначениеXDTO(Контент, "SubtotalWithVatExcluded",	СтрокаТЧ.СуммаБезНалога);
	УстановитьЗначениеXDTO(Контент, "Subtotal",					СтрокаТЧ.СуммаСНалогом);
	УстановитьЗначениеXDTO(Контент, "Vat",						СтрокаТЧ.СуммаНалога);
	УстановитьЗначениеXDTO(Контент, "ItemMark",					СтрокаТЧ.ТоварУслуга);
	УстановитьЗначениеXDTO(Контент, "WithoutVat",				Неопределено);
	
	//Для Сч = 1 По 0 Цикл	
	//	НовЭлемент = НовыйЭлементСпискаXDTO(Контент.CustomDeclarations);
	//	Заполнить_CustomDeclaration(НовЭлемент, "КодГТД", "КодСтраны");	
	//КонецЦикла;

	//Для Сч = 1 По 0 Цикл		
	//	НовЭлемент = НовыйЭлементСпискаXDTO(Контент.StructedAdditionalInfos);
	//	Заполнить_AdditionalInfoItem(НовЭлемент, Неопределено);
	//КонецЦикла;
	
КонецПроцедуры	

Процедура Заполнить_CustomDeclaration(Контент, CountryCode,DeclarationNumber)

	// Документация: http://1c-docs.diadoc.ru/ru/latest/CustomDeclaration.html

	УстановитьЗначениеXDTO(Контент, "CountryCode",				СокрЛП(CountryCode));
	УстановитьЗначениеXDTO(Контент, "DeclarationNumber",		СокрЛП(DeclarationNumber));


КонецПроцедуры

Процедура Заполнить_AdditionalInfoItem(Контент, Параметры)

	// Документация: http://1c-docs.diadoc.ru/ru/latest/AdditionalInfoItem.html

	УстановитьЗначениеXDTO(Контент, "Key",						Неопределено);
	УстановитьЗначениеXDTO(Контент, "Value",					Неопределено);


КонецПроцедуры

Процедура Заполнить_TransferInfo(Контент, ДокОсн)
	// Документация: http://1c-docs.diadoc.ru/ru/latest/TransferInfo.html

	УстановитьЗначениеXDTO(Контент, "OperationInfo",			"Товары переданы, работы сданы, услуги оказаны");
	УстановитьЗначениеXDTO(Контент, "OperationType",			Неопределено);
	УстановитьЗначениеXDTO(Контент, "TransferDate",				Неопределено);

	УстановитьЗначениеXDTO(Контент, "TransferTextInfo",			Неопределено);
	УстановитьЗначениеXDTO(Контент, "CreatedThingTransferDate",	Неопределено);
	УстановитьЗначениеXDTO(Контент, "CreatedThingInfo",			Неопределено);
	УстановитьЗначениеXDTO(Контент, "TransferStartDate",		Неопределено);
	УстановитьЗначениеXDTO(Контент, "TransferEndDate",			Неопределено);
	
	//Заполнить_AdditionalInfoId				(Контент.AdditionalInfoId, Неопределено);
	
		
	НовЭлемент = НовыйЭлементСпискаXDTO(Контент.TransferBases);
	Заполнить_TransferBase(НовЭлемент, ДокОсн);
		
	
КонецПроцедуры
		
Процедура Заполнить_TransferBase(Контент, ДокОсн)
	
	
	Если ДокОсн.Контрагент.ИНН = "5027213485" Тогда  
			УстановитьЗначениеXDTO(Контент, "DocumentName",				ДокОсн.ДоговорКонтрагента.Наименование);
			УстановитьЗначениеXDTO(Контент, "DocumentNumber",			НЕОПРЕДЕЛЕНО);
			УстановитьЗначениеXDTO(Контент, "DocumentDate",				ДокОсн.ДоговорКонтрагента.Дата);
			УстановитьЗначениеXDTO(Контент, "DocumentInfo",				"");
	Иначе		
		Если ЗначениеЗаполнено(ДокОсн.ДоговорКонтрагента.Дата) Тогда
			УстановитьЗначениеXDTO(Контент, "DocumentName",				"по договору");
			УстановитьЗначениеXDTO(Контент, "DocumentNumber",			СокрЛП(ДокОсн.ДоговорКонтрагента.Номер));
			УстановитьЗначениеXDTO(Контент, "DocumentDate",				ДокОсн.ДоговорКонтрагента.Дата);
			УстановитьЗначениеXDTO(Контент, "DocumentInfo",				"");
		Иначе
			УстановитьЗначениеXDTO(Контент, "DocumentName",				"Без документа-основания");
			УстановитьЗначениеXDTO(Контент, "DocumentNumber",			НЕОПРЕДЕЛЕНО);
			УстановитьЗначениеXDTO(Контент, "DocumentDate",				НЕОПРЕДЕЛЕНО);
			УстановитьЗначениеXDTO(Контент, "DocumentInfo",				"");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура Заполнить_AdditionalInfoId(Контент, ДокОсн);
	
	Если ЗначениеЗаполнено("Ключ") И ЗначениеЗаполнено("Значение") Тогда	
		 НовЭлемент = НовыйЭлементСпискаXDTO(Контент.StructedAdditionalInfos);
		 Заполнить_StructedAdditionalInfos(НовЭлемент, СокрЛП("Ключ"), СокрЛП("Значение"));
	КонецЕсли; 
 
КонецПроцедуры

Процедура Заполнить_StructedAdditionalInfos(Контент, Ключ, Значение) 
	
	// Документация: http://1c-docs.diadoc.ru/ru/latest/StructedAdditionalInfos.html 
	УстановитьЗначениеXDTO(Контент, "Key",		СокрЛП(Ключ));
	УстановитьЗначениеXDTO(Контент, "Value",   	СокрЛП(Значение));
КонецПроцедуры

Процедура Заполнить_PaymentDocumentInfo(Контент, Параметры)

	// Документация: http://1c-pro-docs.diadoc.ru/ru/latest/objects/PaymentDocumentInfo.html

	УстановитьЗначениеXDTO(Контент, "Date",						Неопределено);
	УстановитьЗначениеXDTO(Контент, "Number",					Неопределено);
	УстановитьЗначениеXDTO(Контент, "Total",					Неопределено);


КонецПроцедуры

Процедура УстановитьЗначениеXDTO(Элемент,ИмяРеквизита,ЗначениеРеквизита,ЭтоСсылка = Ложь)

	Если ЗначениеРеквизита=Неопределено
		Или ЗначениеРеквизита=NULL Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		//здесь можно добавить проверки на заполненность, вывод сообщений и т.д.
		
		Если ЭтоСсылка Тогда
			Элемент[ИмяРеквизита] = ЗначениеВСтрокуВнутр(ЗначениеРеквизита);
		Иначе	
			Элемент[ИмяРеквизита] = ЗначениеРеквизита;
		КонецЕсли;
		
		//Элемент.Установить(ИмяРеквизита,ЗначениеРеквизита);
		
	Исключение
		Сообщить("Исключение при заполнении реквизита """+ИмяРеквизита+""":
		|"+ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Функция ПривестиСтавкуНДС(СтавкаНДС)
	
	Если СтавкаНДС = перечисления.СтавкиНДС.НДС18 Тогда
		Возврат "18" 
	ИначеЕсли СтавкаНДС = перечисления.СтавкиНДС.НДС20 Тогда
		Возврат "20" 
	ИначеЕсли СтавкаНДС = перечисления.СтавкиНДС.НДС10 Тогда
		Возврат "10"
	ИначеЕсли 	СтавкаНДС = перечисления.СтавкиНДС.НДС0 Тогда 
		Возврат "0" 
	ИначеЕсли 	СтавкаНДС = перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат "18/118"
	ИначеЕсли 	СтавкаНДС = перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат "20/120"
	ИначеЕсли 	СтавкаНДС = перечисления.СтавкиНДС.БезНДС Тогда 
		Возврат "без НДС"
	Иначе  
		Возврат "Некорректная ставка НДС"
	КонецЕсли;
	
КонецФункции

Функция НовыйЭлементСпискаXDTO(СписокXDTO)
	
	Возврат СписокXDTO.Добавить(НовыйКонтент(СписокXDTO.ВладеющееСвойство.Тип.Имя));
	
КонецФункции

Функция НовыйКонтент(ИмяКонтента)
	//для отладки/разработки
	Возврат ОсновнойМодуль.ДД_Компонента_ПолучитьПустойКонтент(ИмяКонтента,Истина);
КонецФункции

//ucd

Процедура Заполнить_UcdSellerContent(Контент, Документ1С, ФункцияУПД)
	
	// Документация: http://1c-docs.diadoc.ru/ru/latest/UcdSellerContent.html

	Если ФункцияУПД = "СЧФ" Тогда
		УстановитьЗначениеXDTO(Контент, "Function",					"Invoice");
		ДокОсн = Документ1С.ДокументОснование; 
	ИначеЕсли ФункцияУПД = "ДОП" Тогда	
		УстановитьЗначениеXDTO(Контент, "Function",					"Basic");
		ДокОсн = Документ1С; 
	Иначе
		УстановитьЗначениеXDTO(Контент, "Function",					"InvoiceAndBasic");
		ДокОсн = Документ1С.ДокументОснование;
	КонецЕсли;	
	
	УстановитьЗначениеXDTO(Контент, "Name",						Неопределено);
	УстановитьЗначениеXDTO(Контент, "Date",						Документ1С.Дата);
	УстановитьЗначениеXDTO(Контент, "Number",					Документ1С.Номер);
	УстановитьЗначениеXDTO(Контент, "Currency",					ДокОсн.ВалютаДокумента.Код);
	УстановитьЗначениеXDTO(Контент, "CurrencyRate",				1);
	УстановитьЗначениеXDTO(Контент, "RevisionDate",				Неопределено);
	УстановитьЗначениеXDTO(Контент, "RevisionNumber",			Неопределено);
	УстановитьЗначениеXDTO(Контент, "Creator",					ДокОсн.Организация.НаименованиеПолное);
	УстановитьЗначениеXDTO(Контент, "CreatorBase",				Неопределено);
	УстановитьЗначениеXDTO(Контент, "GovermentContractInfo",	Неопределено);
	УстановитьЗначениеXDTO(Контент, "ВалютаСсылка",				ДокОсн.ВалютаДокумента,	Истина);
	
	ТипСтроки = Контент.Свойства().Получить("Invoices").Тип.Имя;
	
	НовЭлемент = Контент.Invoices.Добавить(НовыйКонтент(ТипСтроки));
	Заполнить_InvoiceForCorrectionInfo(НовЭлемент, Документ1С.ИсправляемыйСчетФактура.Номер, Документ1С.ИсправляемыйСчетФактура.Дата);
	
	Заполнить_ExtendedOrganizationInfo		(Контент.Seller, ДокОсн.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, "Продавец");
	Заполнить_ExtendedOrganizationInfo		(Контент.Buyer,  ДокОсн.Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, 	"Покупатель");
	Заполнить_EventContent					(Контент.EventContent, Документ1С, Документ1С.ИсправляемыйСчетФактура.Номер, Документ1С.ИсправляемыйСчетФактура.Дата);
	Заполнить_InvoiceCorrectionTable		(Контент.InvoiceCorrectionTable, ДокОсн);
	//Заполнить_AdditionalInfoId				(Контент.AdditionalInfoId, Неопределено);
	Контент.Seller.Name = ДокОсн.Организация.Наименование;
	
КонецПроцедуры

Процедура Заполнить_InvoiceForCorrectionInfo(Контент, НомерИсхСФ, ДатаИсхСФ)


	УстановитьЗначениеXDTO(Контент, "InvoiceDate",				ДатаИсхСФ);
	УстановитьЗначениеXDTO(Контент, "InvoiceNumber",			СокрЛП(НомерИсхСФ));

	//ТипСтроки = Контент.Свойства().Получить("InvoiceRevisions").Тип.Имя;
	//Для Сч=1 По 0 Цикл
	//	
	//	НовЭлемент = Контент.InvoiceRevisions.Добавить(НовыйКонтент(ТипСтроки));
	//	Заполнить_InvoiceRevisionInfo(НовЭлемент, Неопределено);
	//
	//КонецЦикла;

КонецПроцедуры

Процедура Заполнить_EventContent(Контент, Документ1С, НомерИсхСФ, ДатаИсхСФ)

	// Документация: http://1c-docs.diadoc.ru/ru/latest/EventContent.html

	УстановитьЗначениеXDTO(Контент, "CostChangeInfo",			Неопределено);
	УстановитьЗначениеXDTO(Контент, "TransferDocDetails",		"Универсальный передаточный документ № " + СокрЛП(НомерИсхСФ) + " от " + Формат(ДатаИсхСФ, "ДЛФ=Д"));
	УстановитьЗначениеXDTO(Контент, "OperationContent",			"Содержание операции");
	УстановитьЗначениеXDTO(Контент, "NotificationDate",			Неопределено);

	ТипСтроки = Контент.Свойства().Получить("CorrectionBases").Тип.Имя;	
	НовЭлемент = Контент.CorrectionBases.Добавить(НовыйКонтент(ТипСтроки));
	Заполнить_BaseDocumentName(НовЭлемент, Документ1С);
	
КонецПроцедуры

Процедура Заполнить_BaseDocumentName(Контент, Документ1С)

	// Документация: http://1c-docs.diadoc.ru/ru/latest/BaseDocumentName.html
	Если Документ1С.Контрагент.ИНН = "5027213485" Тогда
		УстановитьЗначениеXDTO(Контент, "BaseDocumentDate",			Документ1С.ДоговорКонтрагента.Дата);
		УстановитьЗначениеXDTO(Контент, "BaseDocumentNumber",		Документ1С.ДоговорКонтрагента.Номер); //Строка("ОФ-1П")
		УстановитьЗначениеXDTO(Контент, "BaseDocumentName",			Документ1С.ДоговорКонтрагента.Наименование); //Строка("Публичная оферта договора поставки ОФ-1П");

		УстановитьЗначениеXDTO(Контент, "AdditionalInfo",			Неопределено);

	Иначе
		УстановитьЗначениеXDTO(Контент, "BaseDocumentDate",			Документ1С.ДоговорКонтрагента.Дата);
		УстановитьЗначениеXDTO(Контент, "BaseDocumentNumber",		Документ1С.ДоговорКонтрагента.Номер);
		УстановитьЗначениеXDTO(Контент, "BaseDocumentName",			"Договор");

		УстановитьЗначениеXDTO(Контент, "AdditionalInfo",			Неопределено);
	КонецЕсли;

КонецПроцедуры

Процедура Заполнить_InvoiceCorrectionTable(Контент, Документ1С)

	// Документация: http://1c-docs.diadoc.ru/ru/latest/InvoiceCorrectionTable.html
	
	ТипСтроки = Контент.Свойства().Получить("Items").Тип.Имя;
	
	Для Каждого СтрокаТовары Из Документ1С.Товары Цикл
		
		СтрокаДо = 	Документ1С.Товары.Найти(СтрокаТовары.Номенклатура, "Номенклатура");

		НовЭлемент = Контент.Items.Добавить(НовыйКонтент(ТипСтроки));
		Заполнить_ExtendedInvoiceCorrectionItem(НовЭлемент, СтрокаТовары, СтрокаДо);
	
	КонецЦикла;
	
	//Для Каждого СтрокаТовары Из Документ1С.Услуги Цикл
	//	
	//	СтрокаДо = 	Документ1С.Услуги.Найти(СтрокаТовары.Номенклатура,"Номенклатура");

	//	НовЭлемент = Контент.Items.Добавить(НовыйКонтент(ТипСтроки));
	//	Заполнить_ExtendedInvoiceCorrectionItem(НовЭлемент, СтрокаТовары, СтрокаДо);
	//
	//КонецЦикла;

	//Если Расхождения.Итог("СуммаСНДС") > 0 Тогда
	//	Заполнить_InvoiceTotalsDiff				(Контент.TotalsInc, Расхождения);
	//Иначе	
	//	Заполнить_InvoiceTotalsDiff				(Контент.TotalsDec, Расхождения);
	//КонецЕсли;
	
	ИтогПлюс = 0;
	ИтогСНДСПлюс = 0;
	ИтогНДСПлюс = 0;
	ИтогМинус = 0;
	ИтогСНДСМинус = 0;
	ИтогНДСМинус = 0;	
	
	Счетчик = Контент.Items.Количество() - 1;
	
	Пока Счетчик >= 0 Цикл
		
		Если ЗначениеЗаполнено(Контент.Items[Счетчик].AmountsInc.Total) Тогда
			ИтогСНДСПлюс 	= ИтогСНДСПлюс + Контент.Items[Счетчик].AmountsInc.Total;
			ИтогПлюс 		= ИтогПлюс + Контент.Items[Счетчик].AmountsInc.TotalWithVatExcluded;
			ИтогНДСПлюс 	= ИтогНДСПлюс + Контент.Items[Счетчик].AmountsInc.Vat;			
		ИначеЕсли ЗначениеЗаполнено(Контент.Items[Счетчик].AmountsDec.Total) Тогда
			ИтогСНДСМинус 	= ИтогСНДСМинус + Контент.Items[Счетчик].AmountsDec.Total;
			ИтогМинус 		= ИтогМинус + Контент.Items[Счетчик].AmountsDec.TotalWithVatExcluded;
			ИтогНДСМинус 	= ИтогНДСМинус + Контент.Items[Счетчик].AmountsDec.Vat;
		Иначе
			Контент.Items.Удалить(Счетчик);
		КонецЕсли;	
		
		Счетчик = Счетчик - 1;
		
	КонецЦикла;

	Заполнить_InvoiceTotalsDiff				(Контент.TotalsInc, ИтогПлюс, ИтогСНДСПлюс, ИтогНДСПлюс);	
	Заполнить_InvoiceTotalsDiff				(Контент.TotalsDec, ИтогМинус, ИтогСНДСМинус, ИтогНДСМинус);

КонецПроцедуры

Процедура Заполнить_ExtendedInvoiceCorrectionItem(Контент, СтрокаТовары, СтрокаДо)

	// Документация: http://1c-docs.diadoc.ru/ru/latest/ExtendedInvoiceCorrectionItem.html
	
	Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура.НаименованиеПолное) Тогда
		УстановитьЗначениеXDTO(Контент, "Product",					СтрокаТовары.Номенклатура.НаименованиеПолное);		
	Иначе
		УстановитьЗначениеXDTO(Контент, "Product",					СтрокаТовары.Номенклатура.Наименование);
	КонецЕсли;
	
	УстановитьЗначениеXDTO(Контент, "ItemAccountDebit",			Неопределено);
	УстановитьЗначениеXDTO(Контент, "ItemAccountCredit",		Неопределено);

	Заполнить_InvoiceItemFields				(Контент.OriginalValues, СтрокаТовары,СтрокаДо,"оригинальные");
	Заполнить_InvoiceItemFields				(Контент.CorrectedValues, СтрокаТовары,СтрокаДо,"скорректированные");
	
	Если СтрокаТовары.СуммаДоИзменения > СтрокаТовары.Сумма Тогда
		Заполнить_AmountsDiff					(Контент.AmountsDec, СтрокаТовары);	
	Иначе
		Заполнить_AmountsDiff					(Контент.AmountsInc, СтрокаТовары);	
	КонецЕсли;


КонецПроцедуры

Процедура Заполнить_InvoiceItemFields(Контент,СтрокаТовары,СтрокаДо,ТипКонтента)
	// Документация: http://1c-docs.diadoc.ru/ru/latest/InvoiceItemFields.html
	
	Попытка 
		Попытка
			ЕдиницаИзмерения = СтрокаДо.Номенклатура.БазоваяЕдиницаИзмерения;
		Исключение
			ЕдиницаИзмерения = СтрокаДо.Номенклатура.Номенклатура.БазоваяЕдиницаИзмерения;
		КонецПопытки;
	Исключение	
		ЕдиницаИзмерения = СтрокаДо.ЕдиницаИзмерения;
	КонецПопытки;
	
	Если ТипКонтента = "оригинальные" Тогда
				
		УстановитьЗначениеXDTO(Контент, "UnitCode",					ЕдиницаИзмерения.Код);
		
		УстановитьЗначениеXDTO(Контент, "UnitName",					ЕдиницаИзмерения.Наименование);
		
		УстановитьЗначениеXDTO(Контент, "Quantity",					СтрокаДо.КоличествоДоИзменения);
		УстановитьЗначениеXDTO(Контент, "TaxRate",					привестиСтавкуНДС(СтрокаДо.СтавкаНДС));
		УстановитьЗначениеXDTO(Контент, "Excise",					Неопределено);
		УстановитьЗначениеXDTO(Контент, "TotalWithVatExcluded",		СтрокаДо.СуммаДоИзменения - СтрокаДо.СуммаНДСДоИзменения);
		УстановитьЗначениеXDTO(Контент, "Vat",						СтрокаДо.СуммаНДСДоИзменения);
		УстановитьЗначениеXDTO(Контент, "Total",					СтрокаДо.СуммаДоИзменения);   
		//УстановитьЗначениеXDTO(Контент, "Price",					СтрокаДо.Цена);		
		УстановитьЗначениеXDTO(Контент, "Price",					Окр(Контент.TotalWithVatExcluded / Контент.Quantity, 2));
	
	Иначе
	
		УстановитьЗначениеXDTO(Контент, "UnitCode",					ЕдиницаИзмерения.Код);
		
		УстановитьЗначениеXDTO(Контент, "UnitName",					ЕдиницаИзмерения.Наименование);
		
		УстановитьЗначениеXDTO(Контент, "Quantity",					СтрокаТовары.Количество);
		УстановитьЗначениеXDTO(Контент, "TaxRate",					привестиСтавкуНДС(СтрокаДо.СтавкаНДС));
		УстановитьЗначениеXDTO(Контент, "Excise",					Неопределено);
		УстановитьЗначениеXDTO(Контент, "TotalWithVatExcluded",		СтрокаДо.Сумма - СтрокаДо.СуммаНДС);
		УстановитьЗначениеXDTO(Контент, "Vat",						СтрокаДо.СуммаНДС);
		УстановитьЗначениеXDTO(Контент, "Total",					СтрокаДо.Сумма);	
		Если   Контент.Quantity = 0 Тогда
		УстановитьЗначениеXDTO(Контент, "Price",					0);
		Иначе
		//УстановитьЗначениеXDTO(Контент, "Price",					СтрокаДо.Цена);		
		УстановитьЗначениеXDTO(Контент, "Price",					Окр(Контент.TotalWithVatExcluded / Контент.Quantity, 2));
		КонецЕсли;		
		
	КонецЕсли;

КонецПроцедуры

Процедура Заполнить_InvoiceTotalsDiff(Контент, ИтогБезНДС, ИтогСНДС, ИтогНДС)

	// Документация: http://1c-docs.diadoc.ru/ru/latest/InvoiceTotalsDiff.html
	Если ИтогБезНДС <> 0 Тогда 
		УстановитьЗначениеXDTO(Контент, "TotalWithVatExcluded",		ИтогБезНДС);
	Иначе
		УстановитьЗначениеXDTO(Контент, "TotalWithVatExcluded",		НЕОПРЕДЕЛЕНО);
	КонецЕсли;
	
	Если ИтогБезНДС <> 0 Тогда 
		УстановитьЗначениеXDTO(Контент, "Total",		ИтогСНДС);
	Иначе
		УстановитьЗначениеXDTO(Контент, "Total",		НЕОПРЕДЕЛЕНО);
	КонецЕсли;
	
	Если ИтогНДС <> 0 Тогда 
		УстановитьЗначениеXDTO(Контент, "Vat",		ИтогНДС);
	Иначе
		УстановитьЗначениеXDTO(Контент, "Vat",		НЕОПРЕДЕЛЕНО);
	КонецЕсли;

КонецПроцедуры

Процедура Заполнить_AmountsDiff(Контент,СтрокаТовары)

	// Документация: http://1c-docs.diadoc.ru/ru/latest/AmountsDiff.html
	
	Если СтрокаТовары.СуммаДоИзменения > СтрокаТовары.Сумма Тогда
		СуммаБезНДС = (СтрокаТовары.СуммаДоИзменения - СтрокаТовары.СуммаНДСДоИзменения) - (СтрокаТовары.Сумма - СтрокаТовары.СуммаНДС) ;
		СуммаНДС = СтрокаТовары.СуммаНДСДоИзменения - СтрокаТовары.СуммаНДС;
		СуммаСНДС = СтрокаТовары.СуммаДоИзменения - СтрокаТовары.Сумма;
	Иначе
		СуммаБезНДС =  (СтрокаТовары.Сумма - СтрокаТовары.СуммаНДС) - (СтрокаТовары.СуммаДоИзменения - СтрокаТовары.СуммаНДСДоИзменения) ;
		СуммаНДС =  СтрокаТовары.СуммаНДС - СтрокаТовары.СуммаНДСДоИзменения;
		СуммаСНДС =  СтрокаТовары.Сумма - СтрокаТовары.СуммаДоИзменения;
	КонецЕсли;
		
		
	УстановитьЗначениеXDTO(Контент, "Excise",					Неопределено);
	УстановитьЗначениеXDTO(Контент, "TotalWithVatExcluded",		СуммаБезНДС);
	УстановитьЗначениеXDTO(Контент, "Vat",						СуммаНДС);
	УстановитьЗначениеXDTO(Контент, "Total",					СуммаСНДС);
	
КонецПроцедуры

//Конец Сбора документа


///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////


// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Nayti_Sopostavleniye_Dokumenta.html

	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента		= Документ.Тип.ТипДокумента;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента",	Документ.Реквизиты.Номер);
	
	Если ТипДокумента = "XmlTorg12" 
		ИЛИ ТипДокумента = "XmlAcceptanceCertificate" 
		ИЛИ (ТипДокумента = "UniversalTransferDocument" И ФункцияДокумента <> "Invoice") Тогда				
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = "Invoice" 
		ИЛИ (ТипДокумента = "UniversalTransferDocument" И ФункцияДокумента = "Invoice") Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ТипДокумента = "UniversalCorrectionDocument" И ФункцияДокумента <> "Invoice" Тогда				
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "КорректировкаПоступления");
		
	ИначеЕсли ТипДокумента = "UniversalCorrectionDocument" И ФункцияДокумента = "Invoice" Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ТипДокумента = "ProformaInvoice" Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетНаОплатуПоставщика");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокТиповДокументовДляСоздания(Параметры)
	
	Результат = Новый СписокЗначений;
	
	Документ = Параметры.Документ;
	
	ТиповойМодуль = ТиповойМодульДиадока();
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(ТиповойМодульДиадока, РежимУправляемыхФорм, Параметры);	
	
	//ТипДокумента		= Документ.Тип.ТипДокумента;
	//ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	//ТипКонтента		= Документ.Тип.ТипКонтента;

	//Если ТипДокумента = "XmlTorg12"
	//	ИЛИ ТипДокумента = "XmlAcceptanceCertificate"
	//	ИЛИ (ТипДокумента = "UniversalTransferDocument" И ФункцияДокумента <> "Invoice") Тогда
	//	
	//	Результат.Добавить("ПоступлениеТоваровУслуг", "Поступление товаров и услуг");
	//	
	//ИначеЕсли ТипДокумента = "UniversalCorrectionDocument" И ФункцияДокумента <> "Invoice" Тогда	
	//	
	//	Результат.Добавить("КорректировкаПоступления", "Корректировка поступления");
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'_Zapolnennyy_Obyekt_Dokumenta_1S.html

	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	Документ				= Параметры.Документ;
	ДополнительныеПараметры	= Параметры.ДополнительныеПараметры;
	
	ТипДокумента		= Документ.Тип.ТипДокумента;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	Контент				= Документ.Документооборот.ХранилищеКонтента;
	
	Если ТипДокумента = "XmlTorg12"
		ИЛИ ТипДокумента = "XmlAcceptanceCertificate"
		ИЛИ (ТипДокумента = "UniversalTransferDocument" И ФункцияДокумента <> "Invoice")
		ИЛИ (ТипДокумента = "UniversalCorrectionDocument" И ФункцияДокумента <> "Invoice") Тогда
		
		ЭтоКорректировка = (ТипДокумента = "UniversalCorrectionDocument");
		
		ДвоичныеДанные = Контент.Данные;
		ДеревоКонтента = ОсновнойМодуль.XML_В_XDTO(ДвоичныеДанные);
		ТабличнаяЧасть = ОсновнойМодуль.ЭДО_ПолучитьТабличнуюЧастьИзКонтентаXML(ДеревоКонтента, ЭтоКорректировка);
		
		Если ЭтоКорректировка Тогда
			СоздатьДокументКорректировки(Документ, ТабличнаяЧасть, ДеревоКонтента, Результат);
		Иначе
			СоздатьДокументПоступления(Документ, ТабличнаяЧасть, ДеревоКонтента, Результат);
		КонецЕсли;
			
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Выполняет запись сопоставленной пользователем номенклатуры поставщика
Функция СопоставитьНоменклатуруПоставщика(ТаблицаНоменклатурыДляСопоставления)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Sopostavit'_Nomenklaturu_Postavshchika.html
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого СтрокаТЗ Из ТаблицаНоменклатурыДляСопоставления Цикл
			
			НовыйОбъект = РегистрыСведений.НоменклатураКонтрагентов.СоздатьМенеджерЗаписи();
				
			НовыйОбъект.Контрагент	  = СтрокаТЗ.Контрагент;
			НовыйОбъект.Номенклатура  = СтрокаТЗ.Номенклатура;
			НовыйОбъект.Идентификатор = СтрокаТЗ.Код;
			НовыйОбъект.АртикулНоменклатурыКонтрагента		= СтрокаТЗ.Артикул;				
			НовыйОбъект.НаименованиеНоменклатурыКонтрагента	= СтрокаТЗ.Наименование;
			
			НовыйОбъект.Записать();
			
		КонецЦикла;
		
	Исключение
		ОтменитьТранзакцию();
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Provesti_Analiz_Dokumenta.html

	Результат = Параметры.РезультатАнализа; // шаблон результата анализа приходит в этом параметре - надо только заполнить его поля
	
	ДокументДД	= Параметры.ДокументДД;
	ПакетДД		= Параметры.ПакетДД;
	
	Ошибки		= Новый Массив;
	Документ1С	= Неопределено;
	
	СтруктураДанных = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД, ПакетДД);
	
	ТипДокумента 	= НРег(СтруктураДанных.ТипДокумента);
	ТипКонтента 	= НРег(СтруктураДанных.ТипКонтента);
	ФункцияДокумента= НРег(СтруктураДанных.ФункцияДокумента);	
	
	Контрагент	= СтруктураДанных.Контрагент;
	Организация	= СтруктураДанных.Организация;
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда			
		Сообщить("Не указано соответствие контрагента для входящего документа: " + ДокументДД);
		Возврат Неопределено; //пропускаем анализ: ждем сопоставления контрагента			
	КонецЕсли;
	
	
	// Выполним сопоставление документа
	МассивДокументов1С = НайтиСопоставлениеДокумента(Параметры);
	
	Если ТипЗнч(МассивДокументов1С) = Тип("Массив") И МассивДокументов1С.Количество() = 1 Тогда
		Документ1С = МассивДокументов1С[0];
	КонецЕсли;
	
    // НАКЛАДНЫЕ
	Если ТипДокумента = "xmltorg12" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда		
		
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найдена накладная №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));
		Иначе			
			ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Ошибки);					
		КонецЕсли;		
		
	// СЧЕТА-ФАКТУРЫ
	ИначеЕсли ТипДокумента = "invoice" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда		
						
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найден счет-фактура №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));			
		КонецЕсли;
		
		ТипКонтентаУПД = (ТипКонтента = "utd" ИЛИ ТипКонтента = "utd820");
		
		Если ТипДокумента = "invoice" И НЕ ТипКонтентаУПД Тогда
			Ошибки.Добавить("Счет-фактура в старом формате.");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("ДокументДляСопоставления", Документ1С);
	Результат.Вставить("Ошибки", Ошибки);	
	
	Если Ошибки.Количество() > 0 Тогда
		Результат.Вставить("ДействиеВ1С", "Выполнить анализ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)

	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Analiza_Paketa.html

	Пакет			= Параметры.Пакет;	
	ДокументыПакета = Параметры.ДокументыПакета;
	
	ДокументыПакета.Колонки.Добавить("ДанныеДокумента");
	
	СуммаНакладной 					= Неопределено;
	СуммаСчетаФактуры 				= Неопределено;
	ЕстьНесопоставленныеДокументы 	= Ложь;	
	ЕстьКритичнаяОшибкаПакета 		= Ложь;
	
	Ошибки = Новый Массив;
	
	// 1. Анализ всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ТекДокумент.Ссылка, Пакет);
		ТекДокумент.ДанныеДокумента = ДанныеДокумента;
		
		ДокументДД 		= ТекДокумент.Ссылка;		
		ТипДокумента 	= НРег(ДанныеДокумента.ТипДокумента);
		ФункцияДокумента= НРег(ДанныеДокумента.ФункцияДокумента);	
		
		//ошибки, выявленные при выполнении события ПровестиАнализДокумента, распространяем на весь пакет
		Если ЗначениеЗаполнено(ДанныеДокумента.ТекстОшибки) Тогда
			Ошибки.Добавить(ДанныеДокумента.ТекстОшибки);
		КонецЕсли;
		
		Если ТипДокумента = "xmltorg12" 
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда
		    СуммаНакладной = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
		
		Если ТипДокумента = "invoice"
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда
			СуммаСчетаФактуры = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
						
		Если (ТипДокумента = "xmltorg12" ИЛИ ТипДокумента = "invoice" ИЛИ ТипДокумента = "universaltransferdocument")
			И НЕ ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
			ЕстьНесопоставленныеДокументы = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// 2. Интерпретация ошибок
	
	Если СуммаНакладной = Неопределено Тогда
		Ошибки.Добавить("Нет накладной.");
	КонецЕсли;
	
	Если СуммаСчетаФактуры = Неопределено Тогда
		Ошибки.Добавить("Нет счета-фактуры.");
	КонецЕсли;
	
	Если СуммаНакладной <> Неопределено И СуммаСчетаФактуры <> Неопределено И СуммаНакладной <> СуммаСчетаФактуры Тогда
		Ошибки.Добавить("Не совпадают суммы счета-фактуры и первичного документа.");
		//ЕстьКритичнаяОшибкаПакета = Истина; //иногда в СФ могут не включать позиции без НДС, тогда несовпадение сумм приемлемо
	КонецЕсли;
		
	ТекстВсехОшибокПакета = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Ошибки, Символы.ПС);
	
	ЕстьКритичнаяОшибкаПакета = (ЕстьКритичнаяОшибкаПакета 
								ИЛИ Найти(ТекстВсехОшибокПакета, "ДУБЛИКАТ") <> 0
								ИЛИ Найти(ТекстВсехОшибокПакета, "Счет-фактура в старом формате") <> 0);
	
	//ОшибокНет = (СокрЛП(ТекстВсехОшибокПакета) = ""); //самый жесткий вариант выполнения анализа пакета
	ОшибокНет = НЕ ЕстьКритичнаяОшибкаПакета;           //менее жесткий вариант выполнения анализа пакета
	
	
	// 3. Формирование контента ответа всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ТекДокумент.ДанныеДокумента;
		
		ДокументДД	= ТекДокумент.Ссылка;		
		Документ1С	= ДанныеДокумента.ДокументВ1С;
		ТекстОшибки	= ДанныеДокумента.ТекстОшибки;
		
		Если Не ЗначениеЗаполнено(Документ1С) Тогда
			Продолжить;
		КонецЕсли;
						
		РезультатАнализа = ОсновнойМодуль.ЭДО_НовыйРезультатАнализаВходящегоДокумента();
		
		РезультатАнализа.Ошибки = ТекстОшибки; // сохраняем ошибки, относящиеся только к текущему документу
		//РезультатАнализа.Ошибки = ТекстВсехОшибокПакета; // сохраняем ошибки всего пакета для каждого документа из пакета
		
		СписокДействийТекДокумента = ОсновнойМодуль.ЭДО_ВариантыОтветныхДействийПоДокументу(ДокументДД, ОшибокНет);		
		РезультатАнализа.ДействиеВДД = ?(СписокДействийТекДокумента.Количество()=0, "", СписокДействийТекДокумента[0].Значение);
				
		Если ЗначениеЗаполнено(РезультатАнализа.ДействиеВДД) Тогда						
			РезультатАнализа.Вставить("КонтентОтвета", ПолучитьКонтентОтвета(ДокументДД, Документ1С, РезультатАнализа.ДействиеВДД, ТекстВсехОшибокПакета));			
		КонецЕсли;
		
		РезультатАнализа.Вставить("ДокументДляСопоставления", Документ1С);
		ОсновнойМодуль.СохранитьРезультатАнализа(ДокументДД, РезультатАнализа);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Vypolnit'_Trebuyemoye_Deystviye.html

	ДокументДД 	= Параметры.ДокументДД;
	ПакетДД 	= Параметры.ПакетДД;
	
	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	
	Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
		
		Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
		Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
		
	КонецЕсли;		
	
	Возврат Истина;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 	= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента= РеквизитыДокумента.ФункцияДокумента;
	Организация		= РеквизитыДокумента.Организация;
	Контрагент		= РеквизитыДокумента.Контрагент;
		
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", Организация, Контрагент);
	
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслугВНТТ",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратТоваровОтПокупателя",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт ИЛИ ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслугВНТТ", Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеДопРасходов",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионераОПродажах",	Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", Организация, Контрагент);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаПоступление"));
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАванс"));
			
			ОтборСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора); 
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
			
			ОтборКоррСФ = Новый Структура("Организация, Контрагент", Организация, Контрагент);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.Корректировочный"));
			
			ОтборКоррСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочнаяНакладная Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступления", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "АктСверкиВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетНаОплатуПоставщика", Отбор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/proc/pm/Obrabotka_Vkhodyashchikh_Paketov.html
	
	//Результат = Новый Структура;
	//
	//Результат.Вставить("Ссылка", Новый Массив);
	//
	//Возврат Результат;
	
КонецФункции


///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции



///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Vypolnit'_Reglamentnyye_Deystviya.html

	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		Сообщить("Не указана служебная учетная запись для выполнения регламентных действий.");
		Возврат Ложь;
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID",			 СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование",	 СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка",			 СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
	
	// ВЫПОЛНЕНИЕ MessagePatchToPost 
	
	Режим = ""; // Режим исполнения: ПередатьНаСогласование / ПередатьНаПодпись / ПередатьПоМаршруту / Согласование / ОтказВСогласовании
	
	ПараметрыMessagePatchToPost = Новый Структура;
	ПараметрыMessagePatchToPost.Вставить("Действие",					Режим);        // вариант режима MessagePatchToPost
	ПараметрыMessagePatchToPost.Вставить("ИдентификаторСотрудника",		Неопределено); // внутренний ID Диадока
	ПараметрыMessagePatchToPost.Вставить("ИдентификаторПодразделения",	Неопределено); // внутренний ID Диадока
	ПараметрыMessagePatchToPost.Вставить("ИдентификаторМаршрута",		Неопределено); // внутренний ID Диадока
	ПараметрыMessagePatchToPost.Вставить("Комментарий",					"");           // произвольный текст 	
	
	// Произвольная коллекция документов Диадока, которые необходимо пропатчить (необходимо собрать по нужному алгоритму).
	// Элементы этой коллекции должны содержать ключ "ДокументДД".
	ТаблицаДокументов = Новый ТаблицаЗначений;	
	
	Если ЗначениеЗаполнено(Режим) Тогда
		ОсновнойМодуль.ЭДО_ОтправитьMessagePatchToPostДляВыбранныхСтрокСпискаДокументов(ТаблицаДокументов, ПараметрыMessagePatchToPost);
	КонецЕсли;	
	
	// ПРИМЕРЫ ПОЛУЧЕНИЯ ID ПОДРАЗДЕЛЕНИЙ, ПОЛЬЗОВАТЕЛЕЙ, МАРШРУТОВ СОГЛАСОВАНИЯ:
	//boxId = ДокументДД.BoxId; // ID ящика, для которого получаем данные
	//ПодразделенияДиадок		 = ОсновнойМодуль.ЭДО_ПодразделенияОрганизацииВДиадоке(boxId);
	//ПользователиДиадок		 = ОсновнойМодуль.ЭДО_СписокПользователейДиадока(boxId);
	//МаршрутыСогласованияДиадок = ОсновнойМодуль.ЭДО_СписокМаршрутовСогласованияВДиадоке(boxId);
	
	// ПРИМЕР ПЕРЕМЕЩЕНИЯ ДОКУМЕНТОВ ПАКЕТА В ПОДРАЗДЕЛЕНИЕ:
	//МассивДокументов = Новый Массив;
	//Для Каждого СтрокаТЗ Из ТаблицаДокументов Цикл
	//	МассивДокументов.Добавить(Новый Структура("ДокументДД", СтрокаТЗ.ДокументДД));
	//КонецЦикла;
	//ОсновнойМодуль.ЭДО_ПереместитьМассивДокументовВПодразделение(BoxId, ToDepartmentId, МассивДокументов);
	
	// ПРИМЕР ПОДПИСАНИЯ И ОТПРАВКИ СЕРТИФИКАТОМ УСТАНОВЛЕННЫМ НА СЕРВЕРЕ 1С
	// ОГРАНИЧЕНИЯ: сервер под Windows; закрытый ключ сертификата установлен под учеткой агента сервера 1С с сохраненным пин-кодом
	//
	//// 1. Авторизация под сертификатами сервера 1С
	//ОсновнойМодуль.ЭДО_АвторизоватьсяПодСертификатомНаСервере1С();  
	//КонтекстСеанса = ОсновнойМодуль.ЭДО_КонтекстСеансаКлиентСервер();
	//
	//// 2. Параметры для получения списка пакетов на отправку
	//ТаблицаВидовПакетов	 = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьСписокЭлементов("ВидыПакетов");
	//МассивВидовПакетов	 = ТаблицаВидовПакетов.ВыгрузитьКолонку("Ссылка");
	//
	//ПараметрыОбновленияСписка = Новый Структура;
	//ПараметрыОбновленияСписка.Вставить("Режим",					"ОтправкаПакетов");
	//ПараметрыОбновленияСписка.Вставить("НачалоПериода",			ДобавитьМесяц(ТекущаяДата(), -1));
	//ПараметрыОбновленияСписка.Вставить("КонецПериода",			КонецДня(ТекущаяДата()));
	//ПараметрыОбновленияСписка.Вставить("МассивВыбранныхВидов",	МассивВидовПакетов);
	//
	////3. Отправка пакетов по организациям, в которых авторизовались под сертом сервера 1С
	//Для Каждого Элемент Из КонтекстСеанса Цикл
	//	
	//	СтрокаКонтекста	 = Элемент.Значение;
	//	Организация		 = СтрокаКонтекста.ОрганизацияДиадок.СвязанныйСправочник1;
	//	
	//	ПараметрыОбновленияСписка.Вставить("ОтборПоОрганизации", Организация);
	//	
	//	ОсновнойМодуль.ЭДО_Модуль_ОбновитьСписокДокументов(ПараметрыОбновленияСписка);
	//	
	//	//1 вариант: последовательная отправка
	//	Для Каждого СтрокаТЧ Из ОсновнойМодуль.СписокДокументов Цикл
	//		ОсновнойМодуль.ЭДО_ПодготовитьИОтправитьПакет(СтрокаТЧ);
	//	КонецЦикла;
	//	
	//	//2 вариант: фоновая отправка
	//	ОсновнойМодуль.ЭДО_ПодготовитьИОтправитьПакетыВФоне(ОсновнойМодуль.СписокДокументов);
	//	
	//КонецЦикла;	
	
	//ПРИМЕР ПОДПИСАНИЯ И ОТПРАВКИ СОХРАНЕННОГО ОТВЕТА НА ВХОДЯЩИЙ ДОКУМЕНТ: ОсновнойМодуль.ЭДО_ПодготовитьИОтправитьОтветНаДокумент(ДокументДД, ПакетДД)
	
	//ПРИМЕР СИНХРОНИЗАЦИИ КОНТРАГЕНТОВ ПОД УЧЕТНОЙ ЗАПИСЬЮ
	//ОсновнойМодуль.ЭДО_ЗаполнитьКонтекстСеансаДляСлужебнойУчетнойЗаписи();
	//ОсновнойМодуль.ВыполнитьСинхронизациюКонтрагентовОрганизаций();
	
	//ПРИМЕР ДОБАВЛЕНИЯ СОГЛАСУЮЩЕЙ ПОДПИСИ К ДОКУМЕНТУ
	//ОсновнойМодуль.ЭДО_ОтправитьСогласующуюПодпись(ДокументДД, ОтпечатокСертификата);
	
	Возврат Истина;
	
КонецФункции

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'_Nastroyki_Dopolnitel'nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Obnovleniya_Spiska_Dokumentov.html

	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваровУслуг) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваровУслуг
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Zapolnit'_Spisok_Dopolnitel'nykh_Knopok.html

	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Nazhatiye_Dopolnitel'noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение используемых справочников Организации и Контрагенты
Функция ОпределитьТипЗначенияОбъекта(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Opredelit'_Tip_Znacheniya_Obyekta.html
	
	Если Параметры.Синоним = "Организации" Тогда
		Результат = "СправочникСсылка.Организации";
	ИначеЕсли Параметры.Синоним = "Контрагенты" Тогда	
		Результат = "СправочникСсылка.Контрагенты";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Poluchit'_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|	И РеализацияТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслуг.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Дата >= &ДатаНачала
	|	И ПоступлениеТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1 КАК Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			 = Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	 = Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПриОткрытииФормы(Параметры)
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Pri_Otkrytii_Formy.html
	
	Форма		= Параметры.Форма;
	ИмяФормы	= Параметры.ИмяФормы;
	
	// Пример для снятия флажков у всех видов пакетов на отправку
	
	//Если ИмяФормы = "ОсновнаяФорма" Тогда
	//
	//	ДеревоФильтров = Форма.ДеревоФильтров;
	//	
	//	СтрокаОтправкаПакетов = ДеревоФильтров.Строки.Найти("ОтправкаПакетов");
	//	
	//	Если СтрокаОтправкаПакетов <> Неопределено Тогда
	//		
	//		Для Каждого СтрокаВидыПакетов Из СтрокаОтправкаПакетов.Строки Цикл
	//			СтрокаВидыПакетов.Пометка = Ложь;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПриПолученииДанныхТабличнойЧасти(Параметры) Экспорт 
	
	//http://1c-pro-docs.diadoc.ru/ru/latest/func/pm/Pri_Poluchenii_Dannykh_Tablichnoy_Chasti.html
	
	Форма			 = Параметры.Форма;
	ИмяФормы		 = Параметры.ИмяФормы;
	Элемент			 = Параметры.Элемент;
	ОформленияСтрок	 = Параметры.ОформленияСтрок;
	
	//Для Каждого Эл Из Параметры.ОформленияСтрок Цикл
	//	
	//	Если Эл.ДанныеСтроки.НомерСтроки % 2 = 0 Тогда
	//		Эл.Ячейки.Документ.ЦветФона	= WebЦвета.Аквамарин;
	//		Эл.ЦветФона					= WebЦвета.Древесный;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ


//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, Наименование, Код = "", Артикул = "")
	
	Если НЕ Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", Новый ТаблицаЗначений);
		
		МетаданныеРегистра = Метаданные.РегистрыСведений.НоменклатураКонтрагентов;		
		
		// Ограничения типам реквизитов для текущей конфигурации
		Результат.ТаблицаНоменклатурыДляСопоставления.Колонки.Добавить("Контрагент"  , МетаданныеРегистра.Измерения.Контрагент.Тип);
		Результат.ТаблицаНоменклатурыДляСопоставления.Колонки.Добавить("Наименование", МетаданныеРегистра.Ресурсы.НаименованиеНоменклатурыКонтрагента.Тип);
		Результат.ТаблицаНоменклатурыДляСопоставления.Колонки.Добавить("Код"		 , МетаданныеРегистра.Ресурсы.Идентификатор.Тип,, 10);
		Результат.ТаблицаНоменклатурыДляСопоставления.Колонки.Добавить("Артикул"	 , МетаданныеРегистра.Ресурсы.АртикулНоменклатурыКонтрагента.Тип,, 10);
		Результат.ТаблицаНоменклатурыДляСопоставления.Колонки.Добавить("Номенклатура", МетаданныеРегистра.Измерения.Номенклатура.Тип);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент	 = Контрагент;
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.Код			 = Код;
	НоваяСтрока.Артикул		 = Артикул;
	
КонецПроцедуры

Функция НайтиНоменклатуруПоставщикаПоРегистру(Контрагент, Наименование, Код)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураПоставщиков.Номенклатура КАК Номенклатура,
	|	1 КАК Приоритет
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураПоставщиков
	|ГДЕ
	|	&Код <> """"
	|	И НоменклатураПоставщиков.Идентификатор = &Код
	|	И НоменклатураПоставщиков.Контрагент = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураПоставщиков.Номенклатура,
	|	2
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураПоставщиков
	|ГДЕ
	|	&Код <> """"
	|	И НоменклатураПоставщиков.АртикулНоменклатурыКонтрагента = &Код
	|	И НоменклатураПоставщиков.Контрагент = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураПоставщиков.Номенклатура,
	|	3
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураПоставщиков
	|ГДЕ
	|	&Код <> """"
	|	И НоменклатураПоставщиков.КодНоменклатурыКонтрагента = &Код
	|	И НоменклатураПоставщиков.Контрагент = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураПоставщиков.Номенклатура,
	|	4
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураПоставщиков
	|ГДЕ
	|	&Наименование <> """"
	|	И ПОДСТРОКА(НоменклатураПоставщиков.НаименованиеНоменклатурыКонтрагента, 1, &ДлинаНаименования) = &Наименование
	|	И НоменклатураПоставщиков.Контрагент = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Код", ?(ЗначениеЗаполнено(Код), Код, ""));
	Запрос.УстановитьПараметр("ДлинаНаименования", Макс(СтрДлина(Наименование), 1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Номенклатура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НайтиНоменклатуруПоРеквизиту(ИмяРеквизита, ЗначениеРеквизита)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2 Ссылка ИЗ Справочник.Номенклатура ГДЕ "+ИмяРеквизита+" = &ЗначениеРеквизита");
		
		Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				Результат = Выборка.Ссылка;
			КонецЕсли;			

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуНаСтавкуНДС(ПредставлениеСтавкиНДС)
		
	ПредставлениеСтавкиНДС = СокрЛП(СтрЗаменить(ПредставлениеСтавкиНДС, "%", ""));
	
	Если ПредставлениеСтавкиНДС = "10" Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
		
	ИначеЕсли ПредставлениеСтавкиНДС = "18" Тогда
		Возврат Перечисления.СтавкиНДС.НДС18;
		
	ИначеЕсли ПредставлениеСтавкиНДС = "20" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");	
		
	ИначеЕсли ПредставлениеСтавкиНДС = "0" Тогда
		Возврат Перечисления.СтавкиНДС.НДС0;
		
	Иначе
		Возврат Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;

КонецФункции

Функция ПолучитьСсылкуНаГТД(НомерГТД)
	
	СсылкаНомераГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНомераГТД) Тогда
		
		НовыйЭлемент = Справочники.НомераГТД.СоздатьЭлемент();		
		НовыйЭлемент.Код = НомерГТД;		
		НовыйЭлемент.Записать();
		
		СсылкаНомераГТД = НовыйЭлемент.Ссылка;
		
	КонецЕсли;
	
	Возврат СсылкаНомераГТД;
	
КонецФункции

Функция ПолучитьСсылкуНаСтрану(КодСтраны)
	
	СтранаСсылка = Справочники.КлассификаторСтранМира.НайтиПоКоду(КодСтраны);
		
	Если НЕ ЗначениеЗаполнено(СтранаСсылка) Тогда
		
		Если ОКСМ = Неопределено Тогда
			ОКСМ = ОсновнойМодуль.ЭДО_Модуль_РаботаСКонтентом().ПолучитьОКСМ();
		КонецЕсли;
		
		ДанныеСтраны = ОКСМ.Найти(КодСтраны);
		
		Если ДанныеСтраны <> Неопределено Тогда
			НовыйЭлемент = Справочники.КлассификаторСтранМира.СоздатьЭлемент();
			НовыйЭлемент.Код = КодСтраны;
			НовыйЭлемент.Наименование 		= ДанныеСтраны.НаименованиеКраткое;
			НовыйЭлемент.НаименованиеПолное = ДанныеСтраны.НаименованиеПолное;
			НовыйЭлемент.Записать();
			СтранаСсылка = НовыйЭлемент.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтранаСсылка;
	
КонецФункции

Функция ПолучитьСсылкуНаСериюНоменклатуры(Номенклатура, НомерГТД, КодСтраны)
		
	СерияНоменклатуры = Справочники.СерииНоменклатуры.НайтиПоРеквизиту("НомерГТД", НомерГТД, , Номенклатура);
	
	Если НЕ ЗначениеЗаполнено(СерияНоменклатуры) Тогда
		
		НомерГТДСсылка	= ПолучитьСсылкуНаГТД(НомерГТД);
		СтранаСсылка	= ПолучитьСсылкуНаСтрану(КодСтраны);
		
		Если ЗначениеЗаполнено(НомерГТДСсылка) И ЗначениеЗаполнено(СтранаСсылка) ТОгда
			
			НовыйЭлемент = Справочники.СерииНоменклатуры.СоздатьЭлемент();
			НовыйЭлемент.Владелец = Номенклатура;
			НовыйЭлемент.НомерГТД = НомерГТДСсылка;
			НовыйЭлемент.СтранаПроисхождения = СтранаСсылка;
			НовыйЭлемент.Наименование = "" + НомерГТД + ", " + СтранаСсылка;
			
			НовыйЭлемент.Записать();
			
			СерияНоменклатуры = НовыйЭлемент.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СерияНоменклатуры;
	
КонецФункции

Функция ПолучитьРеквизитыПодписантаПоОрганизации1С(Организация, Дата)
	
	Результат = Новый Структура("Фамилия, Имя, Отчество, Должность", "", "", "", "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК ФизЛицо,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность.Наименование КАК Должность,
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.ФизЛицо ЕСТЬ NULL 
	|			ТОГДА ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо.Наименование
	|		ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК СокрФИО
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
	|			&Дата,
	|			СтруктурнаяЕдиница = &Организация
	|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.Руководитель)) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо ССЫЛКА Справочник.ФизическиеЛица) КАК ФИОФизЛицСрезПоследних
	|		ПО ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо");
	
	// немного универсальности
	Если Метаданные.Перечисления.Найти("ОтветственныеЛицаОрганизаций") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОтветственныеЛицаОрганизации", "ОтветственныеЛицаОрганизаций");
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Найти("ФИОФизическихЛиц") <> Неопределено Тогда
		// для БП 3.0
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ФИОФизЛиц",	"ФИОФизическихЛиц");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ФизЛицо",		"ФизическоеЛицо");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.Фамилия 	= Выборка.Фамилия;
		Результат.Имя 		= Выборка.Имя;
		Результат.Отчество 	= Выборка.Отчество;
		Результат.Должность = Выборка.Должность;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьДокументПоступления(Документ, ТабличнаяЧасть, ДеревоКонтента, Результат)
	
	Отказ			= Ложь;
	МассивОшибок	= Новый Массив;
	
	ДокументОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	
	ДокументОбъект.Контрагент				= Документ.Отправитель.Организация;
	ДокументОбъект.Организация				= Документ.Получатель.Организация;			
	ДокументОбъект.ДатаВходящегоДокумента	= Документ.Реквизиты.Дата;
	ДокументОбъект.НомерВходящегоДокумента	= Документ.Реквизиты.Номер;			
	
	ДокументОбъект.Дата 					= ТекущаяДата();	
	ДокументОбъект.Ответственный			= ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.УчитыватьНДС				= Истина;
	ДокументОбъект.СуммаВключаетНДС			= Ложь;
	ДокументОбъект.КратностьВзаиморасчетов	= 1;
	ДокументОбъект.КурсВзаиморасчетов		= 1;
	ДокументОбъект.ВалютаДокумента			= Константы.ВалютаРегламентированногоУчета.Получить();
	ДокументОбъект.Подразделение			= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновноеПодразделение");
	ДокументОбъект.СкладОрдер				= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнойСклад");
	ДокументОбъект.ВидПоступления 			= Перечисления.ВидыПоступленияТоваров.НаСклад;
	
	ДокументОбъект.ОтражатьВУправленческомУчете	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОтражатьДокументыВУправленческомУчете");
	ДокументОбъект.ОтражатьВБухгалтерскомУчете	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОтражатьДокументыВБухгалтерскомУчете");
	ДокументОбъект.ОтражатьВНалоговомУчете		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОтражатьДокументыВНалоговомУчете");
	
	СписокВидовДоговоров = Новый Массив;
	СписокВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	УправлениеВзаиморасчетами.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента, ДокументОбъект.Контрагент, ДокументОбъект.Организация, СписокВидовДоговоров);
	
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		Номенклатура = НайтиНоменклатуруПоставщикаПоРегистру(ДокументОбъект.Контрагент, СтрокаДанных.Наименование, СтрокаДанных.Код);
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Если ЗначениеЗаполнено(СтрокаДанных.Код) Тогда				
				Номенклатура = НайтиНоменклатуруПоРеквизиту("Артикул", СтрокаДанных.Код);
			Иначе
				Номенклатура = НайтиНоменклатуруПоРеквизиту("Наименование", СтрокаДанных.Наименование);
			КонецЕсли;				
		КонецЕсли;				
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			
			ДобавитьНоменклатуруДляСопоставления(Результат, ДокументОбъект.Контрагент, СтрокаДанных.Наименование, СтрокаДанных.Код);
			МассивОшибок.Добавить("Для контрагента """+ДокументОбъект.Контрагент+""" не найдена номенклатура: "+СтрокаДанных.Код+" "+СтрокаДанных.Наименование);
			
			Отказ = Истина;
			Продолжить;
			
		ИначеЕсли Номенклатура.Услуга Тогда
			СтрокаТЧ = ДокументОбъект.Услуги.Добавить();
			СтрокаТЧ.Содержание = СтрокаДанных.Наименование;
			СтрокаТЧ.СтатьяЗатрат = Номенклатура.СтатьяЗатрат;
			СтрокаТЧ.НоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа;
		Иначе				
			СтрокаТЧ = ДокументОбъект.Товары.Добавить();
			СтрокаТЧ.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕдиницаПоКлассификатору", Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(СтрокаДанных.КодЕдИзм), , Номенклатура);
			СтрокаТЧ.Коэффициент = 1;
			
			Если ЗначениеЗаполнено(СтрокаДанных.НомерГТД) Тогда					
				СтрокаТЧ.СерияНоменклатуры = ПолучитьСсылкуНаСериюНоменклатуры(Номенклатура, СтрокаДанных.НомерГТД, СтрокаДанных.КодСтраны);
			КонецЕсли;
			
		КонецЕсли;			
		
		СтрокаТЧ.Номенклатура	= Номенклатура;
		СтрокаТЧ.Количество		= СтрокаДанных.Количество;
		СтрокаТЧ.Цена			= СтрокаДанных.Цена;			
		СтрокаТЧ.Сумма			= СтрокаДанных.СуммаБезНДС;
		СтрокаТЧ.СуммаНДС		= СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СтавкаНДС		= ПолучитьСсылкуНаСтавкуНДС(СтрокаДанных.СтавкаНДС);
		
	КонецЦикла;
	
	
	Если НЕ Отказ Тогда
		
		Если ПустаяСтрока(ДокументОбъект.Номер) Тогда
			ДокументОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
		// Ищем в пакете документ счета-фактуры: если есть, то сразу создаем его в 1С
		
		СтруктураДанныхСФ = Неопределено;
		
		Если Документ.Тип.ТипДокумента = "UniversalTransferDocument" И Документ.Тип.ФункцияДокумента = "InvoiceAndBasic" Тогда				
			СтруктураДанныхСФ = Документ;
		Иначе
			
			ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
			
			Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл					
				
				Если Документ.Идентификаторы.DocumentId <> ДокументПакета.Идентификаторы.DocumentId Тогда						
					
					Если ДокументПакета.Тип.ТипДокумента = "Invoice" ИЛИ ДокументПакета.Тип.ФункцияДокумента = "Invoice" Тогда
						СтруктураДанныхСФ = ДокументПакета;
						Прервать;
					КонецЕсли;						
					
				КонецЕсли;					
				
			КонецЦикла;				
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанныхСФ) Тогда
			
			ДокументОбъект.Записать();			
			
			ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
			ДокументСФ.Заполнить(ДокументОбъект.Ссылка);
			ДокументСФ.ДатаВходящегоДокумента	= СтруктураДанныхСФ.Реквизиты.Дата;
			ДокументСФ.НомерВходящегоДокумента	= СтруктураДанныхСФ.Реквизиты.Номер;
			ДокументСФ.Дата						= ТекущаяДата();
			ДокументСФ.Записать();
			
			Если Документ.Идентификаторы.DocumentId <> СтруктураДанныхСФ.Идентификаторы.DocumentId Тогда
				ОсновнойМодуль.ОбновлениеРеквизитовДокумента(СтруктураДанныхСФ.Идентификаторы, ДокументСФ.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Результат.ОсновнойОбъект = ДокументОбъект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда
		Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(МассивОшибок);		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьДокументКорректировки(Документ, ТабличнаяЧасть, ДеревоКонтента, Результат)
	
	НомерДатаСФ = ДеревоКонтента.Документ.СвКСчФ.СчФ;
	
	Если ТипЗнч(НомерДатаСФ) = Тип("СписокXDTO") Тогда
		Возврат; // УКД по нескольким СФ пропускаем (нужна подробная аналитика такого сценария)
	КонецЕсли;
	
	НомерОснования = НомерДатаСФ.НомерСчФ;
	ДатаОснования  = ОсновнойМодуль.ДатаXML_в_Дата1С(НомерДатаСФ.ДатаСчФ);
	
	ДокументОснование = Неопределено;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	ДатаОснования);
	ПараметрыОтбора.Вставить("НомерДокумента",	НомерОснования);
	
	Если Документ.Тип.ФункцияДокумента = "InvoiceAndBasic" Тогда
		
		ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
		Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 
			И ДокументыОснования1С[0].ДокументыОснования.Количество() = 1 Тогда
			ДокументОснование = ДокументыОснования1С[0].ДокументыОснования[0].ДокументОснование;
		КонецЕсли;
		
	ИначеЕсли Документ.Тип.ФункцияДокумента = "Basic" Тогда

		ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если ДокументыОснования1С = Неопределено Тогда
			ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
		Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
			ДокументОснование = ДокументыОснования1С[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДокументОснование = Неопределено Тогда
		Возврат; // Не нашли документ-основание для УКД
	КонецЕсли;
	
	Отказ = Ложь;
	МассивОшибок = Новый Массив;
	
	ДокументОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	ДокументОбъект.Заполнить(ДокументОснование);
	ДокументОбъект.Товары.Очистить();
	ДокументОбъект.Услуги.Очистить();
		
	ДокументОбъект.Дата 					= ТекущаяДата();
	ДокументОбъект.ДатаВходящегоДокумента	= Документ.Реквизиты.Дата;
	ДокументОбъект.НомерВходящегоДокумента	= Документ.Реквизиты.Номер;
		
	Для Каждого СтрокаДанных Из ТабличнаяЧасть Цикл
		
		Номенклатура = НайтиНоменклатуруПоставщикаПоРегистру(ДокументОбъект.Контрагент, СтрокаДанных.Наименование, "");
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Номенклатура = НайтиНоменклатуруПоРеквизиту("Наименование", СтрокаДанных.Наименование);
		КонецЕсли;				
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			
			ДобавитьНоменклатуруДляСопоставления(Результат, ДокументОбъект.Контрагент, СтрокаДанных.Наименование);
			МассивОшибок.Добавить("Для контрагента """+ДокументОбъект.Контрагент+""" не найдена номенклатура: "+СтрокаДанных.Наименование);
			
			Отказ = Истина;
			Продолжить;
			
		ИначеЕсли Номенклатура.Услуга Тогда
			СтрокаТЧ = ДокументОбъект.Услуги.Добавить();			
			СтрокаТЧ.Содержание = СтрокаДанных.Наименование;
			СтрокаТЧ.СодержаниеДоИзменения = СтрокаДанных.Наименование;
		Иначе
			СтрокаТЧ = ДокументОбъект.Товары.Добавить();
			СтрокаТЧ.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕдиницаПоКлассификатору", Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(СтрокаДанных.КодЕдИзм), , Номенклатура);
			СтрокаТЧ.Коэффициент = 1;
		КонецЕсли;			
		
		СтрокаТЧ.Номенклатура			= Номенклатура;
		СтрокаТЧ.Количество				= СтрокаДанных.Количество;
		СтрокаТЧ.КоличествоДоИзменения	= СтрокаДанных.Количество_До;
		СтрокаТЧ.Цена					= СтрокаДанных.Цена;
		СтрокаТЧ.ЦенаДоИзменения		= СтрокаДанных.Цена_До;
		СтрокаТЧ.Сумма					= СтрокаДанных.СуммаБезНДС;
		СтрокаТЧ.СуммаДоИзменения		= СтрокаДанных.СуммаБезНДС_До;
		СтрокаТЧ.СуммаНДС				= СтрокаДанных.СуммаНДС;
		СтрокаТЧ.СуммаНДСДоИзменения	= СтрокаДанных.СуммаНДС_До;
		СтрокаТЧ.СтавкаНДС				= ПолучитьСсылкуНаСтавкуНДС(СтрокаДанных.СтавкаНДС);
		СтрокаТЧ.СтавкаНДСДоИзменения	= ПолучитьСсылкуНаСтавкуНДС(СтрокаДанных.СтавкаНДС_До);
						
	КонецЦикла;
	
	
	Если НЕ Отказ Тогда
			
		Если ПустаяСтрока(ДокументОбъект.Номер) Тогда
			ДокументОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
		// Ищем в пакете документ УКД-КСЧФ: если есть, то сразу создаем его в 1С
		
		СтруктураДанныхСФ = Неопределено;
		
		Если Документ.Тип.ТипДокумента = "UniversalCorrectionDocument" И Документ.Тип.ФункцияДокумента = "InvoiceAndBasic" Тогда				
			СтруктураДанныхСФ = Документ;
		Иначе
			
			ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
			
			Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл					
				
				Если Документ.Идентификаторы.DocumentId <> ДокументПакета.Идентификаторы.DocumentId Тогда						
					
					Если ДокументПакета.Тип.ТипДокумента = "UniversalCorrectionDocument" И ДокументПакета.Тип.ФункцияДокумента = "Invoice" Тогда
						СтруктураДанныхСФ = ДокументПакета;
						Прервать;
					КонецЕсли;						
					
				КонецЕсли;	
				
			КонецЦикла;				
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанныхСФ) Тогда
			
			ДокументОбъект.Записать();			
			
			ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
			ДокументСФ.Заполнить(ДокументОбъект.Ссылка);
			ДокументСФ.ДатаВходящегоДокумента = СтруктураДанныхСФ.Реквизиты.Дата;
			ДокументСФ.НомерВходящегоДокумента = СтруктураДанныхСФ.Реквизиты.Номер;
			ДокументСФ.Дата = ТекущаяДата();
			ДокументСФ.Записать();
			
			Если Документ.Идентификаторы.DocumentId <> СтруктураДанныхСФ.Идентификаторы.DocumentId Тогда
				ОсновнойМодуль.ОбновлениеРеквизитовДокумента(СтруктураДанныхСФ.Идентификаторы, ДокументСФ.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Результат.ОсновнойОбъект = ДокументОбъект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда
		Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(МассивОшибок);		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДокументы1С(ПараметрыОтбора, ВидДокумента1С)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ВидДокумента1С = "ПоступлениеТоваровУслуг" Тогда				
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
		|	И ПоступлениеТоваровУслуг.Организация = &Организация
		|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерДокумента";
	
	ИначеЕсли ВидДокумента1С = "ПоступлениеДопРасходов" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеДопРасходов.Ссылка
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	НЕ ПоступлениеДопРасходов.ПометкаУдаления
		|	И ПоступлениеДопРасходов.Организация = &Организация
		|	И ПоступлениеДопРасходов.Контрагент = &Контрагент
		|	И ПоступлениеДопРасходов.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеДопРасходов.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "КорректировкаПоступления" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаПоступления.Ссылка
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|ГДЕ
		|	НЕ КорректировкаПоступления.ПометкаУдаления
		|	И КорректировкаПоступления.Организация = &Организация
		|	И КорректировкаПоступления.Контрагент = &Контрагент
		|	И КорректировкаПоступления.ДатаВходящегоДокумента = &ДатаДокумента
		|	И КорректировкаПоступления.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетФактураПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация = &Организация
		|	И СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетФактураПолученный.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетНаОплатуПоставщика" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплатуПоставщика.Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	НЕ СчетНаОплатуПоставщика.ПометкаУдаления
		|	И СчетНаОплатуПоставщика.Организация = &Организация
		|	И СчетНаОплатуПоставщика.Контрагент = &Контрагент
		|	И СчетНаОплатуПоставщика.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетНаОплатуПоставщика.НомерВходящегоДокумента = &НомерДокумента";		
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ



//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	
Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 3; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

Процедура ПриглашениеОтладки()
	
	// Может пригодиться при отладке в режиме управляемых форм, когда точки остановки в открытом модуле не срабатывают.
	// Достаточно вставить вызов данной процедуры в нужном месте и включить остановку по ошибке.
	
	Попытка
		ВызватьИсключение "catch me if you can";
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ТиповойМодульДиадока()
		
	РежимОтладки = Ложь;
	//РежимОтладки = Истина; // Для отладки стандартного модуля интеграции УФ, необходимо выгрузить его в КаталогМодуля
	
	Если ТиповойМодульДиадока = Неопределено Тогда
		
		ДвоичныеДанные = ОсновнойМодуль.ЭДО_Служебные_ПолучитьМакет("ТиповойМодульДиадок" + ?(РежимУправляемыхФорм, "УФ", "") + "_epf");
		
		Если РежимОтладки Тогда
			
			КаталогМодуля  = "C:\WORK\Розетка\ПМ\temp\";
			
			ИмяФайла = КаталогМодуля + "ТиповойМодульДиадок" + ?(РежимУправляемыхФорм, "УФ", "") + ".epf";
			
			ДвоичныеДанные.Записать(ИмяФайла);
			
			ТиповойМодульДиадока = ОсновнойМодуль.ИнициализацияТиповогоМодуля(ИмяФайла, РежимУправляемыхФорм, РежимОтладки, КаталогМодуля);
			
		Иначе
			
			ТиповойМодульДиадока = ОсновнойМодуль.ИнициализацияТиповогоМодуля(ДвоичныеДанные, РежимУправляемыхФорм);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТиповойМодульДиадока;
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность="")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Результат)
		
	// Ищем ТОРГ-12 или УПД, относящийся к другому (не к текущему) пакету, и находящийся в статусе "Требуется подпись" или "Подписан".
	// Еще искомый документ должен быть уже проверен и признан "хорошим" (возможно, его еще не подписали, но уже проверили)
	// Если такой есть, то по текущему документу будем отказывать в подписи, т.к. это дубль
	
	ТипыДокументов = Новый Массив;
	
	ТипыДокументов.Добавить("XmlTorg12");
	ТипыДокументов.Добавить("UniversalTransferDocument");
	
	Статусы  = Новый Массив;
	Статусы.Добавить("Подписан");
	Статусы.Добавить("Требуется подпись");
	
	Если ОсновнойМодуль.ЭДО_Использовать1СЭДО() Тогда 
		//TODO добавить проверку дублей для 1С-ЭДО
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.Ссылка,
		|	Диадок_Документы.АнализПроведен КАК АнализПроведен,
		|	Диадок_Документы.ТекстОшибки КАК ОшибкиПроверкиТекст
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Ссылка <> &ТекущийДокументДД
		|	И Диадок_Документы.LetterId <> &LetterId
		|	И Диадок_Документы.Документ = &Документ1С
		|	И (Диадок_Документы.Направление = ""Inbound"" или Диадок_Документы.Направление = ""Входящее"" )  //переходный период перед релизом 1.0.0
		|	И Диадок_Документы.ТипДокумента В(&ТипДокумента)
		|	И Диадок_Документы.АнализПроведен
		|	И Диадок_Документы.Статус В(&Статусы)
		|	И Выразить(Диадок_Документы.ТекстОшибки как строка(1)) = """"     //  ТекстОшибки сейчас неограниченная строка. Выразить работает в сторону уменьшения длины, но не увеличения
		//|	И Диадок_Документы.ДатаЗагрузки <= &ДатаЗагрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диадок_Документы.ДатаЗагрузки";
		
		Запрос.УстановитьПараметр("ТекущийДокументДД",	ДокументДД);
		Запрос.УстановитьПараметр("Документ1С",			Документ1С);
		Запрос.УстановитьПараметр("ТипДокумента",		ТипыДокументов);
		Запрос.УстановитьПараметр("Статусы",			Статусы);		
		Запрос.УстановитьПараметр("LetterId",			ДокументДД.LetterId);
		Запрос.УстановитьПараметр("ДатаЗагрузки",		ДокументДД.ДатаЗагрузки);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество()>0 И ЗначениеЗаполнено(Выборка[0].Ссылка) Тогда
			Док = Выборка[0].Ссылка;
			Результат.Добавить("ДУБЛИКАТ: накладная уже была учтена в электронном виде (дата " +формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy")
			+", номер "+Док.НомерДокумента+", загружен из Диадок "+Док.ДатаЗагрузки +")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКонтентОтвета(ДокументДД, Документ1С, ДействиеВДД, ТекстВсехОшибок)
	
	Content = ОсновнойМодуль.ЭДО_ПолучитьПустойКонтентОтветаДляДокумента(ДокументДД, ДействиеВДД);
	
	Если нрег(Content.Тип().Имя) = "torg12buyercontent" Тогда
		
		Content.ShipmentReceiptDate = Документ1С.Дата;
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Receiver, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, получившее груз
		ЗаполнитьПодпись(Content.Accepter, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, принявшее груз

	ИначеЕсли нрег(Content.Тип().Имя) = "utdbuyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.Creator				= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП "+Документ1С.Организация.КПП;
		Content.CreatorBase			= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";
		
	ИначеЕсли нрег(Content.Тип().Имя) = "utd820buyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.DocumentCreator		= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП "+Документ1С.Организация.КПП;
		Content.DocumentCreatorBase	= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";	
		
	ИначеЕсли нрег(Content.Тип().Имя) = "acceptancecertificatebuyercontent" Тогда
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Official, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, подписывающее со стороны заказчика
		
	ИначеЕсли нрег(Content.Тип().Имя) = "correctionrequestcontent"	// запрос на уточнение по СФ
		Или нрег(Content.Тип().Имя) = "formalizedrejectioncontent"  // отказ по формализованному
		Или нрег(Content.Тип().Имя) = "rejectioncontent" Тогда		// отказ по неформализованному
				
		Content.Comment = ТекстВсехОшибок;
		
	КонецЕсли;	
	
	Возврат Content;
	
КонецФункции

Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + "
					|
					|ОБЪЕДИНИТЬ ВСЕ 
					|
					|");

КонецФункции

Функция ПолучитьТекстЗапросаВременныхТаблицДляСпискаПакетовНаОтправку()
	
	Если ОсновнойМодуль.ИспользоватьПодсистемуДиадока() Тогда
		
		Результат = 
		"ВЫБРАТЬ
		|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Ссылка КАК ВидПакета,
		|	ВЫРАЗИТЬ(Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Значение КАК БУЛЕВО) КАК УПД
		|ПОМЕСТИТЬ ВТ_КэшВидовПакетов
		|ИЗ
		|	Справочник.Диадок_ДополнительныеСправочники.ДополнительныеРеквизиты КАК Диадок_ДополнительныеСправочникиДополнительныеРеквизиты
		|ГДЕ
		|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Ссылка.ИмяСправочника = ""ВидыПакетов""
		|	И Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.ИмяРеквизита = ""УПД""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Диадок_НастройкиКонтрагентов.Организация.СвязанныйСправочник1 КАК Организация1С,
		|	Диадок_НастройкиКонтрагентов.Контрагент.СвязанныйСправочник1 КАК Контрагент1С,
		|	Диадок_НастройкиКонтрагентов.Организация КАК Организация,
		|	Диадок_НастройкиКонтрагентов.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ВТ_КэшКонтрагентов
		|ИЗ
		|	РегистрСведений.Диадок_НастройкиКонтрагентов КАК Диадок_НастройкиКонтрагентов
		|ГДЕ
		|	Диадок_НастройкиКонтрагентов.ИмяСвойства = ""Статус""
		|	И Диадок_НастройкиКонтрагентов.Значение = ""IsMyCounteragent""
		|	И Диадок_НастройкиКонтрагентов.Организация.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
		|	И Диадок_НастройкиКонтрагентов.Контрагент.СвязанныйСправочник1 <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Диадок_НастройкиКонтрагентов.Организация.СвязанныйСправочник1 КАК Организация1С,
		|	Диадок_НастройкиКонтрагентов.Контрагент.СвязанныйСправочник1 КАК Контрагент1С,
		|	Диадок_НастройкиКонтрагентов.Организация КАК Организация,
		|	Диадок_НастройкиКонтрагентов.Контрагент КАК Контрагент,
		|	Диадок_НастройкиКонтрагентов.Значение КАК ОсновнойПакет
		|ПОМЕСТИТЬ ВТ_КэшНастроекВидовУПД
		|ИЗ
		|	РегистрСведений.Диадок_НастройкиКонтрагентов КАК Диадок_НастройкиКонтрагентов
		|ГДЕ
		|	Диадок_НастройкиКонтрагентов.ИмяСвойства = ""Основной пакет""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КэшНастроекВидовУПД.Организация1С КАК Организация1С,
		|	ВТ_КэшНастроекВидовУПД.Контрагент1С КАК Контрагент1С,
		|	ВТ_КэшНастроекВидовУПД.ОсновнойПакет КАК ОсновнойПакет
		|ПОМЕСТИТЬ ВТ_КэшНастроекВидовУПД_Приоритет1
		|ИЗ
		|	ВТ_КэшНастроекВидовУПД КАК ВТ_КэшНастроекВидовУПД
		|ГДЕ
		|	ВТ_КэшНастроекВидовУПД.Организация <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
		|	И ВТ_КэшНастроекВидовУПД.Контрагент <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КэшНастроекВидовУПД.Контрагент1С КАК Контрагент1С,
		|	ВТ_КэшНастроекВидовУПД.ОсновнойПакет КАК ОсновнойПакет
		|ПОМЕСТИТЬ ВТ_КэшНастроекВидовУПД_Приоритет2
		|ИЗ
		|	ВТ_КэшНастроекВидовУПД КАК ВТ_КэшНастроекВидовУПД
		|ГДЕ
		|	ВТ_КэшНастроекВидовУПД.Организация = ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
		|	И ВТ_КэшНастроекВидовУПД.Контрагент <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КэшНастроекВидовУПД.Организация1С КАК Организация1С,
		|	ВТ_КэшНастроекВидовУПД.ОсновнойПакет КАК ОсновнойПакет
		|ПОМЕСТИТЬ ВТ_КэшНастроекВидовУПД_Приоритет3
		|ИЗ
		|	ВТ_КэшНастроекВидовУПД КАК ВТ_КэшНастроекВидовУПД
		|ГДЕ
		|	ВТ_КэшНастроекВидовУПД.Организация <> ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
		|	И ВТ_КэшНастроекВидовУПД.Контрагент = ЗНАЧЕНИЕ(Справочник.Диадок_ЮрФизЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КэшКонтрагентов.Организация1С КАК Организация1С,
		|	ВТ_КэшКонтрагентов.Контрагент1С КАК Контрагент1С,
		|	ВТ_КэшКонтрагентов.Организация КАК Организация,
		|	ВТ_КэшКонтрагентов.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ЕСТЬNULL(ВТ_КэшНастроекВидовУПД_Приоритет1.ОсновнойПакет, ВТ_КэшНастроекВидовУПД_Приоритет2.ОсновнойПакет), ВТ_КэшНастроекВидовУПД_Приоритет3.ОсновнойПакет) КАК ОсновнойПакет
		|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоВидамУПД_Предварительно
		|ИЗ
		|	ВТ_КэшКонтрагентов КАК ВТ_КэшКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовУПД_Приоритет1 КАК ВТ_КэшНастроекВидовУПД_Приоритет1
		|		ПО ВТ_КэшКонтрагентов.Организация1С = ВТ_КэшНастроекВидовУПД_Приоритет1.Организация1С
		|			И ВТ_КэшКонтрагентов.Контрагент1С = ВТ_КэшНастроекВидовУПД_Приоритет1.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовУПД_Приоритет2 КАК ВТ_КэшНастроекВидовУПД_Приоритет2
		|		ПО ВТ_КэшКонтрагентов.Контрагент1С = ВТ_КэшНастроекВидовУПД_Приоритет2.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшНастроекВидовУПД_Приоритет3 КАК ВТ_КэшНастроекВидовУПД_Приоритет3
		|		ПО ВТ_КэшКонтрагентов.Организация1С = ВТ_КэшНастроекВидовУПД_Приоритет3.Организация1С
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КэшКонтрагентов.Организация1С КАК Организация1С,
		|	ВТ_КэшКонтрагентов.Контрагент1С КАК Контрагент1С,
		|	ВТ_КэшКонтрагентов.Организация КАК Организация,
		|	ВТ_КэшКонтрагентов.Контрагент КАК Контрагент,
		|	ВТ_КэшКонтрагентов.ОсновнойПакет КАК ОсновнойПакет,
		|	ЕСТЬNULL(ВТ_КэшВидовПакетаУПД.УПД, ЛОЖЬ) КАК ИспользоватьУПД
		|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоВидамУПД
		|ИЗ
		|	ВТ_КэшКонтрагентовПоВидамУПД_Предварительно КАК ВТ_КэшКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшВидовПакетов КАК ВТ_КэшВидовПакетаУПД
		|		ПО ВТ_КэшКонтрагентов.ОсновнойПакет = ВТ_КэшВидовПакетаУПД.ВидПакета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация1С,
		|	Контрагент1С";
		
	Иначе
		
		Результат = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Документ,
		|	ЗначенияСвойствОбъектов.Объект КАК Ссылка,
		|	ЗначенияСвойствОбъектов.Значение КАК ВидПакета
		|ПОМЕСТИТЬ ВТ_ОтправленныеДокументы
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство_ВидПакета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВидовПакетов.ID,
		|	ТаблицаВидовПакетов.УПД
		|ПОМЕСТИТЬ ВТ_ВидыПакетов
		|ИЗ
		|	&ТаблицаВидовПакетов КАК ТаблицаВидовПакетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Организация1С,
		|	ЗначенияСвойствОбъектов.Значение КАК ОсновнойПакет,
		|	ВТ_ВидыПакетов.УПД
		|ПОМЕСТИТЬ ВТ_ОсновнойПакет
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыПакетов КАК ВТ_ВидыПакетов
		|		ПО ЗначенияСвойствОбъектов.Значение = ВТ_ВидыПакетов.ID
		|			И (ЗначенияСвойствОбъектов.Свойство = &Свойство_ОсновнойПакет)
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство_ОсновнойПакет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаКонтрагентов.Организация1С,
		|	ТаблицаКонтрагентов.Контрагент1С
		|ПОМЕСТИТЬ ВТ_Контрагенты
		|ИЗ
		|	&ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контрагенты.Организация1С,
		|	ВТ_Контрагенты.Контрагент1С,
		|	ВТ_ОсновнойПакет.ОсновнойПакет,
		|	ЕСТЬNULL(ВТ_ОсновнойПакет.УПД, ЛОЖЬ) КАК ИспользоватьУПД
		|ПОМЕСТИТЬ ВТ_КэшКонтрагентовПоВидамУПД
		|ИЗ
		|	ВТ_Контрагенты КАК ВТ_Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновнойПакет КАК ВТ_ОсновнойПакет
		|		ПО ВТ_Контрагенты.Организация1С = ВТ_ОсновнойПакет.Организация1С";
		
	КонецЕсли;
	
	Возврат Результат;
			
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(Документ,	ВнешняяПечатнаяФорма, ИдентификаторКомандыПечатнойФормы=Неопределено, ДопПараметры=Неопределено)
	
	ИсточникМакета = Новый Структура("СсылкаНаВнешнююОбработку, НомерСтроки", ВнешняяПечатнаяФорма, 1);	
	ТабличныйДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Документ, ИсточникМакета);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();	
	ИмяФайла = ВнешняяПечатнаяФорма.Наименование + " № " + Документ.Номер + " от " + Формат(Документ.Дата,"ДФ=dd.MM.yyyy") + ".pdf";
	
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
	Возврат Новый Структура("ИмяВременногоФайла, ИмяФайла", ИмяВременногоФайла, ИмяФайла);
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

РежимУправляемыхФорм = Ложь; // Определяет версию типового модуля: ОФ / УФ

